node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 7432706
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "jc\353\2740\335\245<\020\244\014\276\254\022\270\275\277\324l<\245\231\031\276\031~\203\275$\215\215=\321K\276=tq^=\232t\016>\370\016\354\275\037vN;\346\330\277=\"\256N\276>\263e\2752\332\322<\227\362\303\275\305\366Q\276\322\324W>\357T\027>\021\017\303\275\310\320c>{\342\021>\266\370\240=\2752\014>\031\261\177\275\333L\304\275\236_L=1\377\231\275\023\243\037>\217H)\274\357ye\276\206k\367\274\363\237l>64P\276\305\276\035=\326\276==\251\215\013> \\\344\275\321\211!\274H\375\263\275=\237n\275\306\257^\274\3771\022\276\334\232\335>\033n\204\275Zj\\\274\253\303\206>b3R=\252\226\366\275\231\363\254\274\302l\223=i\212\300=m\035J\276\023\367\035:[\370\222\273\315\320\313\275rs\250:U\373\027\276\365\265\001\275\346X\036>\020\021\035>\247\034R\276\372\310\006\275\233\372.:{\013d=:\365s\276\310\344@\276\300\243\227\275\234\346\021>\251\003\024>6\006\000>\224\001\320<7\266\201\275KF\337<;\201\272<\306\005\274=\276\037L>\231=-\276{\200\261=\236\347\275\2755x2<CU\036>^fp\275S\244\351<\224\376\007\275\263p\264\275\243\310\245=\255e\001>_\222R\276\352(J\275\347\275!\273\354\323+\276\001\376\243\273\375-\305\275\230-F>\260wd=*L6\276j\341Y\275;u\252=\026\314Q=\027\013f>\351\017=\274\031\207Y\276\001\2040>+\031\027>\274\203Z>\275\tC<S\001\'=\253s >1lV\276e\000\004>Ao\326\275\023=*\276\253:R>\016\347\204\275\377\353y>\236t\024\275{R\332\272\200\230\265\275|\347v<\206\206\201\275\n\306\224\275-\022\237\275\277H\014>\tS\021=\325\351\n>206\276\321\365~>\003\302e>\347B\267=\257 \230\275\364\037\227>\271\"M\276O\360\n\276|\270\t=\034j;>EQ!\275\'\251\260;6\"\336=}\230\236=-\326\256\275\325St\276\210sw\2752\307&=\177\\S>\257D\"=\275\237J\274\002b\314\274\313W9\276\265\303\000\275G\021a=\200\203\320=\354k\200\274-}\001\276\215\023\027\275\332\302\004=\222\201\014=\242\200\366\275\323\304\037\274\307\013\226<_V+\275\217\303\214\275\262)\260=m\335\266\275\016\0330>\020~\213\276\235`T=E~F\276\377+&=\360\313\232> \237\224=5\215\234<<\377Y\276\317\335T>i\036\033>q6\253=\000\255\004\275u\371\300<\353`\307=\240%\316=\273i\002>p:\200=\246e\204<\340\316\302=\354\311/\275r\240\014=\212\355 \276Q8\345=\326\205h\276.\371\307<\002l->\215 \214\276\274\2273>\216\326O<ls\251;y\001U=\025i\005>z\227.>~_\372=\022x\231=\357\367\001\276\n,\252=\001\034\001<E\242\357\275\334\"A=:63=r\215=\275_@\203\276p\366\026>\231r\213=\377\0257\275\237Q\332\275\273\322\333\275\30430=E\205\r\274\346e\324=\232&\034>\271\361t\276Z(\207\276w\3559\276r\357\005<\316\327\265\275*\203\303=^\022\203>\201\362\225\275I\2120\275\232E\004\276k*\r\275\307O\'=\260\261\365<\325\273\243=k\214\300\271\361\205\323\275G\016\275>H\245\033=\255\337\235\275\006\322\221<[\326)>$\014\336\273\022]U>\337\005\232=\204\216p=sPO\275c)\037=\004\231U=\217}A\276t\352\334=\214w\263\274y\342\320=\316\025t\276\335w\200\275\220i\237=>\003\236>9\325\241\274\375\367\257\276\027\220\317=\216\002\323\275\246\0071>T(\000>*\203\361=\355\022\203\275RtB\276k\217\t\276uK\307\275}\231\020;\r\276Y=q\324\276=\332\262\243>\230\005\210\275\267\266z\273\262\236\345\275\317\317\272\275\373\001\022\275Aj\212\275\201\255\340\275\310X\203\276m\257\026>G\252z\274\'\251G\275\301\017\307=\247\227;\275\336\024P>\202\220\320\275\362\230\271=A\246\223\275\357\243\343;\256C\210\275\355\222c\274. &>\234\271D=\3278\'\276\007$\200;L4\r\276\345\226\270=%\240\020\276AC\242\275\003\356\205=\316\326\345\275\221\250\030\276|\326\205>\024\247\247\275\0066\225=0u\237=m/\204\27585\270\275E\222\337\275/i\317<\"\337\262;{\310I>\322\023G>\241\271\371<: \254\275`\355>>\212\331n=p\364\003\276~\200V\274\314j\032>\353\372\354\275T\264`=Dn\314\274\255\320u>\254?\323\275:\214t=\261|2>F\003\240=z\301G=p0\247=F\2755\2758{\321=Oeg<\354\017x\275\240\207/\276\250\202l>O\027\n=\006\372\225<\277\265\032<\254\332\036\276d\250n=61\300\275#or\275\260}\227\275\367$\310<<\341\240>.\017\365\274B\2154>\0014l\275\275[:\276!\243i=]\354\025\276\246\254\203\275Zf\026\276r\324\2368-\216\212\276\317^;\276\310M\205>\371\236\221\275\342\004\302=\301\314\006>\366\007Y\276,\355\232\276\006x\027>\333\252\013\275\014\024->*\230z\275Mi\016\276q+0\275\250|\364\275\000\201F>a\221\267\274)\232\200\274\262\010$\276\020F8\276\013\305~\275\321\'>>P\265\252\274CC\034\276\n\335\030\276\372\352\332=\030\232\271=\'\364\255>\256\305N\275\344\201&=HD\233\274\224\230\237\275DH9>t\240\036>\374<\277\272\024\374\257=\222\224\220\275\366;A\276\324\177b\276\260c\235\275\354\243D\274\272\030I=Fv?\275\245\017\025>E\323\245\274\027\227\322=\2707t=\242\340\245\275NX\233\274\316\350\221>\220a\033\275\256\355\231\273\004\">>\300\364\335\275\\\262:<\036\320:\275%S=<]J\221\276fG\270=\026\305q=P!\302\272\256\177\336\274\223gU=\274t\331=(\345\330\271\020\200\022=\322\210\201\275\220^\003>\rgM=i\337\007\274\315\001#>\"\237\244=F\007\034>\316\3425\276\n+\007\276kH\037\275A\r\356\274+\303\t\276\224\226\372=\203\023j>\222n\006\276X\024\260\274U\225\275;\030\256\031\276~\260\257=/j\203<\274\343B\276\177\tT>%p\264\275\37442\276\3640\365\274\203\247\272\275\254\271\206\275\300\020#>\241E-=\317\275\266\276+\322\006=\307y\321\274_\207\277=E\262\020=`~\206\274fA\375<\326#\371\2740\3613>\020+E\2761wc>\263\224\252\275\223\004\337=c\311\177=\340\376i=>WT\276s\371D>;\\\307\275\303\243I\275\'\263\225=\021N\236=\374\204Q>\366b/=\251\034\212\274:\327\301;\030A\250\275K%)\276\342!\025>\316\227l\276\205\211H>~\032\356\274&\205t>.>\234\275\003\234\270\274\354\271\226\275\242\321\307<\254\310\327<I\336\200=\337&f\274\240\031\375\275\220&\354=\364\306\247=\010\025<>)1\227=l\370g\275|\312\204\276e\006\r=G\377\035\276o\3114\276\210y\020\275\344Nq\275\004\024\302=\342\203V>\337\304\235\2755D\362<Q\000\006>\273\215\213=\336-6\275dS\014\274\263\336\267\275\224\023\026>G\372*>\362\234-\275\206\336\332=\253\325\314=\244\251v=\217\207:\276\301fe\276\271\331\010\276\263\354\316\275\241\242\265=(\300\034>\210\033j\276\337T\342<\273((\275\207\2508>\247\201r=\354\300!\275J\227\261<\252^\213\2766J\253>\236.\032>T\033\275=\340pi\275\331\021+\276\374\t\020\275\354\327\244=\231#\023\276/)\335\275\254\215\267\274\311\300*\276\205\r\371=L\336\240=\375\334\303<\266\004\024>\365\322\336;\006\264\033\276N\263\026\276S\275\201\275\255\310\316=\375\347C\275x\251!=9\374\024>k\307!\276|x\217=;\305\326\273\005~\036\2769#W>\266\265_\2750Fv=\272yU\276\354F\026=\327\"O>\006\2259\275X!<\275\010zE\275\277\306v\276*\355\347\275\270\2209>\016\361R=x{\227>\235\263\230=\002\230\002>\316\233\002\276X\330\202<\346\022p=Sh<>2\026Q>\351\234\355=\245\210\264<\342\023\251=\251\354\004\2751t\250<\313h\213=\21299\276\331+\330\275\312[\242=\265L\272=O\324N\276\007\233i=\321\224&>\3377\026\276\370o\312<,c\313\275\224\357\373<S\347\317=\306\361\215>\271\250\r>\361N8\276\277\t\357\275=\354\037\276\024d\006\276X\316\344=\246)\037>\001\220e=3\230\004\276Bd\222\276\361\341\366=0I\241\275v\353\005\275J\311\216<\332\\\004<\002\222\313=\003\273\204\2769j\"\276\326?\303=\371-\314\275J\342\204=\305\026\335<\351\020\230\276=;\257\274\2377\014>\264\270q\276\352\025\363\275\217\2457\275|)z<\357M\276=J\304\006;\221\301\256>)\240E\276\347\006\212\276i3\314\275N\231F\275\233\224Q\274igY=\230\343\213=\306z?\275\236~\306\275\273#-\275\242\215(\274\211\370J=df\277;(x\270<\341\003`<-\031\037\276\244\004\274\275\377N[:{&\224\273D\315\'\275pd\232=n\367\023>+!\026>\257\006\025\275\315 \343\275~i\206\276\0259\357\274\270\225/\275\226\325\302\275zV\377\274)\nZ\276\202\r\030>\005\275\376\274\302\377a>\350\371\306<\321\324\202\275\341\254d>@\005\021\275\030\316\332<\327R\251=\273\303\251\275G[\232=\351\353 \276\234Z\301\275\311\251s>\266>t=,KW;bG\261=j\031T=\235\177\325=\216n\314\2759\212\300=\357~\203;\226\303\304<$q\277\2752\263[>\340\276#>\263\233\313\275\017\333\226\276u\352\034>\3634\327\275\330$[>\034\303m\274\003\254V>a\345s>\363\020\t=\272\246\220<]\332\307<\006\036G\276\365z\302\275\362z\352<\017\212\360=\352\343\\\275\311\276\343\275\311G&\275E4\246<\262s\200\275\336\310\217\275q\205\255>\300o\333<\212/\024>\355\2374\276\220\332\037\276\345\273\210\274Xk\225;6S\246\275\310%O\276\320L\361\275\001\333q=AM|\274\3339>\276\236\247\227\274\253 \336;f\3172\276\212UX<\001\262\221\2759E\003\276\3350\025\2761\243\031\276\360E1>\023\273B\276\246^\243<U\277\276\275\3246\213=\010\261\306=\234\003M=\373\337\307=k\256\013\275\\#\213=3\373\210=-\342T\275_@\243\275|\221\265\275\274\035\222\276\303\227\226<\300\"\307\276\363\001\r=\203\001\253\275\356\366\336\275*\263r=C\344\365\275N\227l>$\235\246=\030y\"\274~\322\314=\rz\230\275\340\364\016>\\\333\340\275j\r\326\275#\0335>s0\240\275\216\322\002\275\rj\017\276\310\243 \276\017\030`=R\017\022>>=i\275\267$\034>\213g->\265pN=$\230\t=\300\257Z=6#\021>\355\371\032\273\362\375\r\276\373\370\200>\327T\332=\247i\327\273w\035\024\2767X\024\274\330x\204>\000d\004>( \327<T\n\354<\026\2512<(\t\344\275|\3504>\234\262\024=\225\222\340\275\202f\315=Mz~\276L-\\\276b\351#>\311\247\002\2768\370\350\275c;(\275\017\267\303\275KNl=\'\351B=\227\3500=p\374\023\276:\316\014<\266R\033\276\363\341>\275\332\310s\275_b\n=P\213\030=\323/\"\275\016Y\016\273/2\030=EY\325>\276_\360\275\033\354\317\275\233)\230>\374\206\004\276\260\r\203\274,\243|=C\034\221=H\374\250;`\266\314\275B\320\241=\r`\367=\027\223~>\317H\033\276\253\274d\275|=&\276}\277\017>\311Y\024\275\033\330\252<\334DM\274Ct\275<\356\\\271\275\343\305\235=R\240\250\275\2615I\276\212\320c\274\220\320\022<\".3>\025eJ\276\272\035\245\2751\237W>\005CA>*\336\370\274g\004\013\274l\361\374\275\003\251\201\275IM\253\273\362V2>\230\3523\276\231e\353=\246\202%\276\220OF\275h\226U;\237\035J=U\255\355\275b\225\213=#\231q\275\255p\r\276\375Z\326\275\250\232 \276\2506n;\355^\234>=P-=\257z?\276\231p$>\273\261\372\275z\202\277;(n\223=\302*c\274\302\335k\275\224\2556\276\013q#<\00367=e{+=\"-\036>1\032\356\275(_^\275\203\232\207>\n\235,\276\374\363\205=\227\222\333=\262O\\>\276P\357<\343\3660>\031pL>S[\017;\255K\037\276\356\2059\276\271/\020\276R\243\344<oP\313\275#@\335=O\021\332\275\225@\216\276\231\231K\275k\026\370\274\314\251>\276\321}\211>\305\r\267=\206\326\321\274]Q\210\275\365\324\263\274\343\366\371=\335\352\213=U/\010>\232\334\363<\342\0371\276\021s\322\274\321\315\022\276\022\3041=\361\026y\274\024!\007=+\000R\275\\j\271\275\214\244\331=\006\3474\275.\316\333\273\350\305\311\274O\230\005>\341p\210>\367R\016\276\211\261F<\374\344_\275\002\311\300<\224MA\276\376\332\320=\245\253r>\337F\307=4c\326=\003\217\364\275Jw\217>\234X\037=\006\002\003\275D\037\023\276\022i\353=\336\334\030=\327+F>\232v<=\016\354B\275\302\034\004<\340\351M\275um]>\231\202I\275\325\2421>T5\203\276\314j.>\253+\027\273c+\300\274iO\037\276\3403A=\241\211\336<\023\274\246>\272\n\257=\217\377\255\271\034l\254<k\035C>X\215J\275pk\361=hW\203>p\254\265=\367+\031\276\256\232\314={}:>\330\257\263\276\001cs=\277\010\227\275\232\2617>\254\322\364=\343\363?=U/\337\275\330\376\232;`<\363\273\352b\014>9\225T\276\000\354@=P\013\001>\351\004\025>\362u\253<\263/\334=\302C\026>?w\257=\330\202\263\275\221\016\224>/\210Z\276\'\274\264\274\031\033\221=Q\332\256=\335\263\350:\217\016\034=\251\301;>f\021?\275vl\217\275s\254\215>Wa\026=\215P.\276\304\243A\275\245m\003=\302\202\242\272To\321=p\242\265\274j\354$\276\265\243\257=\264C\203=N&\r\274\314\366\t<v\3105<\023\341J\276\317\215V\276\366#t\274%}\026\275G\262K\276\321.\033\275\200\363\006<W\273\003>1\265e=\2320F>\352\022B\276x\354\316\274\211\252\305\275\212\260\024\2763\243\"\276\356\321\242=\207UN=H\352\226=~\031\277=\233\302\310\275;~\025\276\327\017 \276\014\244\005>h\tE>d\332\267=\206\000P>K\301<=-\225X>\330\316\">\251c\003>!\377\313\275\365R\003=^\214K\275Yn\235>\245\210|=KS\335=\277s\340=\365W5>$t\001>\304 \033=J\256\306\275\251S\013\276\207\2154\274\376\223\263=\265\233#>a\353\017\276\364w\327\275\3647\352<>\035\343\275+\321\r>\361\336\265\274\005\334Z\275\364\367\327;M%\242=-\227\266=\261\205\307:\013Oo\275\306D\216\274v\274j>\334m\025>\372h\221\275\341\202p\276\327\353\257\275E\374\377=\205\007G\275\353:)>\257\'\205\276RU&\276\234\343\244\275\324\325\377<\267\n\006=!n\256\275\225\362A\276\342\037a\276c\021\255=\263\016\n>\003\322o>\331\250\226=\331\337<\275\202\177\356\273\364\036\"=\306\032\230=\353\311l\276\021\316l;\275\256\205\276\231\231\250=\340\341G=\321/^=\325\352@\276\323\322(\276\202M\025=\014\210y\275x\316\377\274nZ*>\362\351\312\275\225|\230\275\265\255\264=\033`\271=\306>\254=\357\335\216\274f\016N\276fo\017\275\226\235\232=\013\225n\276\300C\321=\302\232\033\276-\332\315=\264\350\275\275\360e\370;\026\232\276=\201\034\207\275\177\246\033>#Z\354\275\201\334\312<\024\361\204\276m\373\243\275\366\':\276r\004\224\275)=:\275\263\306\001\275\236\277!\276\323`a\274\255[\266=\270\360m>\355t\030>{{ \276\037\362\252<\310)\254<\022X~\276\n\226\2138\227{\023<\032Q2\276|\213P\275a)\212\275\002\016<\276\226\004\214\276\027d\212\276\275\020\001\275\210\252\271\275e\253\241\276\374\3123\276\365|\206<\001e\202<d\004\034\275\"4\354<P&\010>j\356\362\275\243\224\326=\256\0349=\014\210\316<\214\301\267=\315i\020>\222\271#>\324\0374\276\325\364\271\274\370\323y\274\032,\337\275\014\026\312\273\344\303V<\207\315\372<\276l6\276\253\274=>Q\020 =\337\373\263\273\271c\217>8\274\235:\037\r5>\021\031\315=\024j\320\274\001\320\303=\256\224\033=\245\272Y>\373\264D\276:\257\211\276-\247\332\274=\'\343\275\354RA\275\320DX>}\260\234=\352\032\250<\036p\326\275\336\327\352=\373!i>\242\225\024\275\227+ \276\026v\027=Mbe=\232\360\324=\341\021\335=\313\003f=$\302\347=,\373\207=S\205\206\275\366XL\276\332\303\"\276\026\330f="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
