node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 8136891
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "Z\271\263<L\277\245:\203\246\222=E<\023>\373o\232=5-\220\276\030a\360<\375IL\276\203h\340<\3426\211>9\016\232<R\334E=}&?>Px\300=X{\304=q\373\\\276\267%\204>\007\000\372=;\313\375\275j\352\025\276x\202\350=vA\232=\317\372\013\276\222\'\272=6\323\235=\305\234\267;9K\024<\225\372}>\312\035\262\275\360\242\270=\310\013\373=\354\342\263=h\032\022\275\'.\303\275X\034\022\273\313\351\222=\271\326\273\275\302p\005>MB\030>6\313i=\005\001\207>\260\013\n==W\236\274\324\006;\275\241\014\317\275C\001\001\275>\035\317<\245j\007>\226\357#\274C\001\222=)\034Z\274\201}L>\'\222\355\275\341\345-\276n\220\320\275p\213\020\276\014l)\276\274h\233<\3056\331<\370Y\230\276\304\215\202\275\020\311\005>v\327\366=\t\375L=B\372\277=\210\333s>\274\200\211=jY\207\275.\237\231>\343\331\024=\2420~\276*\252\274=\365\306\302=S\306\340=\345\017\010>\235\223;\276\275\336\255\274\230\222\376=\365\276W\276\334\2519\275LHS=\321\373\014\275\245W\n\275\035\364\271\275\tX@=X\342\364\273\254\263\010=\356\205\004>\024\214\276\2757\367\256\274\375v\033=\300]!>\357\001e>\276\341\341=-\355\177\274\027\371\205=\332\370\276\275=N\000=\204\267w\276Y\333Q\276Z\333\007\276\360B$<\003\347\326<[7\333<\332\241N>\037]\"\276\366\rq:\225\356\370<\014\373F>\336!\357<\247\202\264\276\224\214$\276\037Y=>\205u\036=>\201\216\275\335\264s=\243\357\251\275\336\207\322\275\331x\212\273\300:\310=s\366\314=\034\250\205<\340\344:\276\264\375\201\274\026\304\230\273\343U\025=\342\200\211\275\376d&>^\227B\276J\260\376=\214\241$=\336\211\022\276\025iA\276\204\356%\273\234\300K\275\216X\026\276\260B\227;\253\212\224\275\361\022\200\276b\230\236=\242`\245\276\204\274\263=\223\267\236\274)\330\333\275\'\003,>\340\265\001\276\305\222N\275\304&\221\275C~\267<?\222\306:}\361\270\275\322\'7>\356yN>\262\242\'=r\304)>\325s\004>\274\373\353\274\220(\346=W\304\207>r\t?\276e#\246=\377U\315\274d\340\275\273e\335A\274T?\274<Z\305W=\363\345\226\276\022W\341\275\324\036E\275!:\216\274\305\247\304\275YW\257\274\263\025\235\273\302,\013=b\371\010=\371\275\001=+\213\262\276\331/I>\227\025\301\275\254\340\343<|\217>>\033l\031\276\0037u=\000\270\017\276\316ya\276o8$\275\034jh\275\001\237T\275I\324>\275\236_\341\275\250\322\230<\374W\333<GX\020=\213\232\245=\234\272 \274\200\265\021=\334\262\233\275g\020\221=\013\243T\276\206\\\257=\030/\302=\345\220Q>\306ib\275\356\200G\273vRf>Rw\216=\242\203w=y[\t\276\314eK\276\245\223\355=\307E\033<~z\355\274v\256W\276\324\007\037>\341\341\355;\321\217L>\372p\037=\302b\220<6\210\236\276\264\231\232=\373\267\t\276\356Zb\276EO1\276\353\014\321=\213\017\222=\221\r\035\275\007,a=\363\301D\274\346{\262\274\371~\023\275\234\271\207=\033%\246=9d\344\275/\016\025\276v=\036=Ck4\276\307\006\210\276@\225\301=yM\213>\000B6>\265M\251=\346UW>$\372\263=\231\207\244=z}%>\306\345\371:\244{\360\275a\t\010\274Hz \276RJ\307=As\350\275\263\222~\276?./=\275\322|\275\\\214\212=8\310\376=g>\t=\251,\324=\245\352\\\275\374/^\276|\203\315=\314\242\310\274Q\243\265\274\346\345&>\264\202\310=\334\205\360\275\325\035\235<\206w\033<\332\r,>\2024\224\273\3379\031\276F\260\025>\260\n\367\275\026\277?=\300J\307\275\221\202\313\276\032\216$\275\314%\306\275\336\244\202\273\217\024\003\276\241\303\353\274wl\352<\022\224\274=C\320\002>\225\220\301=\323\016\033>\312\272\254<$TJ> Ll\275\220\t*\276\372\177[=\024}\221\275\266\203\010>\345Cw<\024f,>\205\002\010\275yw\307\275\3400;>\007\252\262>\350\253\213=\374\023\216>\330\277?>\220p\017\275g\247#\275$\367S=|\322\374<\324}J\275g\366i>\230y\255<_e\314=\336?R\276\353\255{>:\331%\274\032\353\001\2760\354\227\275#\262\237=\244,\202=$E\026\276k\302\032>N\311\256\273\325\273\235\275F\325\300=\006\0346=\201=0\276\205v\200=\343\322\312=\377?(\276\240y\200;\r{\220\276\0340F=gY\356\275I\021f\274l\026\314\273\025\217\026>\321\270!\276\2138$=\200X\213=\363\344S>\027\222=>\272/\241\2758\226#\275!1\347=QF\\>\212\330$\276.\215\007>\3559\230\275\2355\014>\324!\010>i#r\272g\352\'>i\233;\275L\357\245=\213\247\306\275\021\024\027\275\027\317\350=\256\306h\276:\302;>j\204\004=|t(>\262T\2629\331\210\357\275\250\266\266;\371}4\276\236\0019\276\256M0<Q\t>=\244\354\363\275\'\322Z\276\201\365\005>\003\273\212=\0037\322=%9\261\272\003.\266=\236\310M>\266\371g=%S\336\275\177\224\312\273\024b\003\276S\n\010=|\302\234\275. \224\275|\314\267\275\231\373\030\275`\026+=\242\201Z\276bU!>~\376u\276\353\004\233=l\037v\275\265C\211<\327\204\304=/q\226>\350;\210=\267\346\215\274%~\010>\354\240(\275\342\n:>\272Z\333\275Ub\217=\363ER>\032C\214\276b\2328\276\246pl>\335\230\323\273\245c\323\275D(y\274\022E\335\275k\374K=\217\352$\276\247{!>L\365\201=Z\307O\276m\347\231\275\26080<\027\201\275\274~\035\325\275\206\311\2449\002Y=>\362R?>\207\r\266=*\026\365<\251\232\t>\323\305\013\276\206\334\037>\022\251\372=Ja\232=\030a=>\002cS=A8;>_&\365<4\005\275<\017mh\276\362O\231=\330\215\370\275\247\270\222=\313\tX=\031J\030\276\253g~\275\324z\227>:\366X\273\r\277\177\274\302\010?\273\240\377\360\275U\232\255\275&Cr>@\276\251=\014=#\275\031|\231\275n\260\221<\226r\266\275\315\254R>\275\2236>\355I\262\276\324\320\221\276\327\304\317\274a\217\370=\201h\321\275\331\230\333<\354q\342\275u\210\370\275\373\334O\275\r\317\204\275*\270s:S\030\276<W\262T>\221\252#\273aU\377<\302I\346\275pe\307<d\270t>lh\000>\200\033.\2741\276\275\275\035b\327<\351*\217\275\023\244\257=)\210\354\275^\351>>\346\221\261\2758\261\267\275\223J\331\273M\021y=\220a$>\031[\221\275m\034?\275\226\364\247=\255\240\272<\351\271\352\274-\363\343\274/\330\255\275\n\346\325=\r\242t=(\302\215>\026\t\206=\013\310F>\370j\276\275\367V-\274\360Z\024\276\024\202\336\274\355\241j>\033TI\2764;\001<\034\334\332=\324\221\r\276\371\365:=\0072\353\275\033u\023\276\244\210(=\322X\n>\367\234\007\274\244\021\340=\233TT\275g\242\202=F\340:=\301\315~\274o\376\310\273\234\267\025\2768\202\212\276\036K\'>\345\327*=\376\244I=n,\316>\352k\032\276\316wq>6\227n>?\301\320<\"?\247=\213\305\036\276\025I\345\275\375\344\232=\301B\010>\253K\262<\243o\007=)\005?\275\376I\013\276\332\361%\276O\"(\273\274\353\331\274\356*`>\206\000/\2743@\272=\035r\254\276.\354\225=\215\335\346<\272\343Z\275\250\261\007=\213P\242\275\311iJ=\210\214\000>\202M\205;\337\322\021;\240N\244=\017\004$\276\017\204;\275+\361\365=\357h\200>\254+X>_4\021\276\347\362\016\276\n\350\277\275d\265\371\272\254R\013\275\210\204\027\275&4\"\275\333\203\005\275{C\257=@\207V>RE\373<I\352V>C%\005>\247+\207\276\370u\200>\336\300\312\275H\313:\274\002\326\025\275\306<\010>\361\306P\273\234\203\020\276T\372\226\275\205D\026\276-\000\316\274\232EV:gW\010\274X\352\350=\tN\245=\307\372\346\273\245!5\275r\202\241=\306>\205\276\000cD>\342C\014\275\236\217\002\275Q4\315=\217\207\t>7\340!\276\372\253a\276:\211\003>\212\254\252<\251\232\010\276\274ZO\276\274\340\234\275\242B\240\274\026\356j>a\336\303\275K\325\017=\310\216=>V\341\277\275p\343@\275\323T\026\276\217\255H>\203Om>\216J\246>{.s=X\3745\276m\241\035\276\305\2763>5`\341<8y\313=\221\231o<<\021v<r\263=\275E1\016>H\262>>\354a\017\274\261X\206\274\302\010\013=\365\375Y\273\371T\234>\320\346\351<\342Y\203<\317\006\n>\345\232\023>\203\032)\276\237=\300=\276\266\256=\240;\020\274\004\307\255\275zK\305\275\334\236\024\276\245\216\"\275\234\364\333=Y*\240=ep\315=\275\316}=\373w#\275\3155@=(dL\274\330\016\023\275\275\362\231<g,\332=\030>\334\275s\026\031\273\275`\021\276\330\234\240\275\374\231\\>\020\365\\>\310\373\002\275\032\001h>@sA\276\263V!>MW\001\276\360\376*\275\234{\325\275\207\274\207\275\362ts\274\320a2>\216\346)\274\236\314\001>?\2236=\363A\372<\031\002l=\001\322\353\275\206i\342\2750\377V>\2229\233\276$\331\242=\373r\321\274\3103\304=\231!K\275\302\262a>#%]>B\220\017\275\303T\224\275R\340\n=\210Ei\275\263\324\353\275\200,\250\274\003\005\013>\371Nv\276\265j\336=\376%\037=\004\350\221=\243\224\031\274[\367*\275!\205\262\276x3\002\276j\2671\276,\322b>\013\310W<\255\024\307=:s!\276\366\370\212>\361\030\325\275~\203N>\035!\370\275=\310\341\275\003&\370\274\301\027\375\274[\236\027\276]s =\025[\277;T\2561=\3727N=K\215@>\3464m<]\340\215\274\3426\210\275\235W\025>\353\264v\274\225]\032\276h\322-\276R\221\310\275\375:\331\274\2563\371\273\256\037\210\275|f\375=\177\302)\276\004\3146\276\222\026\016\276<DS\276_<\032=\254\002\022>\360i\025\274\223aA\274\212\257\036\275\022\217\030>\033\300\274\274y\217\262<\340\270\273\274\032\315\371\275|\315\000\275m)}=9\274\207\274\313\177W\274B\302\211=\330\313\375<\034\004\017\273b\264\010\276\213X.\276\354\376G\276$\211n>\226\335;>\305\375\326\275\235\336\212\275\025\'\225\275\004\307b\275u\343]\276\262-\314\275`\370\325=\223\3245\276Q\301%\275\265\204\222<\007\376)=\262\211L\276`\023\330<\007G\364;f\034\320\276!F\251<$\215V>\242\300a\275\024I\260<\370\005/>\361\274\003=f\371\276=>]r=\341\037\030\276\274\360>=6\026\206\276g9.>iT/\276\303\3400>\024R >\260\202\006\276\220\n\n\275I\177\027<\206\220\032=\244h\204\274\034}Q\275\353\033\205\274`\205\215=\343~\216>NEY\276!d\355\275<\364\214>\265V\200=\306\rN\274C\364\265=\206\244\034=\026\335H\276\327\3502\276\177Ih\275m\200\024\275O\267\225>nI\020>G\023\342<\204\237\r>\265\360\035\275lB\215\275\355(\264\2741S\001\2756\275\301\275\266\373\366\2757P\001\273a\370L\275\267\337B\276\020w\357=\224\330E<2\265\005\276+\"\356\275\327\301\337\275\371Tb=\346\326\343=\363\357{>if\030>W^\253\275\316\367\023\276\207T\324<\215\327S\275(\322\221>`CT>PS\375=\0325v>\210\250`=\307\242\203\271\335>V\274GEs\274\221T\265=\336\274*\275O\'\267\275uK\021>\3442)>c=p\275\274\213$\276\007\006\265\276+J\033;\263\221&\276#6&>\000\206\334;\301X\232\275\220\245P\275\026\376\240\275B\277\"<\026\3521>e\274$\274Mj\r\276\350O\020\276OZi\274IC\216\275\0163\206=\374\231\177=\272? =,5$\276\030\233\n>e\024B=\205\345t\276w\367\200\274J&\245:\374P\021\275\241\027\030>\303u6\275\273\326\302\275\014\rY=\250\033O\275\247[\233\275H\200\203\276(H-\275#\272f\276\327$\023=\357\3547\276\327\224\347=\014\226\032>L\033F\275\021/\233=&z\t\275c\344\237>\323#t=\253\346\221\276\312r.>F8r\275\223xg=j\352\030\276\277\3339:\336\313\027\274\302DO\276\302\277@=\336W\242\274Ef\t\276\310\034\237\275\256U\337\275\300\001\010=\2347\020>\263r>\276\26054\274\275\365\333=G\264\355\275\332\371$>\375J\371=\301\356\214<\305\323\230\276\206\373S\276,h8\276\376\354\200\276\250\247h\274\372T\233;\021{b<_q\003=\207\274\'\275g!\021>V\227\363=\321!\346:\265T\032\274 \230\032>\211\2073=\204]\324=\233~k\275j-)>\016\250\302<\242v2>\263\221!>\032\026\006\276c\016\212>\312T\375\2733\232\332=\370\361\016>!\214\335\275IX\357\275]\317\007>*)h<\321\001\223=\026:\006\276\300Gm\275\242\034\207=\221\257\244=\310\325\311<)R\377\275-\310\364\274\177w\207=Eq\237=|\347\276\273\253-\007>\251\235T\276{\212\260\275\230\250\203\2762}\333\275Y\324\213\276\352Y5\276\313n\237\275m{\033\273\327K\215\275,~3=/\214\023>5D\334=\316[\343=w\323\356\273\333\371\274\275_\256\002=\371n\013\2756f\336=\007B\335=\345\2518\275x\234\025>A{\037>\3469\013>@\373\307=\030\000\201\276.\247\322\275\005\005&\275\013?\013>Mj\223\276\370\007\255\275\200\010\350=\206\027\232\274\t$\024>\303\014\t>\225\310!\273~\266Q\275\021\322\206\275\240*3\276\333\320?\275>@ \276M\252\224;\242\027\305\275\034K$\276l0\213\275\236!\323=\230\312\223\275\'G\033\276\331\236\215\273\342\301\021>\313%C\276]\013\230\275\344SH\275\306\240\247=(HU\276B\310\302=\010<\226=\352;\340=\373>\241=S\206N\276\213\027\332\275 \216\255=x\302W\276\321x\032\276\367\257\306=\006\227\310\276\360\253\004=\264\202\202=\207Z\315=qt\367\275f3\210\274\001\243\364\275e~K>\335\353\240\275\345.C>\304?\353<\3706Q\275v\007\226\276\330\375\263=g\327\036>\233\215\216\276\353\240\364\275\025\365\017>\347\245\220\275\236\327\370\275oW>=0\352\010\276F\361\266\274\350\261I=k\270\'\275u\363\266<\034\021B>\027\325(>\203\227W>\222\334\014<?\352\341<e!.>WX\316\274\310y\037=Ng\206\274\342\033\232=.\352\016\275)2\361\275\336\204i\275\302b\247\275\325o-\276\322\320\231;\227\301J>\331\307\352\275\343W\n>|\367\341\274\330\320>\273j\272j;\230J\020\276.\336%>Kq\017\275\235\367\005<\215\203\250\276\267H!=\250\260\273\275\352\306\347=\367t\005=\000\304\232\275\033u\346=+h\262\276&\262\035\275\303\365\361=D:\024\275\021\177\362=\016\335\215\275a\263\374\274\363\256\203=\275\332\"\2750\037>\276\317\354#\276\213\315\304=\014\231\327=>\030\241\275\210\005\256\275c):>\254\036#=\013D\200\275\034\303\241=\203Q\361=\263\217\372\275>qX\276z\322\310\274Q\372I>\026\311\355;C#T\273\371\363\026\276=\tQ\276\177\225\026>eq\r\276\251d\252\275\346f\231\275\007\302\316\276\246u=>\351)\266=,\3439>\217D\035\276\323s(>\310\224\023\276\221Mp\275\232\256\343\275\233\020\003\276\036\257\271=\343.v>\351\221.<\261\367E<\351C\375\275c\263{\276\315\010U\273>\243N=!`\337=7\361X\275\006C\247\275\r:\014=\221\017F=\226\247\226\275\026\241\357\275\002\320\345=\237\372^>yXa=\000\223\314\275\245k\221\275)\267\014=,\000Y\275\304\265Y\275ZS\320;c\376\323=\237\203\242\275]\214\212=\231\034\367;\337\230\027\275/\356\371\275\255\263\375<YT\260=\007\236\\>[?\007\275\007;\'<\000\245\035>F:\311\275\343\225\375=\"~\324\273\363\026\362=\022\274w>\275/;=\245\351\272\275\261\251\023\276\242\327\026\276\367\016\240=\324a\245\275\260\235\214=\303\2370=;\335g\276\20684<\305\334\247\275\321\314J\275\333\356\335\275\304\344\272\274S1\262=\306\260{<?\247\034>_\202r\2750\344\">\\\367\010\275\320+2>\213\220\316=5\2231\275\257\2275\276\204\2135\276*\363\237\274<\217\325\274\217\346%>\203\265l>x7\335\275(\311X=\375\326\272\275S]\370\274%\266J\276\\\366^\275\0025\201=!\367-\276\003\314\246\276\304\353_>\344\245\227<<+\247\274/X\003\275\210\324\212\275\326\245\302\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
