node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 4924115
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "I\204w=\006[m=\234\304\022>h\0161;\237\2440\274$\330\324=\234\315\010\276s-7\276\010:\033>T+\336<\263\220z>\371\003\365\275(8\207\275\221\211T=\244\371r\275\306\325u\276\342b\312=\361\2773=\004\353e\275\226y*=\017\317\365=K\335\017=\"!\345\274T\206.\276\010*\026>\316h\363=\265\370j\276\204f\237\273;\332L\276\225P\030=\244\262\244<\331\371\222>\222@\315\275y]\202\276\234\2175>\333\302{\276+@\373\273\204\352\212\275T\357\313\275\343\031\021>\303}L=\377\263\275\275\n\323\216=KcM\2756\'\010=%\302p\276~\303\006=`+W=\367MY\274\346\376\234\275\201\233\203>\353\331\240=\261\255\250=\210,\262\275h$\034>S\236W\276p\016\314=\'\267\003=\013b\370\275\332\351\220\275\252-\004\276\343\331W=\345\346\266=\221\032\211=\341=\354=\014\222~\274&F\226\275\375\271^\276\363\257\333\275\324v\033\275\025\302p\275\303j!\276\323\222Q\275iO\252\275\231\233\t\2760\206\276=\257nU\275\033\023\266=c\305\017\276\r}[>\330{b<\016\354\236=3\262\370\275m6\275\274\260Q\200>g\255$\276(\277Z>\366\207\217=\306|\260\275ID\351=Tux>\027\310\337<\233\221\335\275P\005\250\274\232A]\276\"]!=~\036F>\017\317\370\272p\237\341\275\262\2137\276\004|\355\275\316\014=>\006\355\350\273\236Sd=\004\375\007<\215\2424>q\026\241\275.\356\325=\341\313\342\275CW\217\276\203Kf>\200\224\324\275/.+\276\341Z\200\275\221\254Y>\211\246\226=\230\270\004\276\0343\031\274\303\303\314<lJ\365=6\026\324\275FU;<\266\264/>\340\nr\276#\317\206\274z\245\336<R\3313\276-d\214\276\340\022\311=\205&\332=I\235R\276J&\370=\377\366\t=\037Q@\274\325a\322\275\204;\241=(R\032\276\261N\370<\334C\207>\273\215\000>\354}S\275\036\025P\275B\'\241=\370\314\345\274\222\035\024=\036a\327=\003u\022>\246D8=\276\277\200:S~\">\241j\025>\333D\360\275\2057\253\274%2\005\276\032\322\365<\034\236\245=\271\370j\276\003\362@\276\245\371\004\276\251W\214=cl\204<\2728\"\276\205Hm\275\206\267\315\275n\301\014=`\2731\276^\216\251\275V\256\214\276\255J\332\275\2264\351<\2015\214\274\021\326\006>\214I\326=L\346e>\n\360\217\275t\312\007<1\362\232\276o,l\274\305\007\304=B]k<\245\324O>&\263\017>\213\261Z\273*J\264\274\025\2446>\037\005\257=\001I\243\274\376\021\002>\311\251b\275\271\021\217\276\252\366\\=\354-\"\276\2323h>\361\227\255\275\034\366B\275\211V\020\276\311&\210<(A\003=\227/\r>\3365\007>\256\242G\276t\206\003\276\376S\177=\207u\270\275C\250`\275\331\376_=\362\263\245\274\306\235\255<(G\035\276\304\\\261;\377\026\231=\356\375\336\275\250\265\250\275\237Q\350\274p\307\025\276\353\364I>B\024$>\n\036\203\275o\242\216\275\277_\361\274\r\354\224>\375\211\244\275S\004\026\274i\030\246\275\265\374\013=\261\214m\275s\006\026\276\347\300i>\311*\331\275\274\313\347=\363\323|\276\375N(\275k\311d\275\333 ,>\017\251\241=\'\235\200\276v\205\027=\314\361Q>< &\275\027./>\202z\\\275\r\376\t>\326\352?=\210\320\345\274V\362\033\276\242\212\351\274\315\276j\276\2407Z\2763\212\270=\330\326\270=V \322<\027\372\303\272W\3628\276\022d\317<\330\215\240=\307|}>\003[\t\275$\304\307=~\370\277\275\332.\374\275\301\361\314=!Q\223:\326/\300=G\361\372\274\353\340\004=\274p}\275}\320\245\275\007D\205=\341\260\003\275\315\026\027\275\222s\266\276\325\322\'>\263Bj>M\240\217\274\255\334/\275\351\374\317=\252\266\223>2 6\276\177\356\325=\207\024\321\275\372\'>=\004\376\013>\232\030(\275\213#\355=q\023h<\262\350\305<69\005\276\226:}=\006`\216;\252\230\236\273\362\305\353\275\035\240\254=\264\241\251\275\247\003e>R.\344\275\272! \276`\223\3419)\334\251>\254\"\031>\362\342\221\275\210\024\370\275&vQ\2766\236\361\274C\277\334\275\036)\t>\023\216w\275\240:\236\275\0179i=\341\362\234>\310\237\315\275\300\337\021\276\312\016\242\274\266u\301\276\003p6\276[\036\351\275Y\370\230\275\214\377\004\275s\r}=(\010\001>Kp\365=\263e\221\275\275\344I\276@\210A<\257!\244\273\327u\251\274H\0217=\330\260 \276\267I\256=\010\200\013=\372c7=\321:\236=\350\273\027\2765\331\017=\204\226\353=\226\020e>\216Fi\276z\276\031\275x:\003=\232\267\315=\361\337b=I\231\303\275\341\037C>#\354>>\033RO>\311\023_\275\301\234d<\\#/\276\356T\256=\003\271)\276\300\204p\275\000\007X\276Uj\360\275`9\005\276\003Tb=\216o\232=\006M\203\274%\360\331=K{A;%\267\351\275x\022\230\275\"\310\202>N\332\320<\342\006\242>\322q\023=\206\007:\276\271\227l\275\037\034?=m\323\032>\2441\263>E\242X=\341\177\3258\351\361\343\275.P\024\276r\241\024\276H\265 >\216p\205<\224\317!\276\243\366p\2741\203\226\2742H^\275,\037\017\276\035\314:\275<+\'\276u\210R=\241\026\317\275\003P\355\275\014\365\357\275\240\202\"=\2700^\275D-\216<8\373n>\232\253\367<\210m\016>\273\252\013=\362u?\274\0363\212>\"x\033\2758U:=IT~=ID\'\276\2153\211>\351; >g\314>\275\020W\001\275\305g\007=\201&\222\275\220\316\216=\226\353C\276\376\373|=b\230\014\273\343\310\007>n\177\301=\n\004 \276\300\014C\276(\340\274<\256\274\233\275\370\203\251\275+Q\322\275\"T{<c\006\010\274\236[M\276\340\320\031>\r\356\220>\000\223\344\274\200\252\222\275\3706\221\274Q_\227\275\"\254\222=\376\300\375=!\324\312\276+\267e\276\307\032\354\273r!\326=\014\336\300=\210\331\261<f[\252<\306t@>A&\004>\313R\361\275\352\305\260\274\014.\020>\020\315\225\274|u\367<X\344&\276e\006\032\276%1\251\275\307\0343\276\375\262B\276\367\275\241=t\r\201=\201+\030\276\313s\031\275\377\230\025\276\330\276\207=\213\004\010=\016\344[=\375|V=i1\351\275\365\271\276\275\270Xr\276\260\031|\275\275\225G\275E\220\275\275\213\242,=\321X{\275);\211\275\303\327\214=\005XW\2744\302|\274\233\234\023\275S\324\000\276\362\333\372=e{\317=,\363\304<q\354o>a}\037>Z\322\253=D\330\217\276\353\327o=^\221\037\275M\324\246\273e\315\363=\213<e\275f\177L=\245\337\223=on\225\275\232\214=\276`t\225>\013t\200=x_+>\367\336\247<\366\3111=U\021\"\276\356\274v=\337\204\312\275\010\215i=$\307\275\275\365\326\213=\017\010\347\273\214d\236=\3376\331\273\233\273_=yp\345\273~\361,<\3039\244=\025\026\203\273\207\000\264\275\276\336\323<\017\335\374\274n\337|\275\270\3262=\306\367/=\276\301\217\276C\026\354\2746\344;==v\221>\207\304\260=\022\n\333\275\3501\211\275\203\034\224>\006f\360\275\0031K\276$\014R=\r\204\204\275\363\272\216\275\273\024!>G\017\002=L\375p\276\257\"\220>\256\241\203;\200\211<\275\326\323\253=3g{\276\361:\034>\210tO>\373]<>\0001h>V\217\314=\267\317\021\275\277\177m=I\325\035\276\311\014(\276\224{\035\276\001\344\354\275C\002\220=lI\214>\230\005N=\354\263s\274\"\303N<\232\263\207\275\021\t\367=z\t{\276PR\214\275{\265\311=\3146G>\223\374.\275`\036N\274\371\036\334=\211\237\266=s\301\006>\221^j<xg\373\275*FK>\240\'~\274\206\304\325\275|\341f\275K\205\026<\213\304\203\275\365\331#\276+,\323>\243\306\371\2752g0\274\220\205U>\030\327\246\275\020\371#<\026?\351=WG\213=\352\340 =Q-n\275\332L\334\275\366\\\267\274\016\350m=\372\323<>a\003\006\276\260\004\353\275\031\027\274=Lq\315\275\214`$\276T\322\265>\3073\313=\n|\362=\007\214\263\275gT\202=\325\200N\275\002\314\334\273\235\020\260=W\336\021;\366\210X\275\2114%\274p\220\201=\250\320\321=\362\324L\275\311\002\357<R]\177>\005\024?=\347Jp>\3708\202\275\353\rt>\024\243\322\274}\351D\275:\030\262\272D\036\365\275\030\331\214\274k:\232\2753\035#>8\016\030>1\246 \276\325;X=\223\004\256\274&\nR=1\0049=j$\313\275J#y\273F\223y\275\364r\204\274\241\362\205\275\327_\225>\036w|\274\030\3722\275d\022\375\275\223\332R\276\251,\337=\001b\"\276\266\310\231\276\033g\256=|\031\020=\353\315k\276\316\317I\276\235\021\377=\220e\017\276v\373\005\276\204f\"=\276o\003=\177$\022>*\230\373<\213\330\"\276\360\r&<\303\260G\276\355\251g\276\247\321\304\275\276>\313\275XS.\276\352p\326=lW\301\275a\356\r\275(\376\234=\302\267\275<\307\256\003>\2278&\276\344\355Y=\221\366\240\276\035\344\356<I\232\240<\370q\323=\205\366\221\275CFG\276\256\317\366=\264\266\313<\021\'\037>p\312\023>Yo[=Y\277\276\275J\236\253\273\327\375\343=`\354\331\274\351\t\246=\311@\205\275\214t\243=\n3\244<\213_\203>N\305[>\n\351\032\275\216\363\321\275v:M\276\354\314e\275\317\021\032\275\306\271\235<\327\034\216<\262z^<_\356C\275\314\331\007=\261)\220=\231\322\257=\233\227\224<\034>\360\274\320W!>\273\3124\276\212\246w>\322\244C\275\364\275\231\275\363\346?>\025y\304\276\247\013Q\274\302\335\013>` \350=\024q6>j|\257<\237\306~=2\\\261<\325\354\207\275\275\263\302\275r\373\224\276z\321\n>f-A==\177?\275wn]\276\301\347\205<Y\357\251<\306@\246\275\264\202\311\275d\371Z>\236\t)>\217v\003\276\0144\346=\020}\250\274\237w\250\273\032ri>\276E\215\2769\305A>T\210\352\274\307Fn\275\016)\343\275<q4\276\360\312T\276\010\230\254;\337\034\014>\243\031\207=i\337i\276\201\346\t\276\240\212\262=\353\202\315=%\245`>1&\000=\031\211p\275L\277#>\2163\023>U\206\226\275\231\200\272\2755\0356=\024\221\336=\262\353\326\275\231\373\341\275Wo\226\275.D\000=\207\025R>\006]Z>D\023\025=JWT=\344\361\257\273\007c\035=\313\003\211\275E\215&=\362\244\324\275)\223@\276\374E\r\276\356\031\007<\236b\341<\034\341\334:\032e\344\274\200\372\323\274\247\000\003\276\272\013\302\275\023\207\030>m\210\366=\251)\356\275\227\350\022<\033-\243\274\310\032\356\275\024=~\276\261\265v>\213D_\275K\243\307\275b\245\326=/\337\232>\314\021\300=\334\233\343=\316\211-\275BV\335;\336QX\275\021\214\216\274x\266\252\275\240\230\001>~\353\005\276\345\000\203=\016\205\272\274R\360\323\275\364\242\216=9\321S\276\3748\320:\257\233\300\275\030H\317\274sO\203=\2772\210>\341\316\303\275\320^<>+x\014\275\035\227\\=\243w\016\276^\034~\275^C\'>\204\264\021\275\320\324|\276rlG\276\201\240\004\275^o\017>G\031\367<\'o1>\023Q\222\275\317g\345=\377<\342=\335\215\234>Z\265\355\273\014?\214\275\017\264\035>6!\030>\350E\">\275w1=\\\266&\276?\232c\274\347#$<\344\3623=\340\327/\276\376\336d\275]j\321\275!\344\220\275\327AC\276`\023\353\274\215\032\324\275\212\312\201>.\035:\276\335\034\352=z\3330\276\374\353\203=\214\232\372=a\274\326\272\335O\234\276\201G\337\275\3233@\275w\304\246\275E\022\007>\2002w=c\265x=9i\245=\247\223\224=\032\305\">n\"\227\276K\261>\275/C\302\275\310\316#=H\353Q\273f\313\022>\273\017\032>\200 \006\272a\367#\275}\337\220\275t\006!>\270\224\240\275t\341U\274\361q\324>\023\013d>\360\375@=\223l\340=\276JR\275R\205%\276\247\037\007=\331|F=1%\215\274\341\354\300\275\214\211\351\275\310\215S\276!F\364\274\215\333\r>\035\211N>\353-\346=\345\360\302=`\023\357\274|}\036\275\331\263\251<\027<\340=\247a6<&\032W\276\307<\343\275\023g\254\275\232\347\236<\253\t\315=x\265c\272r\340\263\275^C\203=\254\006\233=\232\034z>3f\241;\334\234\033\276\256\233\034>\261\220Y\274\332\003\264<]m=>+\n\007\276*\302s\276o\230\277\275\226\030\217\275z\246\214\275\257\371\220\275\354\205\257\274\223\320\270=\274\346\221>=\363 <|\350E\276\034 \017>\227\224\215=\t^\016\276!d\370\275_\264\260\275\"\310\372\275ARV\276\372\360\253=vGC>\201@h\275\220\225.\275\020\324\023>\316\213\230\276\000\253v\275\336\247+\276\0037\341=\014X\245=?w\022>`%\037>\262\347\024>\350^3>\307\374\t\276\242<0>\'*c\274\343\374]\276Bmy=\313\312\253=\237\257\033\2754\264\301\274f\333\361<g(\310=\257\013G\275R\211\310\275YD\270=\301\\\203\275~{\300\275P\353)\276}\003z\275\030\271\007>\237W\210=\376\013\204\274\246\t\212=\254\321p>\t\3619\274\240\351p\275\0224A\276\344\315\330\275\320\313\215\275\256\223\276<\2656\325=fz\'=\010\312==\273\354\212=\211\357\221\275\256\276,=\301\223)=\034%A\276\234\300\347=\244\320\010>\326T\334=\337*\037=\317\240\020=\326C\215\275\226\225\313\274)\034\375<\353d\210<UA4>p\323\202=A\353\324=\002\204^\276\207Nd\276\021\247=\276d\247\035\275\213)\016\276:\325}=\035PY\276-\016(=\355\274\273<\214{[\276h\010\323\274Y\211\003>\373K\252\275X\312X\276\357}g>\215\376K\276\312\344\254\275,\212\374=\364\032o>\237\024\356\275\306\366R\276]\355\261\275\200b\275=np\036\276\267M\210=H\254\356\275\313\370c\276\351\272\200=\217\206\315=[\306J>\347<`\276\363\022\320=\312\345\206<X\212\031>\366e\336=\341\237\257\273\271\0204=e\314V\276\354~\215=h\306\211\2754\375\026>1\256\030\275\370)6\274\224\247\301<\372\361\234\274\306\2700>\204\332\031=\346g\251\274jI\347\275k\301\340=\210m\030\2768\0178>\313\027U\276\325r\350<\346\236J\276\353R\224>\360I\014>\013\363?\276\303\236\315\275\346: <^9\315\275Z\372~>\235\013K\276\357Y/>s,S\275\010\344\200:~u\037\276u\323\301\274\340/V\275<\365\205=g\341\030\275\t\2639\275;\265$<\223\231\007=\330\262->\2503_\273ML\210>\030\313\215>b\271Y\275\373\232\217\275\276\371\006>c7\014>,\202\200=\227W\277\2753\300\243\275\262!+\274\033)$>-\257;\276\313\264<\276\266$e>\024N\010=\220\306\023=~3\004=\356\332\316\274t\006\"\276{\320e;x\200\034\276{vT>\300\337q\275\240\366\270<\223\257\331=@V&\275eG\357\275\003x\301\275H\211\355\275\'WV=2\007\'\275\221\000n>\262\206M\274\335v\341\274\005\376\014\276\301\003\331\275\250J\032=\340\241!>)\225\306\275\2149\016\275\236`.\276\366\306\265=\006\205\266\275\\\2326\276{,\221\276\023\306\355=\232yg\274\332\204\344=\335\313\003\276V\303a\275\253\276\233=Z] >\257\326\021>\320\366\330=\016bd\276\343I\307\276/\002\"<\316\177\001>v\275E=d\023e=z\255\350\275\014\363,\276q\272\036>\220:\'\276\266\246\200=\316\333a>\352;\005=\301:E\276\273\026\363=\225\\\222\275\033[\266\275sk\221\275\340\321C=\357\n\226<^`p\2756p\000>s\024\332;\267\305\216=\301\221\243:q\263\364<\233\014:=D\315:>\224\350\257=\252l\232\276\265\255\302\275\025\303!>\031\023\t\276Me2=\010q1=\016\371R\276\300\021/\275y\333\004>L\306F>\320\233\020>\2707\021=\331\341\312=\274+9\276\374\372\006\276\347\253\370=\374\334c<t\010\037>j\353\236=\220\274\014\275~\r\023>L\223.\276\n$\323=\331#M\276\025\236\200=\335\254\002>\302\371{\276;\345?>>\274b=\032k!\276\217=\025\276\373\261\235\275]\262\221\275\254\220\213\276\025pM>?\031\223=/\224\303=\260P\373\275\200\357\254=\2574\326\275\245\303\273\275:\320\311\275}\362+\276\272\355H\276\201\264\252<\315\317\213=\273I\346\27550\003>_\t\314=\001t\347\273j\206n=\013[g<\250\303\327\274\026@y\275\256\252\271="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
