node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 8516733
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\313\023\314\275)\320L>\311\224\215\276+ \235=\030/\317\275\242\212\201>\362O\344\275\027\315;>\276\005\357\274a_\311\275\371\205\241<\227\315\353\275s\272W\275|\"\006\275:\345\237>T\257u\276\013\003\017\2763\332E\275\273\340\371\274\241ff\275\307N\215=\313\252\t\27671k=\203\323C=\233c\177>c)1>Ac\261\275\276\"\241<\013\271\313\275=WQ>\262$h=.\354|=7\241g\274\276\217M\276M!\240\274\033|\315=\267A\003\276\320\220\234\275%\231\257\275\244%\256<\206-K\275\351\211I>\233d\202>CfK<\266\021\200\274\307k\323\274\206\023\014\275\033\026\216\2752\303\270=\252\\\231\275\246\244\200=\301+U\274\221\223\335=&\361C\276\341\227\340\27371\004>>\224\262<\312v\036<7>\\\276\211_)>/\226!>\374\037\001\276\260[\311<\231l\264\275\355\365V<\365_}=\310\371\025>1@\034>o\215\346<\257vm\275\002\302\337\275vA\227\276O\314\314<\260\337\022>n\251\216=jN\215\2758wX=\031\005\313\275\340\327\036\276\200\002\014<q\277W=\202vX<\001\241\331<3}\212=\220\\\324\275\017\262\300\271\331<\003=,\216\354=\326\301\022;\372[\007>R\243\026\276f\373\330=x10\276\t\235.\274RUu>4\315{\276\342\010\357\275G\203\217<A\256\226=\346\007\275=PM\377<\221\364;\274\201\306\035\276\346\303\251\276\031\251_>\253\032\227\275\366\031,\276\360%n=X\213\212\276\327\231\314<%\263!\276\244\311\215=\353C\227\274\033h+\276\245\206\255\275\327\333\201>\254\315\023\276\312fb=\t\345\216\2750\313\021\276\223\";>+F\265\275Z\203\026=\214\246\030<1V\231<\'\335\260\274\003\006\206\275\361\347\004>\310C\255\275\210\247\250\274h\226\367=\275;\246=\200\3641\275\201,\271=I\344L\276$\272@=\325\235\344\275\307\301\232=\220J\345\275\236\006G\276d$\n>SP\363\274\377\353\314=\0069\\=y\366\342=\255^M>\205I\036=]\265\202=\354=w=\330\006N\276\336\274\014<\333\373M\274K\341\\\276\2674.\276\231\177\300<\357\032\005\275\221\204J=\306\232\337=\206\214\313=r\267\265\276\237\310\323=\226G\270=\245\020\013=\360\252@>\201C\r\276\t|L\276\271q\014>&\t\364\275\377Wb\276fj\246=1I\216>n\016\221\273j\304<>>\256.\276@\333\031\274\335T\336=\217%\332\275\274\274\367=I\275,>\224\265\370\275XJ\225=\245\026\031\276\362\371(=\205GX<\177W!>Wu\022>(\032&\274\316/\211\276\241#5\276\302\210J>\010\0177\276\303\200\020\275;k\206= j\316=y\001\021>\265\033\346\275\014\245:>!\215\244=\2604Q=\246V&\2760\311p\275pL\347<8-\227;\354\227\002=\243\033\002\275\357\320\002\275\2516 \275\224,\t\276\014\3348\275\252\324%=\332\010$\275\021\276y>%\202`>\363i\335=Kx\306>\347\337\362=\205D\t= \322,\275\315\216N\275O\033\245\275\260\364r\274r\366\374=\267w\351=b\270\277=\321\213\244\275J\215\227\275\023d\231>\235-l\276\201\364k\275;\030D>\347\257\023\276\344#\217\274\020Xa=\271?\303\275y+\367\274\270\330q\275\267\203\251=\200B\034\275\361\350\353\275\006\207\372\275Pm\366=\323\031\334\2756\340\343\275\024\243\021\275+_\314\276\003\277\245=\250op=\273\354I\275\326\343\335=Rq\376=\336\270\215=\003\255V=\2355\274=\334\343\320\275U\364\304<}\234\351=&\257\020<\270\257?\276\324\220\314=\273\222\377=\373\252O\276\355Qn\276ola>g\341\032=]Cj>\333x\331\275\212\242\237\275\215j\335\275*\303r>\205\304\320\275FX\233\274\304\361V<\276j\317\275\364\336\210<\304\234\362=\243\030\350\274\237\232\376<\327l\244<O\353\255=:V\025<\255\226b>\377\026@>\371\2656=\257%\247\274\250s\'\276]>H\276\302\272\261=%CF=\345\031A\274B\250R\276W\t\202\276JC\275<w\320\227\275]\247>>\320E\301<\036I\363=]\312\222=\177\017H\274q\353\016=d\032X\275/\245\247=\335\267\220\275d\034U\2769\337\251;\233g\246\275U\3555=\272a\320=\277\002\310\275\345E&\275}\374L<#\274\216=%\213D\2756\203\032\275\230\373\254<\326?;\276$An\275\027\001\214\275F\2415=k}\000>JU\001\276\006O\023>\nl\303;(\325\351=k\371\263=\031\255\"\2741\371;\276K\020v>z\253|>\254]\n>\0105\221\275\204\370L<y\240\261=\024ga<&,\201\275\222D\007>h`\254<}1$\276\250\031)>\344\017T\275\254\033|<~\267\002=\364\222_\276X\227\224\274\237r\025>IU\206=\377\277\027\276u\215\213=\177\323\007>\304\343\220>\2217b>\213\363\251<\317\350v>\003\332Q\276N\221\311\274E|\r>\242\330\332;z\223!\276\331FM\275r\212o\276\303\220\216>\212\336\212>\2269J\275\035\335\005\276TA\315\275\r\262\244\274\204\277b\275j\256\027\276i\344\342=X\217\221\275@\276\201\275&5\346=\316\331\377=\253rF>\243\232\313\274#\233\231>\373\t\347\275J6g=\300\004\377=d@\245\273j\346\257\275\331\\\032\276\3315%<p\344\332=\331\215V=\315\250N\275\303\305\323=\323w\366=\261\374\376\275\311o\316\275\335\224\206=\\\235\260\275\264\220P\276\337O(\275\215V\301=\357\201\032\2769\006R\276i_\014>\017\240\004\272P/h>\')>\275\007\206\030\275\327d\033\276\357.\211\274\'\372%=\005?q>\255\030[\276\213\235\023>\244\312\372\2746b\370;C\t\376\274\301\0366\274\321\345G=\210\317y\276@ \307\275O\362F\276\377Q\201\276\023\227\035>\n\350\254:\361?Q\275\336\202\360=\244\220\201\276\206\355\032\276\377{\013>@\016\212\275Y\0027\275^6\253\275\212q\201\276d\275\261<\002\252.>\230]\321\272u\356\336=\306\333\210\273\273\3129>\002\252\327\275\017\345M=\r\026c\274\314&\242=\275$\257=\354\010\362<\325\030\235=A\335\201>\235[\351\275$\371(=\005\273\344\275X\207\225\276\215\331\372<\361\356\253\275{\311\365=\037%\265=\2335\225<\271g\342\275\367\256\254\275\322+\177>\237&w\276\262eZ;\302V\235\275\377\352>\276\300\016t=\240\tR>\\\210\037\275\361\301!=/\376M=\247\265\341=\356\271\216>\337\224\277=\372\377\355\275\356K\355\275<\300\005\275i\350\202=\220H\211;G\036\367\275H/\237<\235\351$=n\004U=;\346\351\274\306\226\307=\302\341\207=\375\374U<v\244:\2761\374\210\276B)F\275\355([\274\374\270\374\275D\204\203=|\002&<\220\257\201>\307\004\275\273\343q!<>\017\326=R\021<=!C\214\275\211?\351\275\2659+\274K\202E\275\227f\213<A\370\021>y0\222\275@d%>\211SI=uR\245\276J!\200\276\302\340M\275\001\277\213\274n\n\221\275\366:\307\275\230\245\213\276\002\025\241\275.\331I=I\304!\276\301\006\326\275\204\3372\276\216\320\020\276\256\265\000\276\310\245\303\275\034\177\332\275\242\323&\272\202\262\302=\177\037\373;A\"Y\275g?1<6Eb\276o\361\232\275\376\330#\276<\3246>,\315\215\276nF,=\'\300\030\276\020\353\357<^_\342=\001\203\371\273\320\3140\276\322\037\304=?\t?\275\361\021\214\276\377\341\005\276U^\022>l0\247=Ne\201=\034\034\275=9\306$\276`]_\275\330\020\277=\215\352\213\275W\036F\274\315\355\276=\231\330\035\276\246\377-\275\223f;\276b\362\353=\243\310\027\275\277\314\037<p\004\005>\013\326o=\317\363\253=\222\020Y=t\304u>\376\236\023>\211\234P\275-\3550\276&\2360=\203v8>V\361Y\276\370\240\246\275\271\335\370\275oK->\032g\361\274\355\215\254=\212\t\325\275\216:\033>+\326\240\275\024\032\323=\300{\230<\376\212Z\275\007VB=+7\027\275\247\273\265=\010\277\245=\210D4\275\226RJ\275\312\010\266=s$\301\276o\\\245\275r\001@\274\360\t\253\274\337]\016<\215\374v\276Z\317\212=\302\350\307=\342.\033\276\254\221\030\275\024\241Z=K\232\"\276M\310=\276Z\272\223\276\2512\271=\206\274F>\323\014B\273\037Vq\276\327\'I\276\020\277\245\275\254X6>l_/=\001\307^\275\370\261\203=\ra&\276\301\031\350\275\226pC=3\030%\276;\262\000>\241d\025\276*\312W\276\337\203h\276\250\323\307\273y\\\211\275\311\250\265=N\306\247\275\010$\252>8\222,<]f\263=\327AY=s\'\306=\335X\244\275\316=w\275\021h\347=\346\262z<i\316\032>\002\222\210\275\212~\302=%,\243\273`(*\275\260\231\241\275(\272(\276\200\203\271\275\017x*\276\2228\t\276\205\201\302=\202\312\371\2750u\207\275T\323\212\276Z\037\365=\334w\010>\265\247\301\276\320\"\244=+(\256<[\0176\276\0359\021\276\'\323\211=_\277E\275\372\375\351\275\302W\245=\360\235\313\274%\302\234\275\311U\304=U4\032<\207\222\204=+\270M\276\325%\007=\321\200\013>S\347\243=\260\234\345\275\332\025)\276\322\256\344\275\256OO\275\316\330\305=Y\276\224;*\374\320\275ce\212>\351\036\003\275\013S\304\274\202\360\355\275\234d\304>\370\240\261\274\373\250F=\220>\331;\007~\240\275fA\317<\345\t\210\275\374Y\204\274\323\240\210\275\226\321A>\272\321\336;\004\002\331=N\304\264\275\206\223\204\275\226\223\363\274R\331\252\275\314?E\275\310r)\275x\tw\276\272\331\342\274|*\267=\037\340\264\274\005\206\255\275\374\322\t\276>]\212=\200o\270\275\223\006\263\275\330^O<\027Z0\276d\374\217\275\264\200\201>W4j=;\204\221\274_\257\222\275\035O\000\275\242|\200<\225\t\225>\346\'K>\375\004\241=P\271\243\274Y:\006\276\221\210\303\275&Q7=\354\247\261\276a\257\024\276\276m5\276\220A5>ruP\275t\330\372\275.\335\320\275YB\334\274\250\246W<\3556\205=[\276\200\276(\303\264\275F\375#>y<\024\275\nLR>>\345\363\275?\207\261<\311l\365\275:\371\215=\034\320\250\275\"OS>\371\207\261\274\225e\332=\305#\022\276q\247\232\276\000\300:=\276\253\034=>\246n\276\021\211O\275\247b\322\275\363\205\343\275\'\013\200\276W\334_>\247\377\352=\230l\327=ct\244\274z\211\211=1V%>\260h\352\274\314,\365=*\n\337:\223\225\346=\177W\317=\265n\352\275\333+\210\275B_a\275\037r0=\301s\372\271\360\023U\275\r\307\276<\217z6>\006\305\266\275\273\210\226\276K]\221\275lst>Z6\365\271\302\322\005>\301=\250\275\315[\211\276\205\240I\275\005\027\264\275 \037\266\2741,\372\275\204\334\327;O\214\225\274\024Z\034>\025\030A=\336R2=e\207o=\003\250\026\276\3544\004>4\3167>\2748\372\274\232\300\201=\n\267\033\276\227D\343<\"s\202>g\375\204>\323\320*\276p\262\346=\200\366&>FO\t\276\201&\210\274A\347i=\235\303\341\274<?\206\274\230!\247=|\271,\276\304]\205\275\220v\253\274\267\355\324=\3103R\276f\337\307< \333\262\276\225\301\337=\254B6=\017\3139>\330)\006\276oV\336<\031\373\031\276\315\346\004\276\303\370\320\275H`\322<\010\035 \275\363\275\212<\020$\">\273\353\274=\354V\010\276\2659\310=d\004\227>Tb|=\022\203\275=\367\347\206;\377\264\247=8k<=A\033\254\275\027=\240=\216b9=\331&\211\275\231\3537\276\351P\251;\271\247\017>\213y\275:\357\240i\275\222\305J\275)\254\213>\325\256\020>\341*\215\276\353\276\022\276\3403+\276\341i\350\275\276\330\007\276_\023\t\276\\\225N\273\326\361X<\340\351\360=\315\217\027>C\022\347=\221\005Q\275]H\000\276\277\364|=\200~\030>\327u%>\210\324\271\274\352\257\277\275\006\327\327\274\002<\351\275:\'\r\276\003\033\365=\375k`\274\251y\273=\007\242\210\275J\326\243=f\210\321\275\274\265;\276\367\r\323\274\352\205]\276\271\306\355\275\371$\340=\177\0065=\245/\301;\017\223?\274\204\266\367\275\265\333\014=3s\214>Tr\224\276\310\257\311=\366\244|\275\036Y}=\254\"\320\274\203/\035\275\376e\025>\023e\"\276\231\270\332\275\300\364\222\2767:\004=Z\037\037\275HB\006>s\353\252\275\352:\210\274d\250 \274\211Y\220=\262\246E\276\262\352\206\276\332\3158>\021\334\254\275q}4\273\350\353\026\276\353v\022\275&S\021>&\r\007\276\362\354\364\275\366&3\275\235a\260=3B\310\273\352[\r=\224\275\266\275\301)\357\275\225\244\266=<\333S\276\347\345\024\274\014\273w\276\376\261\277\275\260]\321=\013\315\312\275Y@\303=\246\034r\276Q\251\022\276\014\341\205\276\3702\357\275\224\351\\\275\343BJ>\315~\256\275\023{k\275\2469\226=z\215\370=\307\305\301>\242q\026\275\270\231\274\275!\271p\275TD\204\275\356\326\333<b@;\276_\0241\275]\337S>j\303b=\353\327\344:\004\372\217\275Th\227=e\210\213=\236\351\363\275D\375A=\\\364\344<K\314\001=\253\222\354\275\244c9=\032M\274=\237)_>\275=\271=#\364s\275\001y\223\275\262\371d\275\367F~\276\210\0320>\266%\036\276\006+\312\274\004\3605\276D\374\035\275\316\332k>\360\020\244\274px#\274\225i\270=jr\010>\002\376\345\275\0109\002=\357J]>\2729r\2761\252\016>\242-\204\276B\310\006>\340Q\216\275g\373\000\275\257O\014>\374[\203=\376R\313\275A\337c=B\t\330\275\254;d\275\276\021\251=\243\177\005<\247\332]\276\026\021\204\275\244\222\237;\270\211\216>\232E\002\276\275^\007>\202\025\202\274\303\262d\275\177\271\272=\334\017\205=+\n\253\275k\204%>\265\224\251\274k\364\020>\230\343I\276\200\271\216=\027\337\254=\004\002\212>\255U\325=\310\263\340<\273*\342<\262\331g\275\205{\270=\312\271\016\275\230\216\366\275\t\005\376\275\003\013\203\274\021\310\364=\006\353%>\240\277+\276\226\361\035\276&(\214>\037ja\276\320\243x\274\355\2774\275ES\272=\2370\363\273\007v\203\274N\361d=\2334\225<\214k\247\275\276\365j\275\345\330Q<c%\251\275\252\225\342\275\006\350\362\275\376\207\201\273\365\264\270=\355~\010\275\267\032\"\276\346\344Y>\3359U<\271\252\337\275\371\333\256=\252\247\037\276\2732P\275\205\261\017\276A\341\346=\"Z\273=\314s~\276e[\274\276\003\367P\275\207\033;\276\365Y\203\274]\225\004=}\270\224=\327P\035>\212\361k\276N\331\343\275%M\335\275\001Q\010>\316%\353\275w\376\022>\231~\204>\305\234H\275\345\340c\275B\354\244\275G\3609>&\226\205\274k\361+>#\220\344<\374K\206=^\244\010\276\030\034\024>BH\341=&\320t=\022pP\276\225\322\010\275\376`\211=8\362\r=\354\225\321=\313)\301\275X\375\375=\362\361)\276D\322\207>\330\226\357\275$\314,;\376\276\221=VT/>\361\002\205=X\347\317\275`\0348;\006\323\322=\363H\256\275\370\022\273<\240\020\346<Z\226\014\276n-%\276\243\326\301= \315\277\274\\\274!\275iD\250\2751\252\211\275q\266\026>\017\3128<\216\247\213\276\013\017P>\263>[\276\270\177n\276<\315\373=O\353\"\274\361\3155\275{\\)\276\017\303\000\276^\017\022\275\311\177N=@\357\205\276\370F\307\273\271\020\032\275m\021\000>\324\035\035\276\032\241\256\274/r\203=W\3328\273\010\323\257\2755\214K\273$}\203;d\362\030<\004\263\211=\205\002T<D\207O\275`\244\206>\303\354\213=\307NM>1D\233<8\023l>*\202\302=\245\264\350\273\273\361\314=\322\022\375=\362\356.\276W\345\025\276\016\376\256\275gS\320\276\345l\010\273F?\275=\257\362\334\274\222\177D\276\273jV=\007E\020=65\270\275\275Y\331=\313\355\003>\033\327\300\275\265\326\263=\301z\205\276\035\311\255\2743C-;\207\003\013=$Z\227=_B\032=\325\372\216=-}\205\275o\237\206>\251\340\017\275\250\347\234=\350DR>\227J<\276a\243\227==\236\037\275\262\352\026>\023\322@\2740a\321\275SY\370=\030Kt>\302\215\217>UmH\276\235[.\2750W\006\276D\003|\274ox\305=\371\377\317\275\305T\275\275\010\020\001\275S1\214>\314S\315<V\026\020>\301\352\324\271\250\025\251=2 \243\274Ji\362; \n\344\275\361\010\r>\315\301\003>\352J\370\273z\255\"\276\251\n(\275\002!s=t<\374\274\250\370\334=\326\276G\276u\236\030>/4\317=\372\005\\>!\241d>\'\224\372\275\2409\007>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
