node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 2721433
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\304\267\255=y`\277;\000\362\324\274X>Q>@n\242=\352p\220=\273\321\010\276\266\215\303<\037)y\2752=\321<N\263-\274\344T\005>h\333\007\272\3142\336\275\001%I\276\232\345\201\276\265A\247=\356p\340\275\257\256\215=\204 \240\275\036\306\237=\370\001\326=\025\310\310;7\254\214\275\021\251->\036T\333=\016\276\350\274\037A\243=\240\020\226=\2279\222\275\006N_\273//G\275\331\202O<A\002o\276\364\314=\276\r\243\261\276\024\330\337\275\263\031\331</\361\240>\262B\264=\251\0167>\257w\201=\326\232\251\275\037Tb=\316\324o=<\306\200\276\355=c>P\335\231=\003\266\005\276\325k-\275Q\324\213\275kH\022>l\017\334=\3025\240\275\007\357\216>\212$a=7Y\226=I\010\275=\333\205\014\276\330G&\275\327\241\022\274j\375\036=\2410\376\275\261$\351\274p\2359;}g\013>\344\2273<x=?>gM\202>\014\204\254>a\337\316\275}\010M\275\014\244%>z\314\004<X\266\n\276\027)\237=t/\211=\304\207^\274%\242<>\014X\032\276\346\366\205=t\311$\275\313\340\271\275\301n%>\303\302\257>\005\034\250=\214F\310\273|\302\244\275\000\013\237<J\026\211=\343u\'\276S\320\326=\316\250\307\275\331\037\372\275\210\263\013>_\364\373<\333\226\332=J\375)\275@!\2359\311I\370<\317\022E=\316\"\367=\214\335#>\272f8=m\332\261<sF7\275.\230\006\276\222nT>\010\306<>\256\036e\276q\311\272=\017}\236=\024\344\351\275\204\246|\276\244\266\211\275\220\365.\276\013\335\311\273\025\224\251\275\364\376\n>1\'\374=\203\000~\275\020]\250\276G\341\001\276\255\260\277\275\202\003\335=\022\205\205>\226g\270<\256\266>>\342\365*=\254\273[\276\250\213\306=r\024\265\275\267\241\247=\361\217\273\275\036h\274\274\2507B>Hm\265=\330\343\375=\347D\376=\252|[<\230\203\325\275\177\200\004\276a\017\312=(^\224\276\235\315\254=\253\230\033=#6\023=\2144\034\275\371\345\375=\202]\366=\212\215\364\274gB\003=\265\346\032\276\220\010P\276x{\177=\316\261I=\311\252\271\275s\206\212=\220f\356=i&\365<\340\324\325<b\2050\276\226EQ\276l\356\177=\251\032\205<\240\336\002>\334\244\367\275\244\266\314\275!\013\370\275\236\273\016\276\274\352^>/>\236\275 \0258<\224j\254<\231KQ:\304\211\206>}X\245=\201h2\276\314j\360\275n9\234\275U\340\253\275d\333\213=\020\231z=\210!\341\275\3314\304=\267l\r>\224i6\276\250$\234\275\316\371\314\275\251n\343<\245\034-\276\320\253\372\275\317<(=\301\027C=\202V\210;\3131V>\222Q\376\273\301\002T>\3778?>\236\217\021>\023mt<\222j\003\276\272\017\302\275\2578\014>\177p\003\276~\317 \276fdE=\204\330v\274\272\205.>\267U\027\275[\310&\276\242\216\r\276\252\371g> Ok=%(\360\275\2537\325<\3156L\276\025\003%\2766\2744<KQ\307\275,\023u;\213\225\324\275j\205\031>\275e\331=y\250\261\276V4.\2769\304]>\275!\236\274\226O\335\275l\006N\276\344\271\274=\314\3241\275\250gH<-\322\020\276\362h\301=}\223+=v\353\030=\034i\353=,\261!>\311\240\036\276\033\305#\274\220?9<\025\251\027\274\332\241\237\275\014\324\204=\337\350\263\275\361\303\271\275\344\321\005\2761|=\275L\350%>\332\251\213<\316\261\267\276R7\203\276\205]I\276!3\236\275\206\210\341\275%B\245=\035\250\025>\274\245N\275\031\007\016>\006U\255=\256r\301=UY\307\275.\272\337<\215\363\353=\253\021.\274\255A\233>YZ\325\275FK\273:\002.\032\276rf\021=.!#=\332\nd<\336,=\275\22633\275M\261\211<\325D=\276\016\343\232\270\330\221\257\275\212V\241\275&x\220\275\222[\211\275\273?8\274\315g\345=\365\354\340=\200z->\361\216\325\276\337\261n<{j\246\275\013\231\020\276\353\272+\276\324QI>\222\0348>\265\260\355<zR->A\305\306\274f\027\314\275\320\372\010<\005t{\275\215\322\256\273\244\312$\275\342\330\220\275\347\212\324\275X\367==e0\242=\210\341\342\271v_\370=\253\2766=\240\347\276=\303\3565>\032CS\275\274`\237=\\\207-\276\226\035\352\275\005d}=\200\303w<5\274\312<UO\253\275\311\231%>&c@\275\206\031#>\222\366\317=\261\334\232>\212\036\331=\0000\'\276C\235\000<{%\300=\006u\344<\317Mr\275\3711\217\275m\240\272\275\"\267\213\274W\260/\276\206<\265\275[q5\276\004\340\312;5$\334\275\361\007\327\275P\021\304\276\267\205\027\276\027\361\232\274\035\215J>.y\301\275@\224[=\237\325\216=\220}\017\276\214\220Q=R\246\311\2759]\027>\034\221\020>\237\310P>Z%3>y$\273\275n\344\306=\332<\224=]\010\233>\356\342L=\336\027\027\275\313\252/>\362_\"\276\217bM>3\354\316\275\207\357C=\224u{\275\216D\214=\300h\355\275\330,5\275\013\337\000>*\300\323\273\n\n\016\275\036\245\313\275\332+\304\275\177\026\'\275\266<\013\275wt\000\276\342\355\330\275\245\236\t\275)\333#\275\350\207\345\275\250\246a>\374oS>;D\344=W\tc;\325\346\226=O\310\300\2755\335\264<9\373\346<Q\253\255=C\333;>A\216Y>\002I\010>\241\213\2478\257\365\271\276\343\204\001>!R\020>\263\025\247\274\325)\002>\355\323\356=@\333G\276x\313?\275y\020\276=;\212\023\275\273yD\276m\n\004><\2030\276\371\227\245\276b\322\217\275s\324\353=\014\362\340\275]UQ\275\200\277\347\275\266\035\225\276bN\267<\271\2127\276\"\027\026\275\331v\201\275i5\235=\337\033-\275Y\307\371<\273\010\243\275$\305\311\274\270\377\355=\027|\302\274@\2120=\016gj\274\271\3137\273\245\376\345\274&\001\217\2752%v=\033_@\2768!\345<uj\336\275,\345\345<\356\360.\275\014\370\334=\300Cq\275x%\272>w\255\033>\365\0352\276R^N\276\372\001\261\275\034u\325\275H\006\267=\354\304\216=1\220}=\001(\001>\223\341\\>\271I\006=%\327H\275S\352\363=\023\330I\276N0\265\275rfx\275=\026y=R\241\357=\r\266\231\276\304~!>\"\226\300\275\371O\203\275\361\223f\276y\2245\276\000\353\026\276\364\270\n\276\231w\035\276 \247N\276h\014\310\274\023\035-;mn\032=\035|\013\276g\014g>\3711\230= \213 >GU\307\275\032\227\017\276\017l\262=\036\3105\275\327%\307= D\201<\005\262\211=\272=2>\377H\314\275R\242\353\274\375A\231>\204\371I;\213\177\202=;,\023;\353\231\253=\255\376&\276\005\3072=\316\234N>\247\343\212\275\265\r\334=\031$\346\275\307a\016>H\354\016\276\207\\U>\300\303\272=}\214m\276\246\230\212<\005\214H:\230q\273<\242S\272\275\340Y\">^\202@<\2629f>\321<\261=2 \215;\"\330\031>\210v\277<\221\274\331\275\233\362%\274#\211Z=\320\223}\276}\037\215>!\316\034\275\272X\221=\004\336\350\275\005\271\225\275\234\336\017>\271$H\276\002!\004\276\006\365 \276\340#\377<\222Ly=\r\'U>\033\206`=&\003\235=\016\374\247\275Y\257B\276\211\003D=\342\2465>\356E3\276\303\232|>R\nm\275J\307\311<!\370\220\275|\244]=\350\006d=J\362\270\2744\237\366=6&L:\315:\246:P\266\017>,\341\261\276\236\333\275\276\206|\335\275\177\362\006>?#\t\275\261H\227=\352\340y\275k\232\037\267\305\2142=\262\304\346\275\361\251\203:\256,\275\274$\"\225\275%p\210=\343\020>=z\262\216=\227\304\363\275iK\370<\237\023\035=\\\372\342=\234\315\005=i\265S\276vez=\207GQ>\223\351\212<\204\234\007>$bj\275:\215\324\275\233\305j>\363K\222=\026\302\271=\364r\372\274\336\324\n\276\252\313\250=\244\232,9\372\234\263>\241\362\010>\212\t\267\274>c\317\274\025\021\325=\033\360\274=\330@\334=\003\255\210\2769T@\276(Q\326<\271\314d\275\305\251\352\275\324X\215=\250\362Z=\210\224\346\275\037\215\254=\312a]\276\257\360\377=\327\306\261=\001)\013=\326\215|=v\370\315\275-\005c<m\r\221<\014\017z=1\274\204>O\030>\275V,\000=\235\200\026=t\021{<\235\331\001<W\023\373\275j\333u\275\211\246A>?\337\016=\304\023Z=4K\300\275s\031\002\276\263*1=\361\271\032\275\r\225\214\275\034\375\327=S\320\210\275aI\267\275=\304\211\2742\021\267=q#\331\274\006\202M\276z\235>>\013\023o>%\322\225>\250\275\017>\247\323\224\275\250Lg\275_\216\374\270f\321\270\275\334\330\223=[j\375\274/\023V>\304\0345>2n\205<\0369\241\275|\201\007>\310\234\001\276\263\204S>\256\315\">\244\316\276=\007x&><\242\330\275\243\307#\276FJ\001>\225\265\030\275\233\206\371=\337\345\265=\237\367\335=k\2274>\202pM>\251\326\240\275\354\326\031\276X\204\333\275\310\331\253>\014\220\332\275\371\324\023\276\261\226V\275\316%\306\275\2733\232\274\330:\303\275\247\374v\276\225y\373\275\345\222A\2764m=\274\001\321\021\276@|\033>\277\025-\276\353\262\306\275\026\217\211>\020|b\276e\311\032\275V\222\036>\303)\t\274\006\3132\275\022\323\025\275\351H\001\275\344;\372\275L\314U=\364\350F\275\333L\333;A\333\007>}\342\332\275\322K\034>\371|\300\274\265Id\276\2617:\273Y\261\245\275\223\025\252\275\\\250\000\276\253\217\371\275>]:\276\341M\016\276\253q\005\274B\232\206\275y\372\266<\353\234\006>\0359\266<M\245y=%\006\232\275\351+\316\275\247\210\237<\201UI\275\252\337h=v\036\262>=\"\351\275k\351\272<\365\003\250\276\210\010\251\274\027\343\304\275\320T\352\274\312G\034>\325\2359\276x|\376\275\002\360\t>0H\246=Q\001\245=\325n\206\275X_\254\274E\202G>\262\"S\275\355s\">`\332\r\276\3020\225=\203c->\305\306\324=\024\026\232>J\313\242\275x\036\271\274\242\260\247>\320 N=zw\224=_\314\225\275\210\352\307\275aA\233\275\251A8=UO\211\276\3504\004\276\247\202t\275\341W\277=\243\275\201\275(\001\322=>\004<>WA\210<\265PN\275\003\204\\:\371&\003<\024D\353\275|\020)>u\366-\274\350\322\301\275a\217\370\275\305\017\363=\375\275\270<Ro.\276\346j\377\275\317\211j\275\354#\210>P?\235\274\006P\025>\354Z<>\305\363\321\275\241\266,\275~\035\375<d:\231\276\231\272U\276oF\342\275&%\324\275\007T\377;\256\315\316=\211\007\271\275\202\330\223=\3233%>;\006\377;\330\n\234:\336](\273\277%y<\034\304(>w0\022\276qx\005\276\264\222\257=\275\237\322=18O=i`\177\275\023o\244\275,,\t\275\235\230s>\r\357\364=\275\351);l5\244<@7v\276\313h\000\276+z\201>cJ\345\273\234\222\016\275\006\254=>\267aM=\203\214U=\206~\326\275\267;{>.\234\272\273w\010\272<ug\241\275#~8\276k\355\221\2767\373\'>\316\030\177\276\344\3554\276\'F\375\273S\201\r>\356\n\377\275\260\2169>\3470\362=\371\030\253\275P\215\013>\312\335\324=\333\275\210\275[\276\372\275\267nP\276\233\350\223=\236\037D>\350\313R\274\242\361\025=\006\232H\276\222T\346=v{\241\275\003\005\213\275g\035\221\275(k\177\271dxI\275\226OL<c\246\037=\246Bp=\016\022\346\275\000\223\203=>:-\276;\036}\273\257\363\203>\352\236[\275\026KC\275R*W>\267KL=\311\347\013\275L\255\207\275\3455a=\234>\203=\365V\237\276\356\022\034=\237\331S=]\351\333=\266\022\010>\276\276\001\275\205\330E\275\t\337&\275\021Va\276\310k<>\311eQ>A\263\004\276\355q*\275\350S\321\276\232Z\234\275\200WK>\272m\302=\252y\005>\345\367\221=\010v\215\274\266?\224\276\272\346\227\274\214\213\r>gE\216\274l\227\213\275k\257\365=\306W\315=u\351\010\275<\372\266=X\275\255:\231)\321=\025\343e>\213\261\033\276\n\334Y\276\033\332\241=\303\330X\275\365\024@\276\335F\370\274K\2425\273\272]\006\274\002\305-=\243\030\024\275L\241\313=\370\2061\275\312\256t\275\017\375\242=cI\276\273\232\031Z\275\275\253;=. !=\216\217a\276\312\367d<\3501<>e\2332>\214\325\232=\000\306\226=p]o\275\355v\340=\2044\360<\037\244\324\275UA\235\275R8\233\275v\272\226\276\221\374\347\273\227Y\017><\316\316\275\232[p\275\250\325:>\326\033Q=\215qK\276lt\277\275)\247\253=\304\314\234\276\033\232\215\275%R(>\\\337\021\276\261d\003\275\004\346\306=\005=?:\353$\204\275\0175Q>.\003\203\275}\250\\=\227\242p>\335\241\334\274t\336\271=\373\336T>\306\356\007\2764\363k<\227\t\307=\351\253\t\275~b\211\273z h\276\035\320\343=cZ\372=5J\205\2761\261;\275\360\270\207\275`\374M>7\340\201\275/3:>\031\017\252\274t\273/\275\302\007\224\275mDa=\237+\022>$\254\262\274)\252\t\275y\262\353<\340w\006>\0253c\275\016\370\215\274\212T1\275\363\302\013>\361\375\024>i\364\003>\303\032#\276\344\240m=\2210N\275\247\240o\272\004B\010\276\235\301\020\274\220ku\275\002\\\024>\3337\226\275\337\250\270\275\307s\221\276\204 \227>\312\025->\371x\252=L3~\275\240#G\276\306&\316=\312R\332=?\2771\276\343\373\000>\324\0311\275\345\027\023\275\346\222\000\276F\330\227<r\013\362\275\314\004\r>\322E\376\275\235\270\323=n\210\376\274\264\275\r\276\217I\270<Dk\332<\274\216\'=\211\373\237;\005I\022>\215\365d\276@\021!>w\242\334=\303\213\202>I\214\374<\006\231\322\275:\236\213=\007\226\236\274\244\354\266>\017\250(\276g\230R=\320d\233\275\256\252X\276t\306\331\275kq\366=\315\337\326\275\334b\027\273\0267z\275\212Q\305<\225I\332\275:p\334=\240H\201=\\\363\0249\035#\363\272\037F\310\275\037=\232=%H\372\275\037\273;=]\215z\2750}\003\276\210\314i\275\226F%>\335?\230\275\261\373p\276\306\270\032>\014\216\367=\343\343S>1{\007\276%\013\257\275I\003\365\275\250S\316=\034\244\232\275\270q\234<T\010\250=\223\2176>~\363\356=\313Y\202\275\362\206\017>\255\ns>\216+o>\004\360\242=\223\200\020\275\350\177\037<\321\211\257\276\0351$>\265\345\324<\307-q\274\270#0\276\236\267%>\240W\213>\336o\241=r%p=]\\\250\275&B;>\215\271\003>\200\311\316=*\203(=8\2134\276S\225u=Y\343\177;\277)b\275\327\260F\276\257\325\177<\032\321<=b\214\332=gu\227=\324aH>\223\026\367=\035\210\314\274\247H\210\275\205\021~>\361\027\003\275\034\351|\275\344\370\225>\3431\220\275\317\n\203>{@\227\275\272\335%<<\331M\276<\216\326\2744\372^\275s\234\024\275Cj\320\273\024\037o<H\025\204\276S%\t=\'l\352\275\240\nj>79)\275\355\211\377\275\224`\307=\200*c=\307\315\205\275\037cC\275\237\340\033>\270dL\276\257%=;\214s\352\275\350\223\323=]\262~=r\267\203\274\233\357^>\217\355\322\273E\210\003>\276\020\323;@\257C\276\035+\336=\317\006\"\276\'\261\014\276\240\300\323=\334F\370\275w\362\351=\n\036\013>6\\\277=\323\226\377\275\277\211)\275Js\036>7\032\205\276\334~ \276\307\377;>\006\356\223:\2555\352\274%\310\245=\354\224\230\275,x\316\275\322TO\275\366m)\276\235\327\305=\330\206\316=\201\301o\275UE\336\276\245\365+=\026u\365<\227\004 >\220\332H\276!&c\276\020\t\202\276\245\366\362=\021\271\364\275\202\010\177\276\360\320\220=8*\031>\235\350\"\276\023N\225\274\354w\263\274\307\036S<\324M5\275.>D\275\300\'2\276\372\007\257=\304\260\332\275\"F\243<n*\016>\260\272\223\274\305P7\276\360\204\256\275q47\275\2013\200\275\307\303\005>\021\\\002\276\336\351\206\275\006\260\006>y\304x\274\024)\241=\007fv<\024\310d\275\243Q\331\275\327\214\037\275\376( >\235\212\025\276\n{\030=s;\243=\201\004\220\275RKT>\317\337\347\275\352\233\236\275\214\321\206=\"\361}\275\261\255(\275%\264=\276\331?\205\275\332\351\306=\\\237\365=t\235p<\210h\222=R*:>\305\3463\276%\037\337=;\n\375="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
