node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5358220
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\354\243\315<s\357\375=<\204\006\276$\312\267\275\277\300L>\031\221\223=\224\031\244=<A+=\355\320\231>\327\251%=D\3040=\376\266\216\275Ng\230\275xj\324<\237\367\231\276^\214\214=\255\354@\276O\335*\276v\0029>\371J\325>\321\273A>:y\266\275\264\254\207=\301(\024>\327/y=\024\320\231\275\253\205\323=\n\372\034\275W\014\213=\235.#>\257_\266\273XjL=\007f\335\274FF\264\275\320\034\033>\223\242\345\275\375%\207=\366W\002>\301b\327\275\350W\033\275\017\215/<Q\357\273=\021\377\'\276\031\177\004\275\227\254\025=^\032B>*\245L>\025\027V\276#\340\022\275\202\262\224\275-\346\262<\277\266\032\276\261+\013>\020s\272<\023\252X=tvG\275\237~\317\275\256\027\204;[_7;$\211\362=8\362\260=\363\313G\2756q\003\276\372|\263=v<)>\300\237\266\275\021R\230\275\326k\271\274\241jd=\362\231A\276\253\327\344\275B\000\007<\244\235;<!\034}\273\226m\025\275s\n\003\275\016\251;>\205\311R>vk\023\275!M\256\274^P\265\275\254\221\023\276\264\016\374\274tH\355<\317\266\017\2763x\010\276\351\303\360\274 \216\024=^0\344=M\264\242\275\004\014J\275\270\215\265=6\256\031\276\215\026\013\276\272\'1>\305\2265>\346K\356\275\367s\013\275\236w\213<\222hV\276\251}\221=\022\305S\275\003\273\037\276\356\037D\275\261\225n\276\r\3214=\\K\033\276\366\341L\276\301\332\020>\031\216\344>\007\205l;\177\242\267=\312\t\264=\037\234\364=\350\272\010\276\2062\245=?\376\202\276\244I\360<\217k\311\274NRI>\016\340[\275\025\327\213<H\352V=\221\207\365\275\014\234\035\276\344}\315=\221]\210>\215\253\214> ]6\276\314\014\237\271\005.:\276cH]\276\2776\026\274R^\010\273\032H,\276\010\024A<\377\3772\276o\236\211\275M\241\204\275\253L\357\274\304\354y=\375\244\200\275\210)@\276H\016\'\275\232\375h=\206\234e\275\200\303\017\276k>\310=Yx\017>\304Q\310=\013\002\245=\3450\025>\246Cm<\022Oy\274R\360\312\275q\274\221=\035z\333\275U\260\027\275i\0273;\246d\026\276\372\244\252\275\221\266\217\274k:\204\276\222\205/<\304c\027>s\230\304=r\\\325\276\216\n\212<\244\342n>m\214\317\275d\024\242\275\334lg=Kw\223<\270\031`\276e\'\317=:\256\001>\246^\002\274\247\3242\275D\004`<\371FS=\254*s\275b\022\013=\307\255\034\276;\\\350\275\214\031-\276\222\367\230=\t\260 \276pTg\276\374\217\214=d\023\237\275\232L\277<S\236\337\273\231\367\232<\320\010\274;K\373\207=D%\207\275T\023S\276\217\312\233=\344\357\025>5[\220\2758m\004=\023\\\243>d\360\233=\023\'\224\275i\231\260\275\245\252\334<b\316\324=\317\230t\276\240\310U>\252\310\360<\261\203O\276A\"\"\275\3253\240>u\317\300\275\267\326\273\275\371j(\273\035\206\207=\216/7\276\352\303\230\275C\216b\276\244\376(>\304\260+>\352k\205\275\n\023P\276L\245*\276V\332\236\2751E\242\275\327-\357\2756 \366<\364\312\034\276R\274K\276g;\331=\316\230\205\274\211\315\233\275\352\301\342;q\030\003>\353\240\246\275\302\312\314\275\3607\373<\030y\014=\234\235\253=\342K\013=J\336\372\274\267\364\006>\016\363z=\320#o>\2452\031;L$`>w\353v\275\351\376\030=\025j#\276\330\337\243\275\301\313\326\275\256\262\210\276\226u\005\274\344\257{\275\362.D\276\035\202\216=P\337\027>\376\034g\275\306\350\305\275\215\224\014\276Y}i>\010C*=A:\t\276\006\004\247\275S\275\343\275\306\013\003<\330P\014=\235\220\354\274\2258\305\275\241@y\276F\247\227>\346\342\027>?\2446>\032k\n\276\007\225Z>G\265\353\275c\201\324=\3461(=\317\025\351=BmT\275\216\301E=\220\214\020>q\226\'\275\323\026\315\275m\036\244\275i!t=\320/U=\206y\200>w\\l<\275\\L\276{)\270\270$\211\r\276\034\304\321=Nlw\276t\234|9\311\214v\275\330\341\034\274\267\344\206\273\245\273\260=p\234)\276N\"\360;\217\2412>\362[\252=\210\314\246=\331\257c=\223ZF>\217\372\207=7\220\336\275\211\235\343=\244\3054>\014\315*\274\2246\025\276e\216\250<\331\017\341=8F\224:\236\320\343\274\037\324\205=\341o+=>r\320<O\373\003>\331\246\2669h\237\201<@\270A\276u>/>Y*\320=\230j\256\275m\217,=\374\361\332\275\245_S>\004\253\232\274\2261\235\275\267A_\275\232|\246=@\261/>d\271\360=\242>\272=\312\016\266\2733\363\007\276wn\235>W\013\231\275)\2647\276M7\023>N\027\220\275W?\313<zz\373\275\313i\221>\312G\233<\261\337m\276_\202\010\276\016\0369<\253\351\006>\337\233W>+\367\005>T\252%=\213\t\320= \"\214>=G[>\323\304\005\275w]N=\204\225I\275\267b\004\275!\345\002\275\264\341\213\276\245\032\344\275u\214*>\254\365\237\275\223\007H\275\343\237&\276n\377\023=h*\267>NO\226>T0\007\276\221G*><\217\212\275\000!%\276\336\265J\276\316>\026;\236\351\014=D\251l<P\327e\275\tU\375=\210\001)>$\324\315=\220US>J\343\000\276\231\227\315=\022\272,>\214e\225=\301\247\367=3.\021=T\334\003=\326\200S\275\366C\224=P\2206\275\340%\234\275j\312\263\274l^\354\275\227\271z=1\315\304<\235.u<\206\246\335\275^\324\211=t\376\233\275&\246\223=\"\244e=$\342\275\275\214p7>\361\202\304=\016\221\204=\001\242A\276\363\231\272\276#\302Y=Va\314\267\023\311s\275\246\2211\276\375\230\204=\242\037\020\275\r\267\261\275\375\205\355<\243\210Y\276\275\260\252\274\014,\201\275Q\000\260\2755!\027\275\t\237\034\275\266\342\314=t\016\246\275#\377\217=SM\037\275\343\031.\275$A\372\273/\2116\274\217\230A\275m\277\306\275\014\345\340\274\333\270g\276\241a\207\276\3402,\276\241\356\237\274\317\362\027>\004\t\010>)Q#<\315W5>\310Fp\276v`\227\275\265\243\343\275a;\021\274\361\232\213=\205\211:\276t\0264\276}]\323\275=$C=%\337\371\275\275\240\\\275d\363?\276\010\205\243>;\0003=\006\370\310\275GV\220>\334\347)\276\325,\001>\322\231\370=\336\020\036\275\342\332.>/\343\346=ff\327\275c\222P=|\030\241\274\212~j\276[\3354\275LZ\017>o\340\010>\'\231\206=\'\344\355\275\263\275F\276\317\272\345\275\272\266\215=\222\377k\274\324\251\304=\3658:=G\252\247=m\356;\275\020\024\207\275\033\365A>\367\343\017\276\371)+\276\244\245V=\377\272\371\273N\032\000=\310\323\014>\352\262F>\326\000\200\276\0321\004\276\247\304\'\276\351\232\225\273\220\020\210\275y\305\000\275\366\244\026=\255M\376\275\027\304\354\274do\306\275!\2449>\211l\272\275NWd\274\371\236\360=\274P\177>\346\267X\274\274\327\353=\020~\254<\354\324\372={\201\004\276\245w\275\274\272Hi=cN\026=\001\013\213\274\023\374\224\275\332\014\200=\245<\351\275H\230\200<}y\016>w\001&>\245\036\021>\354\206\020>RT\321\275\343)\243\275)\005\324\275\004i\326\275al\211=\272F\010\276\264\210\r>\317\300_>`T\274=aG\302>\267\207\257=W\275\240=I{\\\276\311\273E\276e\364K\276\355\201\235<3n\006>\226c\334\273\322z\273\275\0307\231\274u\327\235\275\020\021\004\276\037K\204\274\261*L\273*\355L\276\355u]=\332({>\256 \274\276\211\337\322\275K\367\233\275\361g\036\276(\205\210\275\321\n\377\2750%\035\276\356\n!\276\205\014\271\275\322\334\026<g\302\227=>e\017\275q\205\220\276\236\031\030\275\033zJ=\241\372\361\275\3232#<LV}=~\\\030=L\2317\275\034\003K\276\331NI>:\374\005\276\\\235e=\351G\210=``\010\276\364|\024\276M\235\214=\330a}\276\202\262\355\275\231I\252\275\342~\326=\242\273\234\274\263y&>\224\213\272;4o\307\2746\r\024\276\335\274\277\275V\010\n>\276\345\236\272\334\026a\275\262C\031\2764y_>\351\370\320<\251\n\016\276\311\254\367\273\333(\223=G\223\211>\325\216i\276N\027\201\276!Tf=\030\346\310\274<\022x=u\006\260<A2Y\276d\317\370= \006\243<{8\204\276\023\036\304=\232+\263\275N\010e>\034\253\177\275\241\310\244\275v\336\024\275\0073\006\276\274\340\201>\315o\022=\363sV\276]\305E\275\206C\016<\256\005\005>G\326\343\275R<\023>\350\274\247<\223\342\270=\216w\013\276v\340\017\275<\004\227=\373\251G>b\223j=\34108>r\340\334=\223\221\033>_\350\361=:\305\367\275D\306\027\275NTC\276Tks=\352eL\275S\3240\275\206\316\026\275\323+\027=\330G+>Q:\236>\3578\206=\261Q\020\276\376c\310;\370F\233\274K\214\006>\030\361\320<\271b+>G~\3079\205\305\320\274 \324\273\275\316\017\030>-\213k=\256\253T\276\337\316\037\275H\304\231=A\206\200\275\230\206\214<\310\342U\276|Y\002>9\010\022\276,H\231\275\327O,=\230\220Q>\"\005\263\275\377\326:=\222\323\356\271\243\215O\275\365s\317\275\367\324\267\275\262\r\003>\243\006\310<\010\205\276=\342k+<\026\\\223\276\334\271\253\275C%\002=\346\215/\274/\224W=A\301`>H\tP\274*\005\r>\014\370\240>\032\312 >\317s\207\275\213\320\004\276\354\021\005>\256\373e\275q]\220\275\312\363~=\205\316)\275]\020U>+\030\257=k\312\321<\376\215\013=lO?\275\201{\301\275a-U>2\344\305<3\362\023\276\222,[\276\241\004\211\274\354\332\245\274-\226\240>9b\226\276\033\030\261<\305\2073\276\311?\352<)S?\276\363!\026=S\217\252\271\217\225\226\275U\275\030>d\236\270\275\325\377\210=\367h\233<Qp\252\275,\177\203\275\277\345\320<8\225\275\275\027\240f\275^O\363\275NT\013<\201)e\275kq\245>\334\030\224=\265\277O\274g\310\\\276\360c\203\274\263\277=>\216\234\253=Kza\276\023\027#>?\216\343=\317)\t\276R\013/\276t\317F\276H\023\251\275\325Sq>\221\303W<!;w\275\370\255V\27634\231\275\264nZ\275\023\2420;\233\355\340=\t-k>A!\275\275\205!K>W\201\302<\032\337(>\363%\016=\014\014s\275\203\234\245\275\322 \306\275\2113\302=\350;\304=\017\243\273\274\345\020N\275\326@\010=/r\203< \r\000>\221\325g\275\263N\324\274\033\032\300\275\304u\242\274\307\241\252\276\233\217\303=\005\"\272=+o\257\275C\244\234>H\226\260\275c\355\305\275NI%=\361\274\330\275\251/)\276~-\212=\200\304\267=:l\344\275\263\234H\276\263\014\237\2750\345\014><B/\275\345\323%>5R\253\275\326mA>\307\306\271\274.\221?\276\246\013`<\022\271\250<\250\234Q>\355S\021>\376]\313\275\272L|=\250\215\354=\276\247\362\275\300\244k=t\271\037\275\312S\037\276\000>\020\275BZq\273\335u5\276N\r\001>\356\'\206=e\245$=1i0\276\253\036y\274\376\030\366=\350 A>\360\321\230>\366\302!> \260\227=q\236;=\327\252\304\274S\253\211>Q+\'>f\022Z\275\305\344\014>}9\026\276\370\255\235\274J\005\213>\026\233\031\276\300S\030>E\367h\273\266%\313=1\233\t\276\326\201\350<\027\021\345\273\276\033\n>\271\373\330=\3769\003>f\222\316\274\345\372\312\275\006\274N\276\206j6=}\334\202=a\270\n\276/^\233\274\362\235S\276YV >\005\203q>\037\250\032\276A\025\271\2754\006\\\276\201\252R\274\226Y3<\226\340b\275\025\262\345\275\375\002\363\275\257uX>\324\274q>As\315\275A\327.\276\337\013\036:7U\020>F|\033\276\177\376\227=80\247\2766\247\236\275\031\273[>a\217\t\275\027\032\267=\3658V\275&\013\341<\324\0045\276\351\244\305=\016\262]\276M\330\256=,C\375\275\226c\220=\344\3565=bk\307\273\004\241\277\275\3740\007=le\020>$\342+\276\216\356\030>E=r\274X\036\206>\030\036\247;\230\262\263=\261h\340=~Q\007\274\252 \263=\256\034\300=\004o!\275\302\231\325=\234\r\031<.q\027<<\231P<a\035\321=\210\330k\276\212-\270=\003k\225<`\311\365<\3507\210=X\351\214;B\237\242\275\305Mj\276\221\252\350\275\255\330\215>\317\202:\276.Cf\276\320\315\204\276\005E;\274\311SI\275\304<\277=\244\003S\275\377\200\373=L<v\275<\201\357<\230\352\212\275<kN>Pf\220\275\235a\336\273\240\261\251>\2731\017=\020\323\260<\370T\314=\341\357\233\275\357\224Y=?9`\275\n\351\250=\306\322\021<B\330\021>\271\354`\275o/@\274?AF\276\026\254\244\274m\241\002<\303\273O\276\340\332\302=\000\366\n=(0R\276\336\361\177>j\302\352=_D\025\276\372\254W\275n\261\263<\025\325\302<\231\217J;\017,)\276\322/*>vK\303<K\303\302=(}\372\274\006\020\275\275\361.i>.\326~=\225\227S\276.\\\210:c\035\345;\221\025/>\357~\374\275F]\334\273\243\003R\275\320\310\261\275\346\214\265\275\265\346\333\274aS\266=a{\302<\350\340\244>\312\345p\276+)K;c\312\341\275J\232Z=@s\300=\rk\234=\003\272\027<\241Y\271=Q\326\263\275\235sw\275\204\273\215<\271\264\242>MO\026\276i\332\207=\001\311*\276\022\223]\276\205\346\212>\213\362\342\275:N\214\276)\374\225=\236\363\351\274\230\265\331\274\3231\016=\356\352\240\275\023cR\276\020\311\226\274u1\030>\305\320F=\370\213\325<\033>1<S\211\212=_o\301= \017\316\275d\225\037\275\000\224>\276\250\232F>V\333]<EG\345=o\0108>\221\207M\275(=\214\275\274\330\236\275\205h\260\275\026\000\373\275L\272&>\023J\215\275\256\0107\276\215\246\024\276\227\302\"=6;%=<T]>\237\260W=}\224\210\275\032\251z>\035v\266\276\\\0015\276N,\222>\313J\352\275\274\374\245<lV\324\275\253\002\232\275\214\214\372=\203\336\\\274&\262\352\2758\331^\276\217\307\030<H\017\225\275\370\376#\275\351\244-;\230+\227\274)\013|\275\212\275\353\275\315u\202>a#\205=E&j=\233!\204\275\030\221\347\274\201t*\275\305)\027\275\236\005\263\275@q\017=6}\016\276\211\235%\276\363\374\032\276(\006>=\315J\027\274PJ\374=\\\210\033\276\212<\313;=\326\325<i\341\005\2761R\030\276 $\255\275r3\013\276\245\311;\275\271\332\362=\330\322\346\275oh\025\273\347m\317=s,\376\275\n\270\323\274c\323\204\275\354\343\317\275=H\345\273Ei\357\275g\370)\276\242\321*<(+\364=l\010\335\274Q\2619\275\241r\225>\305\207\233\276Z\227\003\275\211P\377\275\277\363b\276D\026\005>\274<W\276\264@\360\275H\364\007\275\034\317\315=\246gR\275J((>\032\223\033>\035P\010=\226\023g\276\327\340\r>\267\037\314\274\326\256\207>\212\325Q\275\242\271\"\276\215\236$\276q\2662\275\025\365\226=Y~\325\2752\353\307\275])b=?\000\313\275HE_\276\362v\276=\356R?>\343\333\023\275\030\036\002\276\024yQ>\004B\261=\262#\320\273#\037\230\2757\2603<\232zw\275:\010\251\275O\221n>\014\260J;\rc\304<\\\010\026\276%4\177=\372\333}\275\246\025\020>+\357\325:Ue\216=\263\331\334\275_6\377\275\333~\334<6\327\333=\207\331\262=\372\217\233>\233W\235=<\366\002>\304\374\n>\303A\320\275\3754U\274\330\376\022\276\311\261\030=\035C\370:\225~\202>i\373\312\274\354\341\300=\013{!\276%\305\236\274\000\363\276\273\024\000\"\2760d\301\275\372J\355=K\306\236<\206\213K\275\360\243y\275\363QZ\276W`1\276`\3249\275tt\223>F\\@\276\257\324\351<Ww\223\274o\335\265\275\260\367\3009\345\274\246<t\255\276=\247\313&>\204\335\013>ro/\276\310\025\227\276>\216Q=f\244\364=\214\3531>\241\354\236=\325\2538>\034\217\t>\025>\024>\367\271l\276T\200,><\277(\276\275~\360\275\346\264c=T\232\r\275\200{v<\245d\215\275>Ms\274\313\006<<\023~\277=\033\377\207>\332\227j\275\210\022\361=E\037E>\253f\346\274\362f1\275&P;\276\200\201\220={t\032\276\300\344\014>\231\327\005\275^\035\000>\377\256i=)\272\n>\2236\024\276\030\260i="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
