node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9258423
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "o\276T=X\214\271<s\275\325=\372Oz\274=\214\336\275\206\306\204\276\267\264E>L\212\036<\374\305\004\276r\331\014\276{\231Q>M\331\324\275B2E>\310\006\353<}\031.>\336\3021\276x\335{\275\326\275\257<i\337\337=1\017\261\275>%\031<\226\340\325\275\357\376x\276\315\222]>Z\316D\275\004\260\230=\330\033\247\274\307S\001\273\267b\277=i2\212=\251\224f>\010L\n>\362\0302>\347\002\224\275\2272\333\275\215U}\274\305\250\233\274\370\364g=D\251\211\275\256\232\202\275w{\256=Z\241\016\276\271\247`\276\261-\322\275`p\312\275\266\226\022\276\312\257\t>\346\311\260>\340\035\243\275\3412\346\275\367\327\t\273W\255\000>\033\305#\275S\304H\276N\325:\273f\210\324=M\375\002>\343\271\232\275\025a\031\275!\2365\276\221>\027=\333\023*\276\007\3770\275\256\024W>\033\277\321=\345\031\030>\231Uy\276\223\263\311=t\323=>\275\261\037\276Z?]>\375e\276\271h&\306\275o\310)\276|\372\016=\243\320z\276/\354\325\273\253\321\261<\037\3516>%\235\320=(D\365\275\314\037\200\275G\242\307= RN\276s\033\002\275:\256G>4\0252\275\227\344\343<\321\215\254\275\261\311\253=\257\251\376<\032\014E=h\307\215;RoN>\260\"-\276\177I\262\275\325\354*\276\225\024\270\275\232\230\023\276a\000F\275\320P\364<\333\252P\275p\003\336\275,\213C=3\214&>\342#\215=\t;\207\275w\201[>a\313\\>\311\336\214\274D\007\232=\035\204\344<\216nG=t\350\003\276)pm\274\360\274\323\275\007\3663\276\002XX>\304\007q\276h7\367\274!\254\254=\223\304\021:\323\032_\275/,\013>\n\352_>\366G:\276\342\"\324=\256\344\022>~\353\242=\005\272w\275\014}\206;\274\2259>Q\2622\274I\336\241\275sx-\274\305\227~=\271\n\355=\262\227T\276\354\343\031>\257\027\362\275\313*\025>\025H\331\275 \276\254=9\317K\276\004\304\036>O9\027\276\004&\021>\355\3779\275w\020y>*\324P=\322.\212=\353X\314=u\014\352=-\310\277<\270\311\226= [\317\275\202\316\033\276\223\202\251=\211[\324:\225\224\326=\033ak>j\200\201>\003+\350;\262\2553=\2569\262\272\2773X\273u\223\232\275\233\273]\276\335\177\304\275}\212s\276.\311\036>\035l\034\276Z\022\301\275\312l\372\274\311\035\244\275h\210\004>f\357!>\200\317\244\275\000\273{\276C\323\312\275}\022}>\217P]\276\301^\253=\256\016\234\273\211.\203=9-\262\275\272\322\021;\351\027K=]h\373<S\013Y\276\346\300\306<E\242\214=\313o\331\275\220\305\215:\357\232\277\276\034\303W=L\232\373\275IOh>\261I\336=G\347\027>Q\217\323<\367\'\031\275\275\002\202>\373M`>\255r\t>\376}\200\275Y\264\201=j:\014\276\336\364\346\275\004\2629\276\220\n\204=0\261\231=G\002\352=\335\324\223\275\317\210L=\212c\035\276\235h\355=\345;\321<\202\375\367=\003q\310=\004\360\022\276\201\030T=\226d\371=b\312\020\276\231w+=\034~\272=\324\272\326\273\273\016->\373&\316\274\262n\366\274FD\322\275\267\343r>0&\326\275y\177_\274\327\357\217\275\237\346B=\357N\001=\324\\&\276)\324\343\275\031\003Y>\245\\I=C\321\217<\240\000v=\351\325\206=l\372\036>!\357\242>\350nE>\245?\023\276\242\355\031\274\362\352\373\275\233F\014>\327\240[=\014\254-\276\321x\311=\247Qa=9\347}\276,\235\364\274\231Sv\276\001_\344=\201\334\205\2765\333\217\275\275\236\031\275\270Xa=8J\016>\335p\277<\333\020\325\275\317\014\371\275z\205\320=\223\252\236=r\216k\275\261\250\346<\370l\n>\2536\206\275\027}\212=\220\363\237\275\246a\264==O\226>\363\321W\276\246EC>\243|%>8\370\374\275?Y\250=\306Z\357=b\nM\276\243h\333=\2438\344\275\213\201==\370\373\305<T\210\243\275d\350Q\274\351\021T>\004X#\276\277\003\021=\221\321_\275BB\221\275p?\016\275\275\227\220\275i\202\024;\275m >\354~\032<\227\"\t\274\\\242\037\276PG\250=\035\002?=l\260\037>{\205\034\275c3;>\003\305%=\316\251#\276\206\361K=\222)2\276\360\265\364\275\"\030\"=\247U-\276\275\\@>\337\360\334\274c\363\220\275zf\200\276\243\327\362\275\n6#>{h\370\275\311\244\351=\372J==j\177\361=\270\226=>#\334o>A]\021>\226S\337\275\\4\370=q\t\247=Y\271d<V\355\246\276,-\243=\374\361\265=W\336m>a\336K>B8\010<\241\322\016\276\205\222\333=3\020&\275\227\376\312\275~F!=\362T\243\274\032\267K=\\\233\312<<\357\212\274)\257$\274\201\027\234\273\177\342?>Z\371_\275\336\233\232=\205\032A>\037/\334<\213`\r\276\002F{\276\'&\275;\032\306\"\276\271\361\031\276(\274x\275[\247]<\226v\311=QZ\034>i\220\230\274\204\002B\275U\364\233=A\016\035>\211\354\024\275^\252c\276\240S\002\2761\237a=\322\335E;P\313S>\213\ny\275P\362|>\032\317P\270G(\n\276\244\234\251=\354\026\372\275\275\236\037\276]\372\246=\017\002\311<\024\037\351\275\373\017\336\274\331g\377=\367\310\210>\r\201~\2767p\302=\217\311\307=\177\027\267\275u\353\002>\347\277\002\276\214\210\022=V\307\026\275\344\270\r>\035J\261=\325\256\276=\303l\\\276\037\316\235=N\3423\275\222\346q\276\032f\206<\026\232\005=O\'\364:\352\226\004\276\225\016J=\307\000\321\275\030aX=tI<>\216\215\231>\215~\342<\272\322]\276\347Z\350<=\370Z\275M\252\203=\340O=\275\346\341\272=\006zY>\342\343\250=\022!K\276\261\3570=\2156\005\273\223\010\013<\235\201\203\275g\'I>\207/4=5\3768>\321\3446\276\303\276\251\275\215s\003>\277UQ>\030\267\002\273\002\222\341<4\333\243<u\300\227=r*\r\276)x!\276\317hg\276\326\240\017\274\001\320+\276\013\204~\275\004V\037>\262d\272>\013\030\251=[\013\273=\r\317#\276V\321\034\275\276\\\322\275\312\257\364\273Y\273]>\375m\023\276\031v\r>\r\252\030\276\331\304\367=\275Ib=q\222\r>#\243\006\276\001\273\020=\357\353.<\2405\202\275\033\233\336=\315;\327\274\260\210\361\275\"fl\276\310\022~\275^\225\356\275\232\td=\335\245!\276I\007\223=\261\222\205:\325(2=e\215\327<\030\265\017<\257`\214\275\2744\340=5?)\276\266\207o>\344\204\033>a\200\020=|\257]\275\240,p\276f\021e\276@\'\035=\366\024u\275i\\5>\375>\001>2S\216\275\206\224\033=)E\036>\301\3216\275 @\230\276|n\004=\300\003\254\275:^u>\376\247\007>\006\252\236=\372*\203=\335\366\000>\251R\357=\202\260\267\275\307R\205\273\360\265>\275G\327\247=\337S\020>>\"\214\276\010p\306=\277\215\211=9\350\305\273\032\321\006\276\006\037+;\367YS=\203-\177>\236\371d\275\275\302{\275\235\353\245=\275o\032<\035!\250=\364\233\200;\357\344\2169Up\274=~9\261:\267\210 \276\203\2510>T\356>>\"xF\276\006\337\232\275\213|\331\275\211\264\271<I\3356>\010\031\336<\350\224\006>2+\355\274b\232b=t\235\031\276\"3\225>\334O\010\274h\020P=\357\"\014>lpp>8\025->\262=\257\275\353$ \276\354\001\036\276\367\354\021\276\247\277!\276\310QW=({g=\253\322\203>\303\201\223\275&\225\324;x(`<x.\">r\017\331\2743\251\306=\300\016\262=\005DH\275\373\370L\276\315\267\227<E\324\3239\374\216T=\025.\205\2722\ts>\264\322\332=\347H\037\276,1\363\275\244B%>\350\3560=`\264y\275\323$c\276\3651F\275:u\230\276\371Ii\276\251,\304<\272\222\023>#\2314>Q\321j=\224E\240\275\260\321\312\275\330!\211=\235\341\306\275\330\270\006\275A\235T\276\335ik>\245\034c\275\362m\223\275)#\177\276\305v\376<\264\224\"=t\263\240\275x0\362\275\002\213o=\t-\010\276\251\021*<L\270F>\201\033\342\275\003J\235=\256r\023\276\032T\024\276\330(^=\025\035\330\275\007\304G\275\306\272\343;\343?\033\275\266\265K\276\310oj\273\341\374t>\223\266\336\2741\363f\276Ht\025>\031\000\227\275dx\221\275ts\032\275\345\251\234\276]\223\003=[f\202=\327\275\242\276\"\013&>\272n\322\275\014\242\204\275\2707N=\325\265b\275\274\237\301\273?\272\020>\223\311\371\275[\276{=\"\301\274=+\260*\276\247\tu\275!\020;>\016@\321<\034\272\034>,\330\205<Y\177\212=\343Z=\274G\275\306=L$M\276Z\013x>\361)\365<\343s%\276\344\226~<\357\327g\275I*\342\275\3272x>md\247\276?\367\007>L\202_\275\325\262\275\2756\241\027=\030o.\274V\200\254;\363\260\224\275\276\262\376\275\223\343)\274\316\344\325\274\247\201\253\275F\034%>\354\000\256=\237 \200\275\334\307\344\275\251\342K=\361{)=\351rx>,$\273<\304]\237=\330EE>1;\023=\250\014\257\275\036\306G>\345k3=(\334\345\275\343T!>\220Yc=\272az\276\270\036[<\313\t\016\275\271\202\373\275\232\204\352=5\216\310\275\227\373.\276\240f \276\034\034c\274\266\221\225\275m\234#=\000( \276\242\262m\276#\010\036\276\226FM\275\226\341\201\2754\005\376\274N\312A\276|\315\211<}\023\235\276V\214\316\274\270\177\027\276\302AF=\274\"\005\275+\271\033\275\003\304]>\336^\372=\377\232I\274X\027\324=\033}\007>\362\253\204=\347\325\025;\344W\023\276\354\270\'=&w\317\275\002\273\365\275-\330G>\3216{\275z\250\003>{,\245=\371\324\217=\324\3750\276\032z\225=H5\232:\203\203[\276\273\252j=;(\245\274\247_\222\276\204ip\275\361I\255\275%\272~>5\010g\273b\375r>\"/G>\344\251\207<J\335:=9\007g\275*\233\213>\302\213\007>\234j\251=Sb1\274\320r\262\275\207\211\007\275\017\365\2629\320h\234=p>\352=$\205\324\274\236\025\210=!\255\027>\226\301\257=g\026c\275\322\371S\276\240\234\337=v\242\007\275R\\\245>\270ZX\275\367\246R<.\343\371\275\025\226\202=O#\022\276+\376\274;\261o\246>/\203\324\275cp\305=\221\254\343=M\004\314\274\270\017u=fI\017>Y\270\231>9\330\355\275\221\206\211=\2667\272\275\037\276\210=\211\263\351=\204\201\224:\013\311\322=\221\000\212=\236\304\254\272R\310\237\275W\223\267\275\260\377,;\010\334\215;k[\003=f\316\203=\325\202\005\273\005\317\201>D\237\350=\221\220\305=z\303`>\003\326\241\275\264j\266\274X@\007=.\rr>\265\252\344<\214,\340=\262\216\240<\216\016\201;L\351\371==G\021>\352\233#>\332\316\016\276\362\200m\276)6\242\274\241\005\205\275\204~\016>\t\355\206=\204\322\244\2748\305N>\205\371\357=4\267\353<L\2151\274\246\232A\276\332\272\024\274\350\303\023>\n=\213\274\033\016L>!=\374\273\353Q\353=\030\335\321\276\3665\006>y\247\225=UyN\276\336p\205\275\272sQ=\006\300\311=\036\347\355<^p\244=L\350\020>{\321\224\276\201\360m>,O\r\276\336b\244\274s\315`<\321\333L\276\270\000\037\276vb\367<\022\351W=\367W\300=\334\231\361\275\316\257\223<EA\263=w\364\233\274\371\3728>\341\366\n\275p\202D\275A\233\375\275\373?L;}\227\335=~\304\324;\206\0371>\224\262\371<\211\363P\276\037?\027\276\035\305\r\275\013c\257<\034D\260\275\322x\356\275\227\253\332\274\343\207D=\\x\361\274o\333\'\276\300()\273\265\022D=CR\322\274R\322i\275\306\210\242\274&\024\247\275\255)\300<\250\344\247>\022`F>&\366T\276#X\251\2757\027\316\275\212\030.>8\253\026\276Q\0352\276z\313\331\275\201N\304=1\255L=\2741T>\030X\"\276#\245\234\275+{<\2767!N=\247\251w\275\304\221\202\275x\302\320=\346$;=1\322^>\030\024\007\276D`U;R\363%=\023\236F=q\336\200>dt\335\275\250\030\317\275\033\203)>-Z\275\273!&\004\276\227\377&>\365\376\351<\205\211i>}\036\016>`I\001>Sk\321\275\364\324\267\275`kK\275\262L\256=ztv\276\022\215\231=T\020\030\275Aj\337\272\232\200x;\232,\002>\253F\335=SI\317<\201p\223<\310ME\276A\017\t\272\236d>>\014\"\326\273\227\t\235>+\207\222=\243\356\315\275\2167\277\275\215>s\274\013\366p\275\272\372\260=\013\275\201\274\232(\242\274\323h\233<\374\244\264=\360Lk\275\255\317e>\334u >E\276\352\274\033\251n>%g\027\276ooz\274\027~\336\275\263`W=yT\235\275\210\007J\276S\027\262=jk\200\276\327\242\026>\307\3113>\250\240C\276\255:\326<\265/\034>\357\035\242=\277\322\302\275~\371m>\274\317\004=A\303\027>\t\270\267=\244a\246\275\221\217J>\030\227D\273\321\274\033=\342\017}=\227, \275$~\307<\353\343h\276i\014*\275R\253\237=kj9\275\243k\276>\301\253Z\275\177\224\004>w\275\030\275Z\005\216=\3105S=\363M<>\316+g\276\301\312T\275\271Q\205;\272\010\335\275;~l>\300X\364\275%\264]>!\210\234\275\230s\342=g\270\217=\377\322\304\275U0\240\276O*\371\275\240\332\314\274^\'\323=\361I1=d\254\021\276e\246\214\275\255R>\276\365*v\273\201\267G>A>\215\276\224\364\236=\271s\302\275\031\224\375<\253\004\376=\341EY>st\235=*I\020>\370\346\200\276\375TT\275\234\245\220\275\rD\226\274\023\214#>\326\031\367\275{3m\275u\272\003\275\247\340\000>\203\006\037=\361]}\276\027\317>\274LYQ\275Y\t\305\275\nK\027\275u\374n=#\363\305</D\372=\3379\366=\371HN>.S\223\275\000^\344=p\354 \275\200\034\241\275\2667\276=Q\315\330=-\023\353\273\007\013\211\276\335W\252>\013hF=\r\031C>\366\356\224=@\307i\275mM\013\276\213\t\207;\031\2532\276\370\256`\276n\272\211\275\202j\224=m%\235<#\3418>\024s\332=\022\363\017>Wu\206=W\250y\276C\346\222\275\311\266\273>,__=\000.\"\276^\353\t\276 \231,=\372\337T\274\013uR>iu\014>\346\213\335\275\252,\033\276G\004\330<\244\n6>~K\273<\325BN\274t\243L\275Fy\276\275\002\373\032\274\235\245\306\274\213\2642\2753\342\361=l\200\220\273\364E\335\275\250#\377\275iy\000\274\031{1>\310\233\350\275q\363\326\275\2255\030=D\233\246=`\022\001>B\244\362=\026\260\226;\267\271\356=\220#9\275\366\231\002>G\003\026>7x\330\274\327N\272\275\245\312\311<\312v\307=S6@>\341\350\327=Q\023U\275\210b\327\275\315\t\034\274\030Lb\275\230\374\"\276\026`\371=\260\r\222\275&\r,\276\330\247+>\351* \276\203\274\377\275q\014\r\276O$M\274\351\304\n\276\'ug=\237A\r\276D\206V\276&!x<\312\013\301>\202<\237\274Y\214\354\275#~\024=,\377\234\275C\306F=S\366\201=Y\306\004=+\177G\276\323\332+>\034\035\354=t\"\014=\223\255\021\275s,T=~\274\222>\366i\276\275Sb\272;\307p\367\275\234\262Y>\342\204G=\326\350(>\256\276b\275g\263l=F\032\005\276\315f6\276\000U\023>\341w3=%\026\261\275\244!\033\275\201\273\005\2754!>\276\240|\336\275Q0\030\276\215\024\343\274h+\303\275\265/`\273\'zs\276\000e!>\r2\277=\365R%<\243\316?>\220\315x=Q\336\332=\014\373\255\276\317\027\004=Q\315\">\307h\315\275\253\334\224\271\3670\031>\027\340\367<\227(9>R[#\276R\263\004>%,\"=P\344\220=@x\264>\264-\300\275i$\256\275b/\361\274s\207\352=KI\r\276\204\237G\275 \216,>A\350,\276[\303\366=\004\007\020>r,\027:PR\032=\211\301\304<\341\321\344\275\344\014\t\275\221\016]<&\035>\274:Y$>W\377t=\213hD\274\344\246\026\276\371l\333\275\330b\250\275\364{\232=[\312\241\275\244\376<\276c]\242\274\325l\325\275\231\371O\276\247z\344\275F\324\221=Z\362\023>\355\321\036\276>\035\255\275\234\356i=\322\362\231\276\036\275\350<Sy\252\275\r\005(\276Z\017d=\275\264 >[\005\226\275\360\244\231;n3\333="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/zeros_like_1"
  op: "ZerosLike"
