node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5508588
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\366\n\240=k>Q>i\323\354=3\014L\275}\231/\276\3744\377\275\265\202\023\276\035t\016<\346\332\252:A\345\314=\0103\263\275\362\014=\274\267yN\275`\371\006\276}\254r\276\336\343\330\274\334\256\205=-\311X\272\303b5<\264\260r>\317\027\004\274\016G^\275\344\277\225\273\311yz\275\031\212\223=\343\237X\276\220\260 >\310\222\236;\"e\003\275\323\263\200<\351\245\366<U\215\034>\265-\200\276\313PU\275\314\255\236>35\025=\316\366\203\274%A]\275\324\202/\275J&\217=(\306\024=\213?\253=\263\315o\274\314&k\276o\200\203>\375\005\005\276\340\367&>\017?\000\276\177\206\215\276\225\000{\275\3003x\276\325\026\036=\377\201\227\275IR\241\274\275\356\242\275A\3336\276\314\357\362<y\037\264\275\020\301\257\275\020\237b\276\374\220<\275\030\236\317\2755@1\274g\370A>,\241\\=\354\n\303=\257\240~\275\031\376\206\275[\016==\200p\273=\355\366\224\275\240\2006=/j\216\276\347v\213\275\267I<=\263\030\000>p\372\330=\371\265\337\274\024\001\203\276\326t\006\275\344\272L>\244\321W>\361\246=\275/p\203\275\3172\177>\330\366\226\274\346\021D\276u30>\"\303\347=\272\275\375<\251\200\204\275\312\231\376\275\372=4\275^\3622=w\275\341=L!\207\276\270M@=\205\2152\275\310\235\321=\314\242\363=\303xP\275i\312->\tr\220>\230\200\010>a\374\221=D\231%>\247p\253\275\267\034a=\024H\250<\273\260\345\274\357q\303=\256\262\300<\276\367\000>\016\205\215<\231\372\002\274\247\036\270\275<\301\036>\366\2165\276\004\311W\276\'\242\200\276\244\200\356=X\340\217\276\032H\323=\337\3225>\333\331W>\244p\030>\'\340)\2768\322\313\275F\303\340\275\234\332>>\225!\021\274R\3270=\224X\350=\326P|\276I\235,\275\245\322\367\275\251\205\307:<\324\006\275Ka\350\275\3466:>\000J\322\276R%V=\220\2767>[X\313\275\314=\316\274U\335\246=\304.\331=HA\327\274CZ\003\276\360C\227\272u\177n\275->\273\275V\036\274\275\306+\006=\241W\246\2731\017^>\2415\010<\231\362\n>\203i)=\233\250\005>\020g\n=\326\013\232>P!\247<\357(%\274,/\204\275]\275Z\275\3210N\276\t\372|=\241\354\353\275\221]\"=r6\214=\267#a=\215%\227\275l\233\004=kZ\261=\241\000\360<\353f\223=\r\225\206\274ec\214\275e\2130>\370g*>:(\315=\316\352\370=<\330\201\276%\326\314=5E\n>bb\003\276\314$v\276&\347\343\274*\335\227\275\367v\001\276r\300\324\274\333\001\202\276\377h\313=\370\035\"\2751\235 \276\202\000o>)\332\365\275=\356\016>\313v\304=\303\020\n\275\362\352S=S$S\276\346\320\310=\226(\322;\345 \345\275\331\330\004>\351\"\007\276\311\017\266\275H\254.>{\243\264\275\374\321\322\275\'\026\365<g\221\020\276 \037\271=\271V\362\275k\233\252=x\017c\276A\233/=^\227~\275\325\346\006\276\262\330\245=\317\347\303\275\2561\302=\220\274S\276\227\204K\276\350y\032\276\375:e=6_2>\242\272T\274@b\036=;\264\322\275\245\002T\275\276\225\226>\217\314B\274\004\036\252=\002\277==\322\261\241<\025\267x=\211\002 \275i\334\206=IB\235\275\234\226+>\372g\2559W\340+\276\035u\224=T\3325\276\000O\320=x\334\251>\004\2770\276$\327*>\247\316\257>\"\332\010<\341\233N=;\336A=Xp\307\275\351\347\334\274\217\230n\275\301g\037>\363X\224<;\\>=y\353\031=!\324x\274\243\361\242<\032A_<>H\276\275\212+\203\276\037\034!\275H\372I\275\230|\270\274\361%\360\275L\010\273\274@\304N\276.\002\017\275x\213S=\024\306)>lc\224>Q1\332=Gm;=C\202\356\275\220\216\233\275jC\323\271[\371\007\275|\201\225\275\301\232\027\276\306\346x\274\355s\030>{\212\306=~;\332\275!*@=\253\020\">@\251i\276\236G\211=\227\220\r\276\025\2234\274\350\375\256=\352\211\204\275N\013r\276R\226\032\276\341%\250=\3706=<\236\020J<\323\252\254=\217\016?\275:\037{\274\236\265\311=z+W>LO_<Z\022\025\276\216\220\r>x\364\241=\340\245\211\276\036\364\'\275J*\343\274\003S\'\276\245X\203>mIk\276\322\2613\276x\330\037\276\017L\275\274\260\240\306\274M\235\313\274\347 \317\275\355\006\022>\214\332\354\275\363\\i\276\003T\021\275\304O\203\273\032\251\262=\331\363\323\275C\224\274\274\017\0250>\236\322=\276\202R\253\275\356\304\341<$\203T=\223t\374\275\213\274\362=Yn/\275\036\334\206\275,\263k<^V\\=e\017A= 5\265=o\3041\276u)3\275\014Z\315=\'\345?\275i\312\310=\217}Q:\247\030\361=\262q~\2764\331\374\274\210\356e=\006\252\222\276z]\302=\330[\210>J\016\002\276\313\322\025\276\004@N>\353\027\002=\031\337$>.u\335\275\010t\222\273\217v4=\021\273\217<\377\367\204\2767~\225<\332\270\324;%\362\032=\354\244f>\367\366\326\275\347\376L\275\214F)>\323\244\253\275\221\361\315=\024w\344\275\244\206d=\376e09\035\257`>\0232=\274\r\242\202\276~D\266=\266\364\260=+\234\234\273\2725\024>:\034u\276\363&y\276G\306{\274\312\226\201<\361|\332=\026\311;\276(\250\240\275\307\341\216>\332\272\240=I\376\016\275\313N\347\275\224\243\"\276\267\215q:?y\200>\227P\024\274\243\330&\273L\021\337<[\364\347=\277%\004\276b^\271<l\266\274<YiM\276\263L\247=\243\267z\276r\307,\275\000\316\000\276\320[}=\356\266\006=\017\rK>\257F#\276]\235Q\275\272\234\315\275\304\223I\275\300\020\024>\312\202\264<\316\236\340=\023\206\023>\177\310@=\026\223\n\276\005\345\234\275n\236J\276\032\300 >\237\000P\276\356/{>\250\370\275\274\037\234\021>\226O\251=E5\344\274e6\247\276\322\271\240\275\255\211W>\343\267D>\226{\025\276\021K[\27577K>3\350/=\351\026\315=\265\024\272=\rRD<\302g\030=\317\277\217<\343\271U=\361T\025=>\352\221=ok\340=\020\002\312\275\2347\376<\361\213`\275\351_\271\273_Y\270\275\010$\213\274\222\031\214\274q#\032=\300\241\361\275\242r\026\276u\023\364\2753,\010>\267\375\262\275W\245\264\276\231\247\031=\t\317#\276\222\334\211=9\312\251=\207\000\021>\023\232\377\275,\351\314<vS\r\274\347)Q\276\371\2465\276v\222K\275\257\'\222\275\"6\312=\251e#\275_\016r>\365B/>\334\256\t\275\rf\037>\372Q\177\276 ^<=\261\341\224\275\335tf<Zh\372\275l\010\212:X\377J=\330\035r\276\334\316\341\273\224#s=\331\256\203;=w\271<\252\302\216;\364[D\276\221\230s\275J\301\216>\223\177\261\275\304\354\006>\222\250\372\275\237\004\t\276u\341\345\275)W>\274\252o\t>Jn\210\274\260A\255=\264\310\215\275qb#\276\307\205\035=q\200\367\273\n\272\224=\300\273\342\275\212\217W\274-\266\303=\2615|<\013\267+\276Qk\t>\262\020E>\357\317j\275\325q\t>\367\037\253>\351\320\243\275M\326\242\273\35348<\357\014\275\275\372\351\021\276LCV\2744\0136\276!\365!>\007/\017>3\014-=\0266\267\276\310\322\354\275\206\255\2178\"\333\270=\231\263\346\275\264\246\026>\357\306\335=X \001>\206_,=\263\367\317=\372\002\307=\025\013h\275pZ\006\276Z\313\220>\266\014\227\275\271\277.\275\216TM\276\356\275\272=\330\372j\276\356\203 \276\r\211]>\275\366)\276(\300\226\276\214\006\212=\357\253[\274\3749\037\275\251\264\276=N^5=\231\034\226=K\243\250=&x\325\275=\321R=\335U\212>\336>x=\001\267G=\263\2269>v\246\010;\334b\n\276nZ\001>m\203S\276F\234\373\275o\237+\274\225\n-\275\300q=>\366\334,>.Q\002=O\003\301=\251#\256<\021\362\213\275\231a\n\276N\243Z\275\016\026\254\275\317)X>\305\227\350\275\233\205V\275\262\313d=e6D\276s|\215=Ay\000>\237\333T\276N\244h\275|\203\334=\223E\247\275y\322\353;\317{\227\275\265X\346\2756\220\321=\202\320\206\276\027S\342\274\200XL>\355\n\276\275\013\r\245<\004\326\037\276!\370\327\274\032%\204=\217\241\001>\210c=\275\262x\001=\2739\024\274_\324*=\266R3>^G\014>?\202\037\276\013\005\320\273\265\250\201=\237E\337\2756\021\177>\021\265|>\272\204\207=\260y\'>\001\202\210\275\246\274\246\274Z\332\202=\3063\034>\031dT=\003\223+\275\177\327\r\276o5\261<d\031\301=\306\000M\275b4\002\274}\025l=^o\026\276/VR\2766\006S<;\335\353\275F~_>j\263-\275S)Z>\214v\033<\375P\350=?s8\276\n\356\023\276\371\017!>,\023\242=\305$*\2763\216\"\275\362f\261=\254\301h=4\216M>\010\353\266=,\000]\275X\t\250>S\026@=?\256U>\224\310\226\274\330\0141=i\345\364\275\261B\201\275\376s\277=\255\3338\276-\265\365\275\333pA\275\226H\006\276\347|&\276\031\220\030>\034\325\310\275\265\353;>\006Ed\276\350G\206>\217;4=\346\331\312\275W\033\330=\302\323)>TMU=\023\375\227<\311\227\032\276\331\016\010\276\342?\352\274\360L\212\273\026N\213<\361Z\003<\337v\t\275}\260\007\276l\004\220\275a\013\236;\027\037\321=d\215\225\275\035@\241=\361\214{\275\214\237\023=\251\353R\276\337r\004\276\257\373\234\275E\354^=\225(&>kxB=\260\376\333=\362\227J> \232;>\346\226\255\276\361\201}\275\274%\206\275\025\022\301=\014\234\215<\274\346<>\261\026\333=#\251D>-cd>\235\322+\275\200O\032>.aV\275\272\341\033\276V\204\267\275>\322\314=\251\227\027\276Q\357\371\275l\345\357<P\236\';\301\340\030=\306\014j\274\336\335G\275\226\217J\276\004\001\216\276i\231\016\275tU$>a\010\034>\221\006\374=t\001\003\2767\322\215=\373\203\203=\212\372\371=\227\272.>\364\350\321>3\341|\276\017\236\331\275\350\214\246\275\354\024o\274\036\342\264\275\261\334@\275\006\322\351=\236v\264=\272\001D<\302\370\213=\022\271\225=1\326\213=vV\021\276`4\034\276\252B\261\275k\251\036>\024\036\357\275P\374\234\274\035\210\202=\000\234\332<\005\327G>\340{\237<\3603f>\367C\230\274l\222A\276.\025!\276\021zl<4\314\234=\251[\311=y\247p\275\271\273\201\275\353\231;\276\200\n\335\274\274\314\242=\210\207\025\276`M\362\274\244\177b\274\016\347c\275\324l$\275t>f>\200\376\r=p!x>MC\250=r#^>\337Hx=\002\353\305=\0174\240>\237y\226\275\330\352\351\275\235\207z\275\343\332V\275\3014\211=\362\010\304\273\373\306J\274\n\374q\276w\374\331=\203\303\t\2746\233\025>\r@s\275Z\007\362=\357{\026>g\374s<\250Q\226\275\227\021\251<yq\337\274\333\2577\276E\215%>]\340\202\275S\tc\276\260>-\276f3\233=w\274\240\276\356<\t\276\2514\256<\205\371\321= \r\206\274\023r\233=\n\020\366=\005\027\360<\016\266\212<S\330\300\275\215\226\231\276\014,U\275\323\260\276=\277\362\270=\225\014\206\275\342\016\010\275\315hq<\371\224\261=\333\214\013\276\371\200\023>s\267j>\332\035\024\276\251\'\224\275\010\025\355=\346K\234=\354\247\036\276\014`\032>\026!(>\003\210\375=q\215\325=\246Y\364\275\010Y\374;\336\031$\276_\217\263\276\036\265D\276\2420\267\275\362\203A\275\377\320\316\274\260\023\270;\016_\324\2758|\241<\300\371\034\276\206\007\344\275\r00\275\014\276\261\275\301\236\020\2769\351\222\276t\337_=\213\014\271;q\201\333\275\024\344\303\275\237\333\240\275\035\245\224>9\252\330\275\032\023C\274R+)>\224\271\272<6\357\r=-\367\r\276\\\337\035\276B\210\277\274\211,$=1\203\373\275x\253\020\275WxS\276\337\264\322\273\270,o>&<_=\221;\003><aD<\t\301\220\275\335|\331=\242SF>\231\327\243=\\\004\314<\326\275F\275wW!>G\017$\274\225t\036\276X\257==\376\277S<\261\\t=O\037\312\275\354\374\365\274\243\213\236;[  \2731\0164< x.>\212\304B\276\305;D>\245\014U>\256#H>\337/\237<p\010\006\276\216\230F\275\303\342&\275W\243\360=`#\257<\331\357\315\275\253\311\252<\031\032t\275K\305\333\275\010\005\235>\t\206\222=\313=\016\276\234\3411=\"\036\231<n.\333\275\212Tc9#9\360=\202X\026\276<{\374<i\2428<\211\275\256=\245A\244\276\212\372\371;nI\251\275\307U<\276\303vq>\211\352q>\333\230\"\275\342\204\345<_C\034\276:R?\276\2726$\276\323\327\004=Y\032\013\276\234\210O\2756\010\200\276\013\231R\275i\204w>+]\027\2768\372\274<\271h0=t\372\350<\260]2\276\266\376\023>\004\341\007>\t\200\036>\254\375\010\276\317,\n=\244\331\025\276\027c\010\276\341\351\236<\243\223\203=\276w\332\275\206X\242=Ly\265=\301\215w\274\235\335\274\274\322\230\001>\235\240k>;\025K>\036\346\001\275\000R\213=\355\211j>](\313\275Q\311Y>\321\270\017>\356\354\377\275\363Y\214\275Y]\t=\200\244\207=\364h\003\276+n_<\315\205\312=9\252\034\2749}\003=M\nT>\310\3137>\020\304\004>\3175\224\2759\331\221=a\343\354\275\242\217P>\224\305\016\276\\`\217\275\315\344\005>\031\333\253=\307%Z>+\3302:`}q\276M,{\274\214\020\322\275\323\335m=\373T\277=B\210\006>\367\323v\275\360.9>\362\325\362\275\310:\350=\341*\203<\nf\337;\347\2005=\220\024\365=\352\202\253\275|\2635>ne*\276\327=O>\006\272=\276\362\265\226=\010oS>M\n\274\273uQ\237\276\364\206+=\017\275\031>\245\215\"\275\037N\371={\375\254\275i\267\220=\024D\251\271\026&\277=M\217\206=\272\247\035=\031m%\275\303\371S\276\246\254\305\273H\345y\276\177f\363=\006/\205>\246\301\223\275c+]>7\260\301=]s\364\275\357\300\013\276\375\362;\275\235w\026>K\257l\276\252-\004>\220Q\321=`\333\266;G#\014\276\240\226\312\275\206\\\303\274\354\307\006\275#~\251=X\372\254\274\3701\260\275\032\253F\276\3347|\275\323\316\206\275+-_\275\325\207\257<\361\005\341\275\027\262\220\275\241\t\233\276\321N{<\024\221&>!\334}\274\326\364\037=\"\243\013>\223\306\344=$\342\315=\222_\267=\355\375\345=-O\210>\216\341<=\212 j=\326\013J\274\035\201a\276\023\241\010\275\332\213m>\001\007C\275\360\225\212=\256hH=y\310\343=}\306\222=0\325\000>\247\343}\276\242\000\237\275p\303!\276&\214J\275<\214p=eQl\274\266\033\017\275\316\302u>{h\r>t\353w\275\260\375\340\273.\362\254\275\300\3132>\330M\375\274\257\3141:`G\203\274\272\266\342\275oto\276+A\271\275D\263*>=2\353=\241\240\007\274;\200\340=u\347\320=\300\376P>\344\313\010\276\274\264\211\274\363\003\212\276\232\300\023>Z\216}<\232\315\277=\264|5\276ga\340\275=\005$\275\377\311\210\275)J^\275\331\201\326\275\356\024\255\275\3436\372\275/\034J>v\354\224\275\252\250^>\371\362\247=B\214\276\275\215\264\202\275\270\367\241\275\245\352\273\275\262_G>!\3610\276h\237\370\275=\034I>\341\037B\276\254\374\230>u\350\026=k]\252\275;\303{>\3431\037>6\315\\\275\370\212\336\275\n\033l\273\341\n%<\005\2617=\024\026\314<&\263\256\275Y\235\346;\330\275\034>\263Z\216>*\014\273=\034\307\235>uF<\276iZ\246=\rZ\017\276\242E&\276\024Rf=\361}L\276\260\363\001>7\001\016><dC>\233\341\310\275|\314\317=\274\213<\275)\006\034>\320\t\376<\262\350\020>\302\355:=EMb\276u\024\356\275l.\203>s\t$>Eg\332=\225\030/\276\342i\217= bz<\316#-=\232\341:\276\232\306\001\275F\000\215\275!\215b=W\201X\275Od\'\275t\034x\275\376\237\225=\036]C>\261/\375\275\357DB>NL\316=4\034V\276\275)\227=c\356\370=\t\232\027=O*\254=\016\230\020>y\326\271\275\"?]>\266\357\223=,\211\240\274<6u=\nj\324\272\340\360\n=\007\362\242\272^\362\344\274\326\025\273\275d=\212=\203\357\305\274"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
