node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9509435
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\242\2153=E\251\266\273\247e\037>\222\371Q=h\027\254=m\247C\275\273\323\370\274\271\253\035=\277m\256\275\214*\204;\373g\331=e/\237\272\365Y\024>\322\005\331\275\002\201&\276\'\242\237\276\300X\214\274h\021&>\037\361\316=\2650\345\274P\355\345=\t\254C\275\220\340\200=\013\370\252=6l\272<\006A\254\275j,\260\275\313\366\227\276\253\353I>\354\266\n=\237v\246=p\345e\273\310\264\247\276\231\242\274\275\373\220\031=\2506;\276P!\033\276\030Rt\274\360\373+\276\301\365\216\276\263x\237:{<\376\274\273\376\177>\273\231b\273+\277\334=~\267\320\274v\003\317\274F\274=>V\3523\275~(\020\273\032d\225\276\245s6=\255,\301\275\231}\000>\347\214\004\274\270>\030\276\\n\312\275X\235:>\341\214\022=a|\010\275\265|\">[TB<\2141\235=:\026D>I\337\341;F6\026\275W\317\004\275\340\313\260\2753\277\253\275 \033\035<\313\250c<7\301\025>{\316E>\303\244v\275\231\rY>\321U\362\275\030\030\223>\242H+>\314\333\334\274\275\032\204=S)\004\275\t\275@<\210\326n\275b\222\201\276\037\341c>\200\216\220\276\030\231\223>\200\243\332=\331\221T=,\232,>\007\244\357\275\201kg>o\331\372\275\305\304\210;\324\210\377\275y\233n=\250\372o=(\3360\276E=\237=m\362S\275+\315\313<;<\357\271\023f\362=CV\010>\3074r=$;$=\312\243B=\340/T\275r\355\200=\344~U\275SL\350=\2634\324=\022\275\360\274\361L\364\275\036-\243=\223/\314\274\322\243\004>\217N.\276\257\3118\276\234HO\276\242ZT\275\277\234K\276\301\250\313\275Y\226\231=-\316\036\276<\031\354\275\230\346\357<*!]>\324\356A\276e\233\373=\321_\350=\242\325\335=\220\344}>?W\303\276\276H_\275\344\354\357\274\361\317\"\276\237\036\232\275\237\026j>\241\036\336=Z\316S=8\007\373\275\033\361\013\276K\303\252\274\001\371E\275\276\234\305\275\364st=\030u\000<\364$\376\274\005\"\317<\203\350\211=pDa>\350Xx>\013\221B\275\333\034\214:\260\326\275\275\246\t\310=\022\036V>\370\351\001\276\374\215\340=L\021\\>w\355\272\275F\303:\276\225\024)\275(\0100\275m\377\236=Hg\037=\010\212\002<\227]<\276\207\r\025<\007\250\001\275x\363\267\2743b\010\276\303E\005\276\214\203\177=\332(6<\365\331E\276\254\353\262\275.Ga\272\241X\231<\367\0142\276\344\001n\274\215\262\024>\031\273\253\275\225\241\315\275\353Z\342\275\232G0\2765\330\242\276Fq2\274\312\362\205=\262@7>\205K\205<\340\034\203\276\017 \266\275)\335\246\275\356t\263\275\366WE<\021\266\255=Wda\276~\205\034=\342\256\245=\307\\\031>\210\2477\276\263\\\"=}\227`\275S\010(>0?\243\274z\323p\276Z\257R\275\367\375@=\220\276\221=\352\347\257=\023\240\257>W\320\243\274\323\0362>7p\236\275oIy<\021+\351\275\355nf>\233\030\007\273\332\360Z\2757\233\024\275\"\317\337=\276\027U>\235\331\033=Z\225\277=\347\214\307=B\302\330\274\340\321$\275\t\363\336\273\245\035\261<\277\214\262=\031\302e\276d\014\033\276<\240\003>y\0326\276_^4\275fA\017<:\202\'\275e\356\270\275\017z\036\276\310&\372\274\'\022`>*T\211<Bg\325=\255\376\'>}\311*;\264\251\202\275 V\356=\273\266\236\275A\2677>\363`\024>\nxm\275\'\200\361<EM\224\275\3010\001\276\243\236\273\274 \347X>o\251\t>\005\206\210=\177\036\242=\234\232\355\275\377N\262=\\3:\275\014%e>\337\315\210\275\006A\200\275\262\365\212=\207\365\223\276B\377\343\275\204\261\014\276\377R\026\276Z\032\212\275\354F\260\276\320\301\364\275n\234Y\273\305q\031>\376vl=Y\336\333<`[B>\310\312;\276\010\000\304\275\344\351\233=*\257\n\276\375J\3358\232\327:>A\332p\275K8\216\276\t\345N\276)r1>\202\000\341\2746\322+\275,8\271\275Ajb\275\355\'\030\275vP%=\324f1\273W\352\352\274\351\334\234<t\201\023>\222\250\305\275RV\257=\321!\203=\007\343\026<\235\005\314=\030\353\016\275e\257\035>\010\322\353\275}\0104\275MJ\233\275~)\177=\202\0002=1\226\357<x2\247=oE\212<-B\245=!\207\234>Q{2>%#\021=\363\245\026>\222\346\253\275\370.\204\275\231C_\276\246\237\352=\324@\214\276\2435]=\316\212&>\202\206)\275?\227\016=\244\3435=O|P\276\272E$\276@\001\022\273\353\337\251\275\322\177\372=x\270\r\276\242\361\265\275\246\206<>\247\227\337\275\352\263\004\276\311\230|=#\333D=g\300\317\275\261\223p<\016\351\210>\037\2547>G\241\252>\275\021\204=\033\267\026=\344Q\016=Ex\267=\330\2728\276\267\324\354=\306\001\276=\252\240\274<\247=\">\025\370\021\276\3102.\276U*\254\272V\363\024>o\307\014>h\\\251=\207\211U>P\305\270>J\375B<<\211L=\211\024\350\275\357\274\022>\223\371\247<-\r\233=\263\216\236=\266b\'>B\313\225\276&|\034\275\t7\000\2769z9>\003%J>\277C\351\2757\273\216\275\203\324x=\'\030\261=\207)\016\276\356\217\017>\320\214\005\276x,Y\276r\341|\275\266\026\233\274h\330+\276\364\242\300\274D\221\231>\221M\267=\350a\216;]6\362\275\021\017\330<\007\312\201=\315\366\321=\356\352\340=~X\276=:\014\207;&\366\016>\007\315\313=\370D\014>\225\311\257\275r\223\243\275\303\3307=\260v\355\275\355~\037\274\326\216\036\276i\222\355=\n\324\316\275<\tb\274\025\000\'\276t\221\305\275h\354\313\275\276\2057\274t\244n\275]&[\275\340\037g>\014a\311\274\214\266\332=I9\313>\265Gx>\203\001f\274\026\324\247\275\257G\301;\013 Q\275g-\027>-\3120\274\230\364\247>\014\220e=\270\232\345=B/Z\276\202\023\366<\314\277\210=\367AC\275`\306G\275I\321\345=l\335`\276=\332\006>M\311\250\275Y\030\352\275\250#p=\213\337\007\276c\245\002=\231\r\006>(\022\314\275\202=\251=9\365\010\276\353\036\006\276\321*\276<\364\r[>\311\312\335<\253\032!\275p\275k>\362\216\276=\322\317e\276\306\033\257\275e\330\320=C\024x<R2C>3]\031\276T\001\363\275\264\003>\274=\325\375\275(\250\237=Q\025%>\235\355\227=\351\324\244\275\332U\002\276\244 N=Y*\323\275\007\346\245\275/D\316\275\261P\313\275\303\2228=ykC\274\266\330\222<PF\237\275}\274\212\275\177\326\210\275t\026\374;y\375\036=\335\303\365\275\027\003!\274\371\022\036>\212\023\211=S\236\215=|O\n>\037\304\020=\267\003\220=p\'\016\275\203\304\356=\357\214\245=\017@\204\2754\263x<\031\277\n\276\211\367Y<j\000\026>\364\020\226=#e9\275H\265\200=\334+\311>\257\025D\276q\212\031>\023\205\356\273\027_1>\024Pl</\201\274\275\257\033\307\275\271\201\032>Q\343\221\274VM\267=\202,\237<W\226+>\242\000\221\275\241h\222>DZ\233=)\235\021>\307\034\324=\316\334n\276b\3144\275+\243\265=:\377\240;\275\357E\276Q\255W>C\340\023\276\252\253\334<\344wF\276\000\n\037\276\020Oi\275s\337M=\277\232D>Q\344\324\275\020\273\270\275\026,\211\276\252G\313=\t\356z=\030\032\254=\205.l<\224\265\024>!t+\276Y\3752:\001\201\036\276uq6>8\243\">\225\2311\276g\373\025<\250\334\306=\257\310N=\033\001\212=|/\356\275\314\271\032\276Z\354\236\274Aui>\021gG>\315\026V\275\312r9\274\262\"\226\275@\207\225:\016\336\332\274\\\367\017>M&.\276)\240\340\275T\341\337\275\257\3642\275):\010>Q\3650>v\004\375\275p\260\217\274\230\331\305\275>|\274=\265\371\026>\332L[=\264\204\004\276\235\\.\275\204\006\004>\210i\013>\376\t(\276\223\2253\275\357QN>\335\177\213=\334\211\254\275\322j\272=)\257%=\207v}>X\177>>\306X\336=\323G0\275\211@\205\276\1772H\2765\002\020\276\3754\256<\007\231\020>\215)V>\235\3260=B\201\";W\374\242=]$\212>\234\275\n=\210\214D\275L\016\r>\340z+\275RW\263\2742^c\274~\307\013>\362\203J>H[*>\235:\244\274\3561~>\351iD=\033\3705\276\322\201\210>E\022\211\275>*\236\275\375\353\361<\324\2534\274\237\303_\276\255\307\304=\306\341\357\275\275\246E=\323\247\013>-\035\010\275\356-\233\275Z{\267\275?\234\320=\236\210d<X&Y>i\264K=\377\\\250=+\234#\276\304c\376;\236\351\211\276/<\250\275\262qG=3\211\000>\377e/>\023:_\2767_\306=\262+~\275\375\254s=\003\304\324=_\245\365<\340\250@\276\237C\224>\240+\245\274\n\256\305\275^{,>\013\345\217\275\302\300\351\275\374\240\030=M\264\265\275l+\315=\255\207\230\275$\255]\275\035P\355=\225\357\005\276\254\016[\276\001\261\306=\206\342\372\273\016\002&\276\245\246\026>\235\210\242;W\341\347=\253\351\272=K\200\310\2757N\345\274 &\034>\027\365\034\276\376w\034\276$\2231>\333\365\t\276N\017\340=\357\"9=\205,\330=\2028\323=\262\334\316<\374\354+>hY\372<X\246n>\376\006\016\275\020\022\222=*O\275=0Tw=\320\313\337\275\3042\264=q7F>\241~*\276\033|\030>\016\206\235=>\021\030\276 A*\275KC\017>\372l\006>k4\245\275@|\370<Z\265\262\274\036\255v\276Y\014\275=-\n3>\373\265G>Z\000u\273\312\366k>l\254\000>2\342)\276!\215]\275l\345$\274X\005\034>;\351\001>2\373\360<I\342+\274\275\217j\276\314\366\006>\247c\023>\017<&\276\001\354\301=\311\251#\276\217\2014\275L~\237=ABR=T \211>l\252/\275j!\346=Z#Y>\334\262o=\363+\366\275\274\213\320\275\010\306\357\275M\375\274=\360wM>D\021\001>\274\004g;\323\222\373\273\350\331\361=Y\333\002>\210\344}=1\325\004=\355AT\276\014+x=\004\244\177>5\275\224\275j\317\265\2740kn\276\225\2648>\026\330\203>T\317b\275}cm>L\272\230=\330s\237<\310SY;z\326\371\274Z\272\272=\242\313\312=\326\305\034\275\007\256*=[\265\227\275\030\341\273=\236#:\276!C\202=\267\243\246<\177x\303\275gs\355=A|\021>\345\3333>\007\222E>\246\0143= \261O>K\300?\275\262\023 \276,\262\212=\376\233k\274\200\210\240>\361\"\036\275j\337\027=\223A\026\276h5)\276\252\275\025\276\330\200\247\275\362\334\327\275\252\225\372\275<\310\221\275\220\340\246=\261\240d\275\276c\025>\005\236_\276\203\352\035>\326K\340\275\314\343\000\275\0139\026\275C\323\245\275d\331\034=\037\000\264\275\351\007\363<R\335\276\275fu\235>\276\232U\276\223r\262\2751\'\323\274\223\366\266\274cS)\276l\013\242>\t{&>Jc:\276\360\321=>EnV=\271\346A=nb\032\275\215\023\231\275\200\221\031>\263\201\315<e\204\220=2?\337\275\217\360\330>o\234\013=F\220/>\266\362\246\271\365\263\201\274\334\002\t\275\016\370E>\273\336A<\333W9=\006\323!\275\033u\367\273\324|\353\275\227<\245\274\212\211\007>\271\305\353\275\204\377d=\376\340\211=\005\276*\276\023S<>\025R1<c\252\215=\262\332\r\275u8\350=\004\245\353\275_d\302=X\267(\275\307\223\323\274\031\341v\275\216\334\036\276M\2563\276\300\370\263=\270nE>\264\200\214\276Z\023&\276\375w<\276\036\277\021>\277.B=r\3735\275\265Z,\275*\026\024=\255Lb=\333\332\277\275@v\324=\306\333J=\207}z\275\0369\261\274^x\007\276\277\020]>\342#\225\276|2\260\275\313\335d\275\027\310U\275S>+\276\234\226b\276\'\220\201\276\377\201\353\274(\267\223<\322H\004\275\351\375\305=]E\'\276\003sA;\335m\361\274\341,\225<\227\365\326\275\252\271\023>k|\211\274<b\227\274\326\267\235<\200\225q\276}\217>\276\211\336\310=mf*\276Y\277\213\275\004\017\351\275\361\224\007\275\267O\032>\2506\333\275\315K7\276\256dd<\247\334\330<\312.7=\343\376O=\'\354\"\275 zJ>;\206\336\275zL\212\275R\024i>\371\2041\273?\2360\276\232\272\376=\000\326J>C\363\326=\2122\035\276r[+\276\244\317\321<\202>j\275\273\361\340\274[\355\010<\333qe>r\261\026=\313~\005\276\334\244\246=\\\363\345\2750\005\225\275\331r\031\276\024\350\216\275\370\321\031\276\207\373%\275m\365\336=\237\306\235\275\245\177B\275M\252%>5l\370\275K\373B\276J\226\335\274qY\272=\302_Q=?/\024=\3613\010\276\235\027\245\276\306\rf\276~CA<`\275%\275\345\215\256=0[\t=\315|\330=\260L\332\2756\262z>\304\t\276<\353?u>\t\341\254<7\'\275=\266\325?\275!\201\324;\214\221:\274\327\347\231=%i\214\275G\023\271\275\241\361\204\276\303\"I\276\211\313\002>\341\027\354\275A\236\001>\267\344\203\276\252\376$>\275\2531\275\331\007\260\275-\027\005\276\370\257\306<a\340A>\276^\216=\330c\205;H\363\311\274\2215\214\276\032o\315\275<\235\240\275K[\254\275Z\340.>/b\230=\001\256\306\275^\000!>\031\177c\275\341!\023\275\256^\334\273\207\223\024\276\226\213\274\275pg3>c\340\306=\'\202&<\3574\210=<u\351=\001\007\'\275as\216\276\334\361\023\276\010U\227=\347\266B\275r.\226<O\261\216=_;b<\014;!\274>\206\022>\036 \"<I\005=\2734o-=\361\375\020\276\333 \235=\252\030M\276\374\224\234\276\253\254\242=U\2035\276\2372^\276M\007\260\274j\022\307=\036J \274\007\262\013\276\034\336\003>X\261\006\276\227Cz=u`\013=\177o\035>\272\014\275\275\272W*>\215\253\311=\225\363\223\276\225\001x<v;\206\275K\000N\274,\372\223>>\375\332=c\373$\276\205Zg>\360\020\361\273\266Q\306=P;\003\273\303\2254\276t2\300\274uK\327\274T\305S=\373\352\225=\370\337[=\254\230W\274)%C<\242\220\017\276\261\202\005\276\220\230\375;F\227J\274J\310\017>\215d\025\275_\025\016>\347R~\276G\343\003>\226y,\275\2325\212=6\266->\374\317\027\276\356\330}\275q9\374=\367K\303=\306\310\216=Bl&>\234\217)\275\004\204*=;xH=Z\007t\276\320\217\013>\037w\226\273\212D\201\275/8\216>\\A\223=\\|\372=\234/\025>I\255\301\275\243\365f=\211V\003=\013|O=\270\341\201=\340K\362;o\342\271\274c\231Z>\265\332p\276\327\222\214\276\313\034Q>ZO\314=M\3404\276\026\201a\2752\372\373\275\000\224\212=\341-\201>\237\357,\276\371\237*>E\023\213\276B\346\330\275\370\306\230\275\234\347Y\275U\361\306=T\323K\275V\022/=\333>\200\275F\347\362<?\255\207\274\331%\026\276P\031\377<O\371\361=\t\351\002\276\231Ve<.\235\000=\211\304\350=am\316<Q\010\004\275\"\273r\274$~r=\256S=;\313^\302\275%\233\233\275\351m\315=\000\230U\276>w\256\275\034\037\344<\205\363b<|\2225\274\t\337\232<n\211\030\276nf\221\275-\006\026\276\311GJ>\031\327\313<>\217\006>\376\347\242\2747BU=\306\035\235=\250b\247=\335x\215\273/\267\213<\345\035#\276\0236\237>\336Z\310>^g\266\275\310\204\035>\373\367B\275\277\214\226\274\312\035\212\275\357\177\242\276\003O\213=\372\366#<\233\253y\274\273\361S>\216\353\270\2751\366v>\022{{\276Q\214\257<`\204\221;`\\1\276\350\216\243\274\345\"\217>-\374\020\276hE\216=oD\240\275\316,Z\276N\241\235<[\334U>U\367\273=x\216o\276\372\376\203\275\350\342\204=\030\262\324=Z\213R=Vm\240\275\306\361\203=\034<\037\276\203`\\>h\230\001\276\026\312\020\274\210\001\255\274\377}\013=\300\347\221=\260\245\341\275+\3367>\255T\227;\t\342u\275nB\330=\307\314y\275\014Y\303\275\270N\022>\310\276h<\221lx\276\362\000\313=a\0056\275>\t\210\274R\373!\276\214O\272=W1\022>)\226\303=\027\353 =\t.\205\275\265\273\246\275\300\316k=&(\262\276\033,\362\275\266\374\373\275\227v\342\275\245\2477<\307\335\273=q\3004=\357Y\372\275\324\\\n\276M\224\262\274Z\257\254\276<J\277=y\220\326\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
