node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 4949313
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\275\346\376\275\236m\213\275\265\237k\275\333v\226>]\250\216\275\344QX=\222Io\276\036gl\275T\014\035=\256~\232\276\207\231\r=\212\207\215\275\352\376\247\274\350Z\213>-\334\367<\316\353\230\275\371\007\340=\200\315\245\275-\321\035\275$\214\325\274\n\2170\276\301\205\221\275\256\235\243=-\035[\274\2237G>Z\243\253\275\331\201\035>\352\251\367\272*\310\254=\367\310\211>\305#U=M\254\310\275\016\035\021\276\243\275\256\275\373L\257=\030\266\337=\004\256\033\276\331\205\346=\271\260\026=\3718J>\257b\374=\377\230\222\276\t\243\037>\377>#>y\002?\275\362\357\206<\201)>\275-T\351=\027WA\275a\275\263<\025\010\237=\327B4>\271\010\276=f\030\214=\312\311*\273\263aZ\276\032\342\004\276\262\315\034=\211\255\337<s2\t>\314\233\241\274\2137|>\235~\233=\314Bt>\310\236i=~\332\221\275\345}o>\217\243\025>(\\\001>\000\371(\276\200\013/=\267\244\241\275\251\371\247=\346\231\254\275M\2256\276\321z\311=\242y\250\275)\234\250\275\227\t\221\274\230G\256=\001\3134\276\022\206\307\274\205\263\377;\223\037\262\274-\253?\276\253\363\202\276cE\203\275\354\2777\276\215\002J\275\337I\305\274\3657\222\276*\257\373\274I\261H\273^\226\237\275\356J\245\275\217k\211>\231\310\264\272\331sI>\n\230D\276\223\235\235\2756L{=Bq?=A\031\211=\307\317\263\2744[\277=\020\261\\\274\271uL>\263l\006\276\372\253W=\037/\212=%\330\214>\256g\374=\377\300\274=y\235e<\205z5\276\202U\324=r%+:\262\246\033\275(\026U\274\245~\001\276\241H\227>\3365B\274X^\335\274\377\363\343\275/I\014\276\2239\347\2755\230\313<\317\335%\274\213\300\024>^\220\017=\223\316\273\275Nt\262=\304\000<>V\010M;@\344%\276\364\305\232>\032\252\r>\033\221g<\301|$;\013\217\301\275\322,?=\203\017@<\007o\310\275@$ \275dP\202<\255\320\031<\373zq\2766:\307\275_\202\222<\263\303\030\276i\021\265\275\022\261\242\2744\033\311\2746\033a\275\336w(\274R?\024\276\024!\203\276\227!\023>5i\332\274(\n#>\035=\246\273\264$\366=\351\320T\275\262gc>\273`\017\276L\021\3029\313\346J\276\030\325Y\274?\347\223<\2274\001\275j\016\243\274[\223_>G\320\313<k\"\356\275$:\256=m\332\373\275\222\303\330\276f\316{<~\300\326\275ig\337\274\227K\325<\341\311i\275n\312K\275\251\215\332=\317-\231\275\376\321A\276\177\013\264\275\033v3=\361d\234\272\032j}>(\'\362\275\254\206\237\275\213dG\2766\347v>2\303\017>H6\221\275\237\316\215=\352\200j=\243!\376\275F~\210<w\352\241\273\321\357&\276\331 \331\275\300\247\272<\242\222\255=\212\331\034>\027e\203\275.\034\030>\213\233\034\276\206D-\275\230\rY\276L\365w\2759\n\364=\212K\025\276*\002\3009\001K\251\2764Y\241=\313b\026>\305\262\202\275\273Z\372\274\027\001`>\212\334\350\273\315\256[<;\004\243=D\361\210<\325\025\034\276Z\\\027\275\207Q\007=\034\006o=\376\0019>\362j\232=?\221\003>\317\371\215\275\303\004K>\213-\252\276^S\016>W5\265=?\\O\275;^\247\275{\340.\276\232\343\007\276R.4\275~\344 >M\346\007\274\312l\037=~\374\213\275\336\301\034>\272q\307=\372\2063\274\366\344P>2H\014> ]\311<\364\213\375=\363\273\312>e\036(\276\340/\355<\016)\314\275\\v\010<\356K\334\275\266\342$\275\000|\n=\351\322c\275\220\201\275>*\351\031=!\000Z\276\203\001\317\273@\004\240\275S=\312\275\232\251\001=\020\0071>(i\326\274\223d7\275\222\341\373\274\320\254d=\233a\376\275\260\267T\2756sa=\326\243\324\274\013\233\017>b\025\257=u\242\020\275\224\356\306=\324\245\240=\035\351\236\275U?&\275\342\273\243\275H\255\245\276\225\005\320\275\013,\221>s\3643\275|~\250\274\304a \276U\035\373<T\214-=\377\027\035\276\255\220\235\275\265\300L\275i\346F=\305P\031>n\233/>\204\236\257<D\333\245=E\217\302\2750\3372>\351\351\222\276P56>\003\304|=\275\025Y=L{J\275b\3319=\022\312o\275\3358\032\276\302\301\363=\326b\367=\274\343y\274j\307\320<G\264\350<\0206O=\231\232\310\275q\023\244=\333\345\032\276\354t\244=n\222\300\275g\330\013=y\341\244=\260M\200=\351]\310<Q\016\314=\344\327\004\276\222\002>\276a\200K>\'\252\207\275\215\320\210\276\211\226t>\274\3479<\226\275\224;H\036\010=-\323d=o\213\003\275\031.\355=#\021\204\276\n\371\326\273\364/\206\275\3330\222\276o|\372=e[\200\275\302\000\350\2755\375G=\260\024{\274\202F>\276\353Q\202<\276\032\021=$\343\271=\317\241m\276;l\227\276Z\267\334<\036lM=\030\342\330=\323w|\2764\007^\275\226\377\215\275\231\203\016>2\354\201\275\205\0229\276\363s\355\275;\314\377=@\364\317=b\267\226=\375$\016\276\243\237\276<\031S\204\275^\035\270<v\036G>\316Q\n>\374f\210<\311\215O\275\376\270\315\275\345*\177<\013\006\221\276\237\355$=\024\005\014=\3463\r>\347\2506=\220\014\266\272\373\003\311=\247\274\234\275\254\214\355\275d\303V=\345V\354=\237\226d\275k\221\010\276\034\265\364\275PEl>\3355\001>K\263\005>\255\311u\275\335M\001=\266QJ\276I\037\326\275\320\003:\276\036h\362<z-\220\276s\007&>\325\277\017;\340\322\231\276\227LS>\336&\316\274\254\350~\276y\247o\276\003o*=\333+\301=\222g^>\300\270\264\275\310\354\213\275\006n\027\275\246\213J\2747\365N=J \322<p\270\377\273\275\014\326=\305fN\273\200w}=\234\363\r\272\206I)\274\r\323\376\275\356 \215=\221{4<}\222\022=\325\347\014\275@Z\202=\366V\313\271\223-\242\274*\3218=O`\236\275t\3515>\013\261Y<H\262Q\274m\360\334\275]=\323<\222\030\307\275\314\331\215\275\2742y=\300\026\376\275\033\004\352=\002\314\025\276e\225\226\276\264\234$\273\360u\225>\202N\203\276iT\205>\203kL\275V\022\244\274\206(\273\275h\221n;\335\256\351\275Z\3449\275r%s\274c?7\275\355\235\017>\203\211e\276\377\023\366\274\200\315`=\346\020\316\275\356q5>\013\313 >\033 \315=\035=V\276{\303\334\275\264\233\016>\301+|\276\376$\017\274\261\007\232>\223\325\366\273\222FV>\246\320H>\305\325\026\275\273>\315=\311KK>\355\t\304<\247M\223\275\017\354\243\272!\234\253=?\315\350=\010\320\230:\020\263\023>#{\000>SB\031\275,s\242\276\332\003z<?\214\214\275\227\274\212\275o\005R\276(U\203\275\230\033\274\274\373D]\276P\300\210\275\272&\215=\207!v\275\327\272\275\275/A_\275\251\240g\275\024\335>\276\3648j>\215\275\332=e\316\016\276\212\227->3\003\\\276\256\010\030=\224\373^\276.\347\271\274V\233\022>\245\211\225\274\004f\350=BS\270\274\303\n\024\275\'\306-<T\241.\276\263\263\014=\347\234\343=\366\370=\274FO\234=;w|>\311\207\242=\\\331\325<\252\264><\"\251\356<\363L\323<sht=\0140\226\276\'S\330\274<\312\002\276\023\301\234>\225m\353;.\310,\276\346\327p\275\tc\327=P\002T>\345\305X=\225\223\354=\236\220\347=K\326\007\276C\357,\276\365\344:\276a\013W\276zP\026\274h1\006>\314QZ\275\371\234(\276\367+\374=t\265\033=\252g\\>\273\352\210>g\377\216<\327p\271<\\\r\374\275)\2550\276h!\320\275\264\2055=\352a\247=\223;\210=\337\250\321\275a\356\350:\363\033\266\275W\250\347\274\313\351\030\275\251_;\276\266\327\271:(\354\207\275g\322?\275\013\001\367=\007\350\377\2741$)=-\001\357\275z\360g<q\202\261<-7\203\276\333v\302=\335w\267=\264\306\017>\332\243\260=\227\201#>\357\312\323<\r\340E\275{\3039\276\220\313\331\274\017\001]\276a\332X< \307\\\275|\274\016\275\020C\246=\026\001\242>Y|7>\351P\277=\036\310\200\276.\256\033>\007b\207>\000\346P\274\032\351o\274w\221\200\275\270\356K=,58=s\300k\275\357\0073\274\006\277\333\2759\355`>\315Y\235\275\315\341\351\273F\326\244\273\306\273X>\035n\203\276\001N\234=*\276_>\374a\024>\030\363\213=\331\036a>\r&\366<:\3320>\200\\:>\211\3348\276\277;g>l\206\301\275\360m\203\276\322\016<\276\037>\234\275\237`\017\276\"4\202<\353\345\215\275\242`.>\334y\000\276p\222L<\201D\231=\031O\330\275VX\226\275\222\237\"=\027\253l>\005\322\021>\036ED\274\205\202\352\274*m@>x\211v\274\270\363I\276\307\025\326=)\025+>a\342f\275\354v\217<\277\031\270=C\207\270\275/\237\031\276\205\036(=V\035/>\354\306O\274U\207!\275\036\2509\276)\245\007\274\306\247\254\275*\324f\275\255Q\014<4J\302\275\304\313^=\227=\007\276B\005\\\275\255\247^\276\037ZE>W\023\202=y\247k>l\323f=\373O\366;\'>\257\274\343\026v=E\023c\274\266\355E=\3626G=\366AJ=XW\241=Cw%=\231Y7>\377\212\177<\025\r\266\274A\200\017\276yA\351\275w\345\001\2766#y>x\200Z\276\316\2364\276\260A\362;icJ<\"\304a\275\252\261\215=\232\023\243;\036\263A\276\276J\032\276Y\014\377\275F\234\004>?:z\274\016\276\305\275\316\343\025\276pH\270=\331+\r\274\302\370\222\275WR\260>]\213\212\274\323\275\\</?\353=se!\276\313\250v>\002t\205>F\213\325\273\365\"u=$\332\334\275\334\231j\275\324\370\330\274R\232i<\302I`>%M[>F\340\001>1e\365=\256=\277=tU\271=\205\241\211=\333y >\323\001\007\276\252\252^\275lW*>\310\024\342=\360c\325\275\022\241\233=\203\031\t>\266;\225\275H\216_\276\330^Q=\023G\215\276\203\200\230\274\337\357\274\275)\224}\276_\335\314=\t5)=\250\006I\275N\222\037\276\206:\321\275Vz\265>6@\227>}\373\031\275\320iv\2744\014&<\222\326S\275%\3168\276\346]\335\275\346\266\273<z\335\255\275\240\001P\274\356\254<\275G\375Y=o\021\254\275\311\036\004=\352V\235<Y\326\\\275qX\302\275\nL6>ff\214=<\026\020>\177\236\214\274X#I\276\216#&>J-\033\275\273:&>\315\361\260\275\273\030O\276~K\212\274FL\223<\022\262\227>r.\270\275\272\330\351\274b\2439=\247\343\314\275E\335\002>\335\271\205<t\177w\275B\005\003\276/h\214=\356e\333=\223\203z\275;\205M\275\252\337\271\275Wn\200>\276\367\003\275R3\260=\223\225M\275\327\263\026>\373\"<\275|\037\307\275\241\263h\275\213h\016>>Q\263\275\365>\303\273\250\317\213=`t\004>t\275\263\275\255\353\037>_RG=0v\215;\037\317\202=\213\241+>:\301\020>_\365\205\275\321;>\276\211\023l>;\220S\276p\321\276=\240\'Q\274\2107d;\201\203\342=\254 \300>\345>\031\275\315[\214\2761 \235\274\000\n\\\275\236\304x\275\000MH\276m\037\250=\341\t\210\273\276g2<(\3773\275I+\341=\362\360\365=\334\307\316=\263$\350=E\020\376\275UX\205\275\253?\"\276\371\315:\276l\374\277>\310\347\204\275\037]\204\274\251\226\207\275\362\253e\275\017\245\221=\3435\036\275\307/\017\276\212\232\210\273\363\370\247\275\027-h\275\2703K\276D.\334\275\212\317f\274\033\367\'\275\330\377\205=r\332l=\233\000\020>\332\273\310=\303\215M>\021\3426>\357\001\375=C\200\031\275@\263(\276\326\355^=\250U\244;\237\3714\276P\251\t>,\036\227=\013t%=\030\030\252\275N\325\266\275}b$>(9!>\266\264R>l\325\240<?\205+\276\n\344\013\276\030\373\033>\263/O\276\260\341B>\203\010\037=>\323\214\276\375!\212\275y\356\233\275\034\010\006>\002\306y<Lc\'>GtA\275\310\326\026\275.k\223=\254q\257<\236c,>\024\374\260=g\214\236=\343\322\214>+\366\231\274\034);\275\017.w=\301\2101>\016\316\032\276\334\367j>\033-\016\276\033\351.>\327NG\275|.\037=!\353\347=t\013\034>\367\351\307\275Q3\275=\345P\206\275o\030\201=\036L\310>\263\014\244=\245\361\001>\315\035\370=(\003B\276\013(\215<u\030J=~\003B\275\324\014\350\275\351\264\301=\252D\301=x\203\235<V\344I<\232;^\275\361\372\225\276\301\030\354<\246{P=v\360\265=\223\r;\276\321I\037\274%V\302\274\377w\224\275D\027\307=\305\306\353\274,\361r=\204>\374=}\030(=\316\374\246\275\024\351\275\274\374\361\367<\332\224\202\276\202im>\230\023\247\272\314\217\376\275s\025\030\276b\231\032=\035\275H\275E:/\276v\316/>\247\363\232=I)\317\274\267_B>\326\210h\276\370.\303<\360\241\266\275\274\313!\273\177P\240\275\365\201\230\275{0\026\276\231\025:\276B\213\202=\010\347\333<\214\325\243\275u9\237>\nu.\276\204\262/\273r$\261=:G\016\276\022\234\235\275K\037@\275\201\213\314\274JT\352\275\256\262M<N\233\220;%Y\002>4\330\331=$l\217\276\205\301#\275[\3412<\366\221\335<\022i\323\275\267\035\036>\201O\225\276_\0325>\217\030)=F\346N>u*K<l~\020=\036\330\265;P\374\254=\214z\n\276\354\220\371\275\253@V=\037v\207\274\234\346\375=\016N[>H\320\203\2758\264\010=\'\374\005=\265\240\264>\213\215\243=#\0314>7\317\216=\034cN>\247\261\017>\304\321\234>\305\3272>\275\237\315=\343H\227=nt\244=b\035q\274\323\247U>\030\306-\276|-p=\262\365\244=&\323\027\275\224\264|=\240O\263;\0317\000\276\365\022\361=\023\241\021>_C\024=\272\360\300\274\020\275\325\274\001\207\037>\306\260\037\276eg7\275\224\324\037<\333\206\"\275\346\307\374\275\361\'\013\276\014\"V\276v\020N>\311F\223=\334\372\203>\265\357*>\203X\377\275c\031x\275-\036\331<\224\354\226\276R\203\312\275\245\353\200\275\325#\030\275\312\376\004\276H \226=\177\224:=8\206\233=R!$\276qI\022\274\224\247\236=\372\222\343\275\264O\016\276\rc,=\375)\024=\271Vj\275\343\256c<=\251\252\273)%!=\240\014\003>\200s\232\276\312N\t\2760-\027>\366\267V\276\240\240\274=\315\273^<dN\325\275\022 \240<n\316\016\275\262\263\025>\312U\200;\351\302\204\275\250KZ>\206\305\030>r\320\242\274*\027\177\276\337\352\275<et<\276\'\371e>A\2611>\037\007j\275\363\277R=\032\310\017\275\371\351\366\275\306\346\020\273\324\233+\276[\005\241\275r`\304=\2441\306\275;\022/>_Ux=>\310\t=\3376\020>YC`\275\243\014\274>\271\225\'8\346\004\276=\273\376R\274})\246=_^->%?\344=\373=\213\275\350_\373\274\356\370\311\275dt\317\275\0278<=\211\205,>\206q\201\275 C\244=,\316\r\276r\n\360\274\263\221\353\275\247\236\r>\323\332\227=\303~\316;\321\0355\276:\224\025\2766-\337=\335\201\226=\343\217\177\275]\314\330\275n`I>\370\002\016\276>\324L>\223\033)>\334\325%=Y\244\000\276=\306\224\275\335\245\241=\r\\\337<\367\212\251\275\001<H\276\0257F=x\235\265=\356\273!\276 (\205\276\252\267\346<I\277\206=\2116\316\2758\026w\276\237\216\203=\327\234\312=\213o\324<\220\276q=8c\347=\257\304\214=\307>\231\276\304\002,>e\271\347\275Kt\246\274oR0\276Y\r\325=\213z\277\275\255\005\363;\266^<\276\216D\003=\037\031$>\007\225\256\275_\003\004\275[A\362\275W\273\005>\321\212\355\274\007\351\345\274\016g\276\275\241\031\243\276F\ny>\365;\200\276]\302g\276\301\321\t>Q\205\362\275pu\215=\361j1=\\>\206>o\212\354\274\221\2711>R*}\275F\276H>N0\347=\326\034\327=b\207*=\234T\362=s8\037\276\246\006\220=\252\253\t\276}B\263=\377\233\234\271F\342\235\275\032\356\214\276\247\3315>\331,\017\275\2454\276=\036\r\r\276\265~e\275\032C\235\274\251\003\n=K\322\020>\021P\320\2755c]=a\272\254\275i\301Y=\222=\033>qM\233\275\353\373v=\344}\225=\201}\332=)\000,\276\367\367\027\276\220&\315<\357~\310<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
