node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 9795655
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\016\017\014=\244\347\254>\026\312n\276\016\303\261\275d\331T>\340\303\242\275\215}\376\2758\244\243=\324\033(\276\345\350\202\276,d\014>k6\003\275K;\251\275\301\022\224;G\2454>\262\254]\276u@\221=\221c\231=L\247\020>\262\233\276<)R\342\275=\370\351<\270.I; \235|=Mg\354=\275\212\326=\221\357Y\276\372\275\224\275\214t\371\275\'P\373<\204\340\264\275B\':<\321\203\006<\205\266\214=\361H\361=\221\357_<\343\340><5\377\"\275K=\n>\354\246\262\274^\022\277=9gx\275\213\007&\276\t\251\335=\264N\222\275D\037\237\276\017[\007\276g\237\036\275s\210\372\275T\374X=2\343\263=\213\350\260\274\342\010\265\275o\3753\276@\351/=\302k2\273\267\303%=\217\236\224\274L\271\202\276\242\206\201\276W&\315\276\345]\312\275\322?8\275S\267E>\2351J>5\025,\274\3617\316;\241\266\301=\277J\253\275\006=\341<}\007<\276\215\021\347\275\'4\253=\214\231\251=):>>\213\207}\275E\231\231\274\306\343\305\274\005p7\276\330\362\270\272\\v\001\276\365%4>\365\210\031\276\253O\203\275\275\347\341\275\030Y\266>_;\201\274\357X\325=Y\251[>\215\013\t>\363\254\207<\216\372\316\275\241\311v\275\211QT\274yG\220<\202!k\276\311\265;\276\364/\031\275r\333\003\275U\271u\275\266\275\r\276\332\322\"\275e\256r=I\205\220=\242\242R\275\300Q\225\275)\243\267:\215i\002>\023!\026>\251U\037>\036\320\007>\010\004\220\275\377\276d=\002\217\325\274\223\323\242\275\211\002\260\275\r\347<\276\212\035?>_\215\021\274\001\326\204\274\250\247,\276uv<\275\370\010\264\275U]\'=\350\2335>\317s\300\275\270\277\265=\2366\265=\367\201\254>\356(\n\276_\212\330=`z\216<\210Y~\275\250(\356=aVi\275_aE\275w\234\035\276*g\355\275\2205$>\001\022:\274\027\302\203=\203\034\343\272~o@\276\256\1777>\203\010|=\260~\320\274X\\\000<\013\214X=\326\034<\275\256\234T=\311$\207=\243\227\375=\324\306\177=f\226\235\274Y\217\034>\212\375\024\273~\\\242\275D\242/=\r0\262=\374V\202>\353\225\263=\313\325F=\246\302\215>\252#\302=\346N\237>\254\020\026\276\242\260\035\276\n\346\370<\270\266\005>l\320O\276 m\324=\223\372p=\231\212Z\275\357\252\232\275\220\225\331\275\022\234\027\276\251Vq>\005\212\327\274)5J>\237\361\375=K\313\r\275\007s\250=>\r\277\2752\301@>\013F\236\274\361;\026\276\251t\315=\\%\271\275c\321\013=Y\275\255\275n\314\304\275\035\316!\276\257.2\276\235m#\276%9\271=\3015:\276\233\304\000=\372\253\241<Q\340\\\276F\236\254<\310\272F\276d\234b=n\246\273;#\3309=\351\316\307=\016\033,\276\035\006^\276\206kM>\272!B\276\212\251\253\273\355F}=\211=8\2762-\371\275c\352\\=\027\272\014\276\324\007W\276N\212\320=\344\232k=\001\234\223\276\n\247\\=\331\375.=]Z\004>\000\343\237; \357\347\275pk\375=\"\353\005>I\356\017>AD]\276\360\376\254\275\225\200\331\275\203\250\003>29\266=\233\221a\2769QN>\257\373\034;\201\367#<\202\373\337=wh\236=J\026\330=1\335\267\275\377~\206\275*\002\010>\310\313\374\273\377\341\237<\202\226\216=$\347\352=\326\246\022\274\250\357C\276o\027#\2758_\002=^eG\274\000\004k\274\230\010\202=\371\017\225\276\036\232\303\274\035C\006>|\225\016\276\006\223\205\276?\343\266=\374\367\332=\007\347U\276!>\202\273\032\002\r\275\210^\365\274\035\352q\2759\003&>\220\226\366=4v\251\275\202\214\202\275[\270\204\2760u|\275e\001\210\276\356\324\221\275\004\000\275\275\033\312\220=&\262P=\036\324\201\274\354l\274\274\377\035I=\304\264\371=\345\256\242\275Amo> \033?>\016v\237\275\265^F\276\354\020\215=m\353\000\276\241m\023\276\365\366\335\275aB=\276\367\374\330\275\263^*\274\014Og>\314\2143\276L)\372\275\005\270\230\275\013|\267=\203\002E=_ \252=\003\351\204\276\227\364\t>\034\314\000>\277V\270\275\340\n\014\276\342\207G\276s\257\000\276\232t\206<\265\037z=\004\311*\276N%:>\213\337#=\201Z!\276/DJ>\346\357\343=~\202N\275\215\037\260;\215\026\375<(\252\232\275\261`\216\2758K.\276\260\342\372\275\010\024\024=r\016\202\276\024?\227>N\212>>\373J\266=\227\273\236=\372\230]>\306\275\t>\341Q\227\275\017b\353\275\003p\034\276\354\221\304=\226\214\274=T\202\003\276\274.\263\275bZ\225\275;\021\270\275\364\307\233\274\027~)>\303\364\270=\227\036\341=Q\346\"\275\020\026\214\275\271\332\221\274\257\303\335=HE\233=oJ\n>\362w&>\241,\243=\241\360\016<\221\034\253\274K\247\211=n\344\"\276\271\027e>iDc\275T~\200>`tK\276\030\305\270\275A8|=\204\r\317=\0327\026=\253\007\352\275\342\370\001=\377\267\'>\023\245->\017\027\210\274Z\372\244\2737\255\313=\255\245#<l\314t<x:\222\275v\224\352\274\372rC>e\033\251<\350L\275=\003_l\275J\335\020>r\303~\274w\307\322\275\272\376^>/\265_\276\336\220T\276wF\000>;t\010\276S\245\337\2752\017,\276\303\376\t\274\257A\201=\277\260\263\274sx\367=\202\373\251;)\014\333=\235\345 >\272\1775=\224i\035\276\024\374\302\275^\367\210\276\315%S<\211\0022=\301\224.\275y\022\277=\204\254S>KRt\276X\335\010\276\326\n\222\275\377e\032>.{4\276\004\255\036\275x\th\275\001\272*\276\035\236\260\276\223s\367<\304\314\252=b\270\236=*JH>\305k\312\274-4E>\336\376b\275f\244\001\276_\367t\275\357\313\224<\364\355\263\275\226\211P\276\274\326_>\300\016\\=\250=@\276\224\234\207=\336\312\265=\336\272\221\275\202j\230=\231\227\244\276;\313\317\275\306Y7>\303\360@\273\\\367\030>\033\251\261=>\347 \276\367+G\274\246\020\246\275uTS\276\264g\014\276\014\260\257=\367!;\276\263\300S\275\246\345X\276~9\214\275\321o(\276U\200]>\242\022\266=R\220\t\275\372\216~\276p|\202\275\330J\233\275g\350\245\275\2449x=\353\247\321<\336\222\376<\325e\375\275\001\373z=\260z\262=BO?\276\307[?>\225v\360=\022\355\203=Ff->\030\203b\275\373QF>\3444\005\276\210;A>Cf@\276\373\270\234=\262\265k\275\'\037\r=\316\005\250=qX/=\251T\277=\366\253e\274\206\300\276=\341*J\275\335\006|<!\025\017>\t\261t\275Pe\366=D\t^\274\256X\312\275\352\344\223>ct\025>A\031\241\274\300\224\271\275\243\003\333\273\304!\341\275\177u\">C\257\t=,\234\\>\323\024O>ojg\274p\226\037>\343!\274= }z\275\362E\355<\035\275\364\275\2100\363=\344C\245\275\374\342\336=\'\362I\275s!s=\221\246\333=f\367V=\n\222\347<.1M\276._X\275\0268[\276>8\200=\230T\323\275\350ZJ>V\'\231\276\213\\V\275\3601\202\274\262\236\337=\350\327\221=\301\004`\275H\307c\276l\266\301\275j\323\350\272m\317c\276p\316\230=\n\014\202\275\375\366:=\251rZ\275Y\341\232\276\364I\000>\372\250\322=\324\301\344=\300Ed\276W\262\205\275!\237U\274\370\335p=\326\365Q>\275\341\336<\362E\245\275\263\000s=5eP\276u\305\220=\3068u=9\3620<\263\312g\276\030\257@=\356\256\024\275\360\2666>\207;\351=\274\344\236\276O)\315<\240,O\276\320\225\006>S\240\010>8\223 =\220\024\344=\226\343\217=\336\023\241\275\026\035\t>\351\237\223\275\202<\367<\253rd=;\263\347<:-\253\275\317c\257>+\025\302=\236\037\346\275\244n\200\276|\335o=\206\034\251\275R\0365\275\357\311^\272\371TF\275\346\276$=\206u\267=\205\240\373=cy\344=\247\233\213\275\325\210\344\274\022\3013=\227\020C<\374B\331\275\'&\030>\023@\322\275ZxT\276\rG\356=\366\201\223\275\314\245\346;\277\265_>\252;r\275q\275\266\274\356?(>2w\250;\277\214\245=\240.J\275\330fr>\315\'\036\2766E\212>$\032r=jK\025\275\320S\233>x\2221>\317qT<\240\321\310\275j\354\377<\214\237^\275\270\261\027\274f$\301=\"y3>\311!\212\275\357Dk\275k\257\001>Pa\257=,\304W>G\023]>\247\335\036\276\220\227\277\275jg+>w\343:\276\366\035)=\233\021\345\275~(\267\275O\262\r\276\266\2102\275\353\353\251<h\276F\273\\=k=\3300\007>\377\357 \276n\202\032>\'\374\351\275t\344\227=\306\257p>Dy\323=\210)\026\276\031\342\346\275\367\212\352\272z\247\243\275\225?B>\234^\'>\370\275\222=6\371e\2760\212\274=,+\026\276\002Y\211\275\025\364\337\275\000\353$\276\006\345u\274\344\370a>[\266/>5\223\223=\342Qd<\360\030\211>uq\257=8o\330;G\207\357\273\215g\334\275\223\017\016=]OF\275t^\016\276\014\253r=\0358N=q+4>\230Z\246\275n:\\\275\247JN>M\301\351\275\204\326R>\r w\276\250\007!\276\232\001\372\275d\274k=\235k\204\275/8\024=3e\336\275\257\334\"\276_2\272\275\022\204\264\275<\276n>\317\305F\276\340\225\222=5\216T<F\0237>\244\217\364<\334\313\001\275\235\352\362\274&\304\022\275\356\267\336=\2222\365\275t\213\310\273\003\255\254\274N\025\355\274\206\267n>\304\251\205=x\2667\275\270\007:>\212Q~<|y4>\263]!>F\206\034>\363\374G\276\332#\377=\262\033\245\276d\202\241=\334\341$=\213\206\234\275\222\355W\276I\022\200\275\364AL>\256\260*\276\271\255\236\275r\236\365<\271v\330\275\3319|=\343\361F=\234i%\276\271zq=\257\202\001=\300\336S\276sg =!1\340=\331\271\340\275\303\262\276<3v\246=p\377q>\346\254\212\276\016\014\010={\211\260\2758\250\214\275vp\003>\342\021\251\274\204\324\372=\004a\"\275\277\'\257=;p\003=\257\372\033>\330\337+\276\245\220d\275\375\230\037=J\364\301\275\027\032\205<H\337\025>@\357I\274\256\300\204<\277\346R\275\345\300\206=T\030\030>\025\366\357\275~\n\035\275\341\031.\276\366/\257=\335\2309\276\n\376i\276\000\030\276>\3541\030\276e\021\203=w\0137=\375=\230=\365\037\013\276}~>\276\023n\037\275\307A\247<<;\246\275\352\234{\275O\3634\276\214\375\275\275\025(X\275\336\004\241\275\010L\243>}\356u\275\304\355<\276\322\210\272<\376lM>mQT=\307\303\311=\307>|=\275\030\366\274\202\351\213\275\367\255(=\371\324\326=\302}\332=\303^\345<\214\234\241=\240\365\324=\206\271\035>\356\261\230\274\013\320\344\275XL\373=\022\221\236;^\330\311;\311)^<\366\331\213<,\330\254=\260<\200=\366\312\223=\334\nE\275\221\333\376<\325xS\276\354\033\034\276\365\273\246=G92>\332\271\273\275\000\016\032\275\211\225\351=D\200\254\275u\\\350=;}\274=\200\366W\275\2658\230\275\350J\317=\265\366\354>\314\264x=w=\263=\234\377\234=~\n\210>\022\333\376=\323\320a\276\372\267w=i_\351<\005!!>\344\305E\275\022\367\236\275\306\335q>`&)\276X_\r\276\233\2720>\337yK=\336|6\274T\306\n\275\356Gl\276\260\253\007\275\300\346\214={\372\363\275\251_8>\241\330Z\275\"\347\016\275\034\365T>%\313\025\276=W*<M\027\326<\261\024\222=\001X\374=\227\366\265\275\033)\232=\304\005_\276\003\201\">\207\361\035\276\230\217\231\274\337`x\275\366\343\214\274\263\356O=\267]\'>\031&\000\276s\300\234>\033\374/<\\\025\351\274Q^d=\232\016&\276\035\026\017>R\206A>\000\305\311<+\343\274=\323{\344\275,\233\000\275\215\3162\276\301;.>@h:>E\335\255\275O\034Y>\310\366\224\274\234\036\330<\207 \264\274\320\355\313<6\377\207\275\263\225\237=\037\206\"=(8F\272\001\237\340\275\355\220\362=\311\335\370\275\245\251\034\276\321\255\253=1\364\204=\334\254l=p\201\311;\362\325\"\275\177J\247\275\242\367\270\276\216\211\321<3\324\230>G\307D<y\"\341\275\331o\367\275dB\260\275O\263\352=q\274j>f\217\267\275B\323U\276*\213\215\275j\375\373=\235\355\273<Y\323m\275r[\203=Y]\200;\303\007d>\004\254|\275\316h\304\275\245\003)=!\326*\276<\301a=\344t\236=H\312\257=\243_\020>r\357\215=\2627\234\274T{\232\275B\336\267\274\265L?>\304\265\231<\023!\234\274j%4>\307\304\316\275\020\232\017>\025]\031<\322\001(\276\242\253/\276\005\356\n\275\020\264\237\276\004\016*>\032\224\315=\331o\002>\206L]\275\337\356\245\275\033K\245\276\240P\243\276\321\272\250=\326\233>>\225\254\007\275\262\013r>:\313;=\311\305\017=\257A\037;\213\2777>\226\202\004>y+}\274\373P4>\0205=\276\320\274\326\275}\010\311\275/9|\275\033MC\274zY\304=`\351\371=\341\214\271\275\206\355\303\274a\265\205\275\327\357\021\276\005\256\356=|\223\234=O\3376>\265v3>qP\020\275\373\366B<q\036\021\276\207\034\033\276\342^\353\275\244F\216=\362&\n=\324Ho\276M\247\204\276&\016\366=\235\273\226\275.o>\276\331\nR=\031m\215=\027i\364=\311V\027\275@\223\002=\276S=<\275\336\020\275 \371\346\275\356)\203>\361\246<>g\363\312=\374T\341\274\236V\253\276\225\021\363\274m\031\236<\203(8\276O\300\325=\375A\213=\347\2704\276\275\276\371\273Jb\366=6\344R\275\247\177\317\275\206\2051\276\215\376D\276\257\247$>=\266\260\275\330\225\360=\243\322*\274i\025a>\250\021\360<\226\261\221=vj\251\275\006\275\250=\214\210L<\266\336a=\216\035\316\275E\304\334\274\275v\317\2722\311W\276\000d(\276*0F\276N(\332=\206\344\010<`\033\257\275@\310u\276\371N)>\301\203\241\275.\226V=\347\230\326\275`z\202\275\274\353\000=\374\027\024\276\214\212\267=\363\300S>P:/>j\242<\275h]\246\275\005\321\031\2752\355~\275g\256e>zM\037>P/\304\275\021\007W>\2348\325<\3674\206>q\326\323\2748\000\320=z\231c\276`\370\305=\334\221R=\255x\346;\t\334\314=\227\027\r\276\315\323\003>\232\213~\274\005[a>\223X\300\275\250Aa=s\333h\276\301\351.\276\262\343\264\275)A.<Y\245[\276\230%r;\304\237\342\274Z\315\022\276!\252\017;\216\223\331=\347\027\017=\300\355s=\031\271\027=\335]\266\275\n\372\026=qA\270=\252\371\000>\274\360W\276\354\242\265=\207~\217\276y+\242=\304e?=\362Y\322=\025*0\274\362f3=\354tN\276\255\033\276\274\177\314@=\346\031s\276\252\031\350=%\310\266< \275]<\353\034\215\274\314\201\020><`\200>O\220\215=<s\257\2749\236\004>\223\335!\274\214\271|\276\353\245\215=7\356\024=\362\010\250\275\225\271w\275B\373\367\274\003XT\276\344\240\240\275\345\010\240\275gE0>\2213\024>\225\315m\27424]>\256\215\343=\232\217\266\275G\224_>\356.m\275\373\324Y>I\243\005>2\315x=\266\343.>E.R=O\245?>\312\317l\276\315Eu\276M\307=\276\254\206\036\276\230q\'\275\2029\243=\251\024\017\2757\307\324=h\036\311=\030\223!>\332\002\317<;\033\322\275v\347\030\276>O\233=\003\316\336<8\2314>\034Q\025\276kX\234<\357\2778=\221\273\350=\207\261\334\273\312~Z\276\326_\255\275\315\255\\\275\020\310\322\275\377\365@\276 \341\211=\361\364w<\342\260\365\275\312H\007>\311\323\261\275\320\273\027\276E\224\235=\271\332\215\274?\246\367<V\264H\275&*G\275\361\347\314= u\211\275H\237\314\275a\340\020>:\337\205=s\025\231\274G\361!=\246>\201\274\312\211\257\275lW\003?\\,\021>\331O@<\006\240Y\273]\346\275=\320\266\030>\253,\320\275\333\253\226\275\023`\003\276\'\337*\276\013\310p\275\373\313\036=tc\204>\346\307\253\274\201\202\260\275\3662\223\2761Vf=~7\n>\023\230T<y~]=\377<%=\027\010\205=\217\225\367=\333\371\241\275l\271\221>\217*\204>\t\351P=\342\352\356\274>\366j=\337J\204\275\252\"M\274%\316-\274X\020\217\275\242\325\305\275\360Yo= \363#=\227\267\025\276\030/2\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
