node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 623265
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "6$\367\275\271\366\004>\260\021\270=F\371E>O\337\265=\0027\262\275`;Q\275\313\363\013\275\202\016?\274\337\002\301\275gmu\276\367 \002\276\224s\302=\3275+\275\224\\\004\275\245\271\345\275\344/\203>\271\"!>\305\263\230\273\252\236\204=\303+\007\276ax\266=+\245!=\262\271)\276M\226H\276e\250\341=\003@\312=\214\003\210\276\031Bk\276\034\346-;\0010G\273\267\337\322\273xz=\276\354\277\276<\262\227\005\276\214n\301\274\003;(\275v\327\024\275\330kD\276\023\267]>\241\235\301;\203\314\320=E0\244\276\243\332\323<KB=>\212\333M\276\020\362\356\273\375\234[\275\3331w=\334\323\021\276\334\225\017\276\"\'\215\275\256\266\301=\273\314\007=\232Ri\276\352\325 \275w\354\331\275*_\177\275\000\013\225=\353|\027\275\307\206\033>\317A\356=\326|\363;xoZ\275\351\364$>\'=5>\243\326\204\275\3418\247\274zH\205\276\216\031\260\275^<\217=\371\346;<\007\351\257=\n\377\325\275kN\002\276\253WF\276\361%\324=\224\263\270\274\233\022\365=\320\227 >,@%\276\202Z\021\274r\251\201>\035\"\315\275C\203\272=\341\226\001\276 ;\317\273\215\245\271<\200\274,>L\356\002>\232\353\356\275V\361\264=n%\216\275\026\200r=\206\331\233\275zX\020>\262\363\n>]\"\030\276e\016\247>\365U\376\272\004\221\364\273\346\211\203<\020\350\010\275\230\263\360\275LOg\276\201yN\276\304\236\310\275Y\256,\2745p\226=(\263w\274\324\"^>\330\356{\2757\370\022=`\362w>\362\254\017\276\330=?\276\306 \001=\373A\026>\201 \316\275\236\253y=E\223\221\275.\325Z<\240sG=\300ro=p\024.\275q`\010\275\231\321\213<\216)s\275\2303\244\275\224\024\215\275j\2342\274\017\2776\274\323\202g<rqg=\tN\227\276\347P\025\275\261\227W\2764\247?\275e}1>o\t6=\355p\031<\303cN=\263\016\263\275Vb\360\275\256\004[=\362\276\010\276\271\251\207=\257\037+\276n\306G\276\224\306\351=\251\216\n>8Xo=u\365\260=6\340\266\276|b\232>A\375p<\376\202\022>\020\251\010\276\327\351\207=\224+\222>\022W\242<1E\345\275\236R\010>e#\267\275m\000$\275`\330\360=\227\020\020=\252<9\276L\004c\274\001HD>\246=\206\275\374\244\201=\371\372B>2bg>L\347\245\274\335\302<>#\020T=\320\337\317\275\336\210\326=\306\243\024\276\224\017P>uf4\276\321\032\370\274\n\334\337=M\n]>\203\333H=\352(C\276\254\323\301=r\243\305\276\304q\316=<\303\250=\332\212M\276\036\001\027\276;\260\252\275\250\317&\276l\340\037\275\344\024\361\275\024H\356<\317\342m\276\013\242v=\036\"\270\275\233\201;=W\217\006\276\274a\261<\003\326\231=\2418G=\343\206\000>\016\332\205\276\033\210\242\274\364\375`\276\021\211\026\275|k\270=\240F\340\275\212\016b\275t\273M9\220\335\217\275X4\313=\365\356\312\274\007M5=\016\202[\275\243\236\224\275\335\314\261=\262\255\270;\3656\214\274\331\223$>E\310m=mJ->\274.Q\274\235\310L;\361\272 >\255\334\213\274\216]\016\276z\005>\276g>\031\276\265\225G>m\315A=\240\203\263\275\006\251K=_\320\204=\330;Y>q\260\345=\3543H=\326P\031>z\267~\276\2276\232\275\010\271\237\275\227\3464=\034\324\256=4;(>H\271\344\274(\212\265=\341\361\t>4r&\276\313b\331\275c\3601>~\255]\275g\343\317\275\304\021\204>Aw\250=\277\203\010>\201\226\264\275\302\002t=\035\247\357\275rg8=\020\321^>\234\225%\276\324\017\266;\241S\001\276\353P\333<L\224\250\275e\201\344=A\007t>JPb=\342l[\275\232l+\275\021\217C\276\307\254\315<\243\356\\=\362[O=\370mC>/E\330\273\r,\313>\004\026s\275\021r\374\275A,\202=\344\357\262\274M}\022\276^\3161\275f\274\036>\324\206\307\273\335\302\315:\214n<>\'\001\233=y\3264\276H\336=\275\305\353\276<\200\361\261\275\356?p>4|\252\275G1y\275\343/K\276\243\340\005\276\022\362\t=v\303v=\305\021\234=\255\226\242\275\3367O>\323 4\276\341\013k\275\250\336\322\275\215P\r>y\035j\276\000\376?>\214\341+\276\022\254\232\274\020\320\022>I\320\355:\364\030\302>\370\'V<\277\rt>\335~8=\2764\245=\266\267\247\275\205\302\326\275\213\240e\276\250\333n\273hKh\276*d\224;r\370\034\275\300\003\362\275QA,=\023\366\236\274\320\2642=\000\021\010;\263in\275\373\274X\274\220\330\034>UN\017>\252\373F>\235:\034\276\264\334\256\275\rD\257\275\r\312U=\225\233_=G<4\276\362\332K>P\343\003>t \016\2765\\\257\275~u\373\275\006\342\323<\014GO=\004$\000=\261\212\006\276VY\314\275mE\327:\345m\240=y\305Q>?\t#:\303\264\340\274\376\014U\276\370\227\224\275@p$>v\301\235\275\363\343\220\274\030\317x>/\020\277\275\245q\317\274|\224\247=\346\354\231=jL\244\275\352\311\231=\t\3617=X \346=\032G8>\200\253\367\274\263\334J<\240\336\377\274\300\211\273=\370_\033\275[\005\211\276\362\014\r=r\254\347\274]K3\275Cd\355=}X\243<\354\276\364\275W\212q=\375\230a\276is\257\275\371[\245>:\177\304\275\215d\306\275\357\006\035>7\274^>O\014\260=\2617\207>\246g\346<eXx>\000\240\300<\233\005t\2749.\233\274\215\204\\>\374\370\336=\226\235\376=\223 \227\275\376n\336\274\322\236\307\275<\250\r>\373r\204\275\252\274\\\275\'f\200\2768\334F\276\244\321\370\275\3048\277\274\342L\021\2760\257\313\275\342\021\307\275\020i\360<\254\340\022=\026sv>\223\240a=\014\022\021\276R\335T=\247,o\276`\222\321=\336\360\\=\021m\271\275\003y\027=\206\323`=\324\2105>\217d\000<\351\366q\275b>\031\276\241C\007<;\204\336\274|\007h>\001\3255\276{\014\017>/\303\350=\364\020\314=Z\344\023=h\350\322\275&#m>mK\274<\035*\250=WN>\276\361G-\276\346\256\"\275T{\233>M\220\217\275\357\262\021\275!O\017>ok\365\2753\224\225=\200\263]\275z\265\341=\302\355\207<\227\271\237=\373x<\276\221*\006>\274\265\215=T\334\311\275\301\306\320=\260F\210>A\301\201=\225\215&>p\272\357\275D]\276=%\033\351\275E\037.\276\255\275\276\275\332\261\361\275\374\216\277=\371\\$\276-\000\224\275z\032\"<\006\250\020>\277s6>\346y\t\274\342(\327\274`Mq\275;G\234\275\311\205?>\376g1>\357sg\275\225\213\021\276\023\216:<\246\301,>\016\\\201=\302\311\256;\037\034\316\274\"7\034\2753\354;\276$6/\276z\337,\274\306\360)>\370\203\225\276\2101\366=w\344L=\006\355\300<\305\233\'\276f\367S\2751\206\213>s\013\007\276\225l\022\276\'\222a\276\247g\324\275\340\200(=\324\3609\276\235\335\202>\311\270\225=\321\363\031\276`\351\252=\256\240\001\275\316\277\257\275\t\361#\276f\203\004=\323\335\253\275Q\342\210\275\343\375K\276\302s\'</\177\024>\256\014\247\275\202\260r\276\316!5\275\307\327\031\276\312Dm\276\202~\352=\010\206\237=J\252\235\275\330\357\005>\365\303\257<J}R=d\377\200\274\366\326o\275\035:I\276\000$\325\273L\374\256<\021h\021\275\354N\n\276\314\217P<\raI\276z\201\313\274e\225\370=\232\014\n>\310\2418= \036B>\027^\232=r\3118=\234x\253=\215u\r\276R\0130\276\252\305`>1\005\322\275B\226!>T\231\357=\327\262\023>\250\266\241\273\024\306\263=6\350\273=g\322\340=\304\033V\276\210\2163\275\304\230Y>r\201X\276\232\005q=W\035@>\332$\330=\351\354\016>2\323\332\2748\336\335\275q\241\203\276\301)p\275\316\250\341=\317*\034=\344\356\215=-\212\001>)\301_\276|pr\275\371m\"\276\341X\363:\241\216R\276\201%\235\275rk\014<6\356~\275\022\211L\276\216 X\276X\177V<\231\205q;\003@\020>B\266\'\276C8l\2750F\345;4\224B\275\233\315\211\274>v\027>u\023\205=fYV>\343\025\220\275\246\364\356\275\206\351\220>\303\026\035=Jv{=\356\251\210\274\020{P\276\234,\317\275l/\t>D\371\010\276\357\263\204>\350\021\030:\243\020\376\275\236\035\275\275\252\001\022;\273\310\210\275\356\303\251\274Gn\262\274\240k\253=\217\314r=\031\256\025\276\256F\317\275\357x,\276\246\361\336\275\2318\344\275Cp9=r\341\314=\2078@\276\307\357\234=\277\374\253\274\354\020N>\005I\355\275\367,\332\276\014Y\205=o\023\r>g\243\254\275\275y\002\276\035\264b=\271\376\271<\373v)>R\330}\274\nM\343\274\253\177?>=\234\311<\034\246\242\275\272v\310\275\020N\313\274g\271\342=\235\240\320<\'Q\037>1;\242>\017R\216\275\225\261)>0\323\205=M\274\356\275\347&U\275\231\261+\275\377\323\241<\271\235\016\275\347:\227=\331\370c\275\303+o=&\320\005>\352\364\227>y\270\340\275\301F\031>\374\315\014>\030w$\276\0140O\276\337k\007>}\271\037\275\003Z\376=wY\342\275\242u\216=&J\303<\331\367\006\276\326J4\276\366\\\225\273vz3\276\240Qx=L\261`\275\261A\371=\010\010\217\275\2626b\276\326\036M\275\r\257\330=\274\324\200>Z\335\233=\023\346\276=\n\241\275\275\307}\031>\201\334\244<\035\234\357\274YV#\276\317\307\330\274M\251\023=\241\377\333\274\2373\321\275=h-<\340\231H\275B\006\332<\245\2709\276M\362\r>\234!\246=\244|\031</\037\362\275\n\300\243\275\007\253\357=\236\344\263\273K\215N\276\202\246\200\276\353\272\000\276\275\377\017\275\260Z!>C\315\010\2764v\027>\006qm=\335\252Z>\n\237s>\247\237\251\275|\247\276=?^\377\274{>\333\275\326\326\316;D\260\313=\266\003\361=\272\273\013\276\224B\220\274\000\234\221>\215\177\240\275\311#E\276\363\207\026=\371\017\001=#\371\022\276\306\177\236=f\345\213=\035\331\224\275\254E\361\275\0017\234\275\004\'5=W\304\355\275_\256\230=\355\014\272>\362\022b\276\363;\305\275_3\245\275\273\340N>\204\324\210\275\350\016\372=Y\327\251=\357\"\351=\243\027\350=\021\246\240=\327\262\333<p\272\225<\272\351\'\274[D\024\276%x\306<\237Mz\276\220\247U>V\270<\276\275)\273\274\027\334\036\276\370\344+\276g\253\317\275\006\037\261\275\032\203S\2740\233>\276\253\330\220=K@\317=\203B\033\276[F\245\276\232\270\222\272i\215 \275\t\201y=\002\341Y\274\263\337\023=_\345\303\275\177\251v<[*\n\276\340\233t\275\230\017W\276|$\201>\262\254\033\2758?\317=>\313_\276\273\007\330=\215\252C\275\030\230=<L\027e=\242Y/>\356\304q>\232\273\216\275\033\340<>\307\226\351\273R\371\014\275\027\345\030\276\310\345g\274I \002\275\200\276b\276\335\332\313<8\001\201<Vm\214>\232\362\017=\033\307f=7n\200<Y \373<:\333\213>M\t\014<\003\210\013>\332zA\276A\270=>\017n\020\276\251\001V>\321k\">\3160\360\274\314\376\221\275\355\337&\276\331\302\275;9K\307=\314Y\247=\314\346:\276\367i&:T\343\371<\224X\311\275\237\263\013>\255\177\255=/\013S\275\255\203\323\275\\{G\274R73<\345yc<\223J\026=e\320\302\275\234\016y>\261\220\037\276\354\312\t>}I\"=_C\372=1\334\031\275\317\\\032>r\243o>\201\020\367\274\017\3510\276H\321\304\275\032\240\370;\220AR\276\3162\242=\365\216\231\275\007\354U\274}\365\240\276\367\'\366;\031\352\020\275\354\272\267=\344\220\004>\372\234\227\275\224\022\017>^J\247=\313\327\014\276\345\244\272;\261\363z\275Z`\303\276x\217\013>\016s\023\275\263\313\253\275]:\">\t\252\027<\202\230M=\347\327\333=\016\374t=_ \242\275b\264H=\013\226\000\275\025\376\215>\3504`>\025G\310\275 \363b>\224F\302<\315\223~\275\035\0010\276\261\320\016\275\315\344\006\276\003(\331=Sq\254=\334`|\275\210$\375;\301\322\225=\227\020\341=\246\367X\276\217e\337<\034\226><Pz0\276B\036\027\275>Pb>Q\362\246\275\212\034r;\330\024\230\275d\252\020\274\352\233\275:c8+>\300\340\221=\347Q\276\275\277Q>\2765={>\314<w<&\366\007\276O\203|\276\305o-\276\324\336\001\275=&\031>\240\0056>\017\371\000\275T?x>\374\207&\275\205;g\275\322G\223\276+\030\014\275\006\370\261=y\365\031>+\225\321\275\205\236\261\275\207m(\276[\323\373=\232\275^>44\346\275f\027\027\275k\000\353\273@\245t\275\203&m<\304H;>\371-\203>\373K^\275.\325`=o\3410\276]\003\326\2718\336\243=\204\215\026>\304{\315\275\222\366\021\275\026\022{\275\025/A\276\301\203\230\274\004\214P\275!\024^=\007SX\275.m.>\264\2338>O\226\215=\014\005\013\276\252\013\276=\326<L<\217\360A=\312L\336\275\252\247\333<\007\010(9{\214\350=I\002\266=\237\320\351\275<$s>\261y\262\275\273\0318\275\2532\237=\371\361\004>\234\253z<\203\310\243>\252cC\275\324Q\347;~\244\221\276\230cy\276\317\311\227\275\030\222\314\275\340\017\366\275|\346\031>\201\007\327\275X\324%>z]c\275\336\366\220<\365\362\245\275\211\353\346=SZ4\275\367O\">\003\253\360=\031\251\242\276\210\314\023\276\335\300S\275\212\202>=\220\313\217\275\314\345\026\274W\362\354=n\037\r>\027\311\202\276\235\342\203=(o\036\276\350\207\330=u\360u\2742\351[=8s\351=\313]L:\362\000\227\274\312\026\361=\316.\352\275\240\007i>\276\277\037\275\234E\356\275Fc\030\275\240\312 >\317\216n=\243v_\276D(\276\274\027\024\017>`\241W\276\213A\327\274O\361\303:z\312I>\344p2\275\331d\031=\016TH=\250ko\272\023\364\273=\215\2070=\307\254`=E\030\n\276\036\305\274=\312BO\276\037\213\266\275\014\023\262=\031\300\227<\246\351\014\276vEz=\244\371\350\275#\325\367\273\257w{\276\215\tU\276\327\354\241=\264\t-\276e\333\203\272e\306N\276\355\312\204\275r\006\356=n\007\023>\361\250\321=G\342\321\275|\203n=\274\374E=\254\334\300>\260 \206<\'\3648>\342\330\351=\356\343\231>\\\373\342\274\007\"\223=\325B\034>9K);o\200\355<\n\005-\276\256\023\216=$\252O>\364\017W=\214\335Q\275\033j!\276/\366l\275\256\3079=\205$\261=\325D\261\275\266;\002=\362\204\227=\336\022]>\315\275\212=\351\022\010\275\214\223\n>\273V\213\275\031\202\233=r\316T>o\254\017\275\326\346\264\274&/\035>\271\014\245\275\177:\033\272\300\343\t\274\374\1777\2767\237\276\275\355W\242\275<\230\016>\307w\003=hy\343=\206\245\027>uBv<\337|o:\177_\210\276%\311\335\274\022#\025>j\031\337<J\240\317\274\267|v\276\323A\210\273\375\223\367=\306\037\360=h\373\324=\371\tn\274iS\225=\265\372*>G\355u\276\271\300v>?y >\325\024\027>\364!I>\276\226\332<#U#\275=\006k\275\356\363\224>\301\244[==\250B<\257p\001\275b\313\210=\233\032\031\276dK\177\275\035\243\203\275\032#\216\275<\203\207\274\232qO=\250\314\021>\004m\316\275cgQ\276XA\006\275\330\207\260>4/\010\276\246s\244\275\277\313=\273\350\310\376=\262:\010=\3731\262\274\370\347\246\275\031\036%\275C\341\324=\303\202\'\276\264$\316=T;\211>(\272,\274\370N\303\275\270AV=\372\245p\275uP\252\275\307\023\366=7\316\373\275la\004\276\376k\333\275/\277\274\275~Q\025\276\345&1>m\005\\\275\217C\021\276\2203\302<X*\315=\337I%<7\2361>T\003\006\276\213\'\254=\361\226\320\273\375\372.=0\215\374\275?J\255=\274k)=q\364\370\275wm\236=\324\367\024>\302!\030<qf\333\275\365\213\271=\034\024k\276\207X\n\276\336\263f>!\325\235>\237w\250\275Y\377\257<\301^d\275e\376\252\276\243\222\225\2751\204\270\275\335\256\366\275*:\372=q\232\271=\375\306\004\275\374\363^\276\231\026\277;K\300\010>a\200\n\275<\003\304=\365\006\373\274\217\255\020=$7\036\276\211\302\323\274\3403a;\357\230\352\275W\021\037\274M\217H\276P\307\367=\243\346\241\276J\307\361<o\311>>t\345\271<#v\213\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
