node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 5975355
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\363\3667\276Z<r\276\214\251\361<\316\311\005\276\234\317\213=\020R1>\231\240\027>(\220\211\275\247=H\274\2242p<\343\356\221\275g\203<\276|Q\237\272\017\360\226=k\370]>\323\225J\276N \222\274\'\216\203>f\035.=\377\022\"<\217/\273\275W\312\374=>\350j\270\270\276\366\275\220S\\\276\".\313<Av\335=B\260\220<\320\273\023>a\357r\276\256\345\230>\253*\273=\362\365Y\274\007e%>H\215D\275v\347\234=\335\375\327\274\235=7\275\331\324\377=\3512\376=\357{)>\201l\r\276 \247*\276\255\023.\276.\307\r\276\260\3348=\022g\263\275\313O\243=\000(\257=\r\252\302\275\327\210J\276\377Y\006=T\np\275\032k\216\274k\203\\<\250\0273\276\\\000\250=\003\332/>~\264+\276R\227\326;\216\220\014>\234\235\325\275\302\213\361;\003\017\230\276\212\023\327<\367J\210\276Hb\024\276\231\311>=\004\224\030>\261G\367<\206\216\262\2754\035\372\2740-X\276H\372:\276\310\354\230>\000\262\261=j\241,\276\200\373\006\276\010\256Z\275Za\251\275[\004\275<\251\n\345\274D\241\367\275\007cg\276\372\032a\275\343\254n=yz5\2768;\201=\262)\335\275~\227%>5\274\251<\263\362D>\255\001\237=\356\003e\275\211[\005>\334\236\311<m\305\327\274\237\347\025>\206\242\004=\240\213\362\273\216N\240\275}\037\020>\310^\236\274Q\2628=\346)y\275\020C/\275\273\226\255=O\3017\276\344\014\355\275\327\213!=\252\263[\276b\'\307\274\376\3214:9\343d\276\342\267\262\273\352f<\276\350\317\267=\231\267X>9\327+=\254Y\n>\305\374b\2764\332\301>IV\254=}\r\257\273J\335\213\276\017=\007\276fl\022>Jj\010\275\376Eh\275\267c\t=\225\347\234\275\263x\202>\362\225\007=i=#>&r\246;\267\203#\276x\311\037\275=\r\236\275\311\376\027>\031G\305\275w\213\315\275\274\0062\276\334\350\025\276\373d\324\275vt\266;\315q0>k\200C:x\003A\276\201\205\206=\336\306\001\276G\010\t>\177\314\374\274Peo>\324\226N=\n6Z\274N\032b=^64=\343K\223\274s\205\274\275\263_|\2760m\037\276\205\367\231\274\327kb\275b\200\002>$+\004\275\360L@>\274Hq=\247\232\273\273\374\311\200=\307\254\013\276\'\307V\276[\307\271\275\354Z\234\274\247\270\242\2745O\374\275\352y\217<>\\)>F\371\026=\247p\271=\3522\217<\200\200\357\275\215\202\200=\317\007\036=\016\235}>\302\370\243=\037\023p=\016\310\252\274K\276\263=e\320\216=\037\2428>\2100\363\274\353\243\013>\302\213\332\275\362\217\252\275}\316\231=\257\226o>E\336T\276)\022{\275\002pb\275\372\237\220=\305\310\201\276{\300\203\273\207T\200\274\254\370\316=\277c;\276\366\370\201\274_\0037>\271n\205<\355\264\340\275\246\246l=\355\270\003\276\355G\366=n\234I>\343\001\032\276\036\254r<\007\330\233=m\311#\276\333\366\336;\267eO\274D\327\314=tn[>\316\252\362\274+\212\270\275\267\345\333=:\325\030\276\303\021Z\275\024\001\226\275\005\236@\276j<P>\221.\027\276D\322\345=g\035\200\276\241\304q=\206\010\031>n\3122\276\320\024\231\275\017\247\246=\304\255\323\275J\337\203\276\301U\212=l+s=\322\035\001>\315B\242\275\3040@>-\025\243=\246\211\021\276\021\2350\276\317\323\344=\246\301\372=\367\241\213;\321(\264>\317\323?\275@S\024\276\375@8=\347\020\017\276\352\360\305=\377\215=\275\010/\236<\304T\345=\342_\034=\306\276\\>\200 :=\236\001\227=\260\274\254\276F\251\313=\215&\303\274Xs\241;u\211\016\276Gl\'=1\350\032\276\205\220\270=@\366r\275\206\341\210\275\310EU=\'\207e\276\\\332@\275\245?\n\276q\301\313=\200SP\275\322\343\253\275\353\317,>\2636\r\274\3338\001=/\324B\2765\354\266\275\317\tw\274\236\376\026=\037G$>|\204\t>\2269\277=\027\021\343\275\304\0000\276\346\261\n=0%\214\275\026-\324\275\332Q\377=\007S\r\275 y\310=\257\230\353\275\023\014\245>\252&S=j\272\240=\201\n\362\275\322\207e\276\371\023O>/\214\314\275\265\2429=\0201\321</x\345\274I\211\003=q\002\216<\262\306\t>\260B!<1w\253<x\241z=\264\364+>n\226\213\276\232%9\274\2678\030\276d\360\253<5h\301<\367\211\256\274Z\250\004=\315B\332=\202\373\014\275\24413=Aa\234>b\325\212\276\030\034\001>\204)\200=\246V%>\204\205\255\274v\250=\276[\023c=\032\252\352\273[\327\261=h\207\212\275\314\002/\273Dko=!%\207<U=\002\276D\r\'\276\030\236-\275KMv>~\337\204\275\225\304\027\273G(e\276p\343L>;@Z\276o\245\366<\3646\320\275\364\372\353<\367\235\305\275\274\013\350=\335\274p=\357\010W\275NE]\276b\223^\276Kl\007>Yd]>\306\023`\276\002\3003=\245\365\320=\022\226\004\274\304\257\334=\337\213\034\276C-2=\371\230/\2768\335Q\276hC\325=\347O\357\2742\374H\275\347]:>~Y\253=\224.\341=\242u6>,\306\316\2758WU\274\251\310\212>\007I\242\275Sb\374\275,\346#\275\304\016\265\274\n\262\037\275\300[,>\202q\252\276_\342\220\2769_\272<\326\257\224;\027\205&>\024\257\244=\300\334\337=i\004\017\276^\344\023\276\255\241\355\275\231\217g=\234\330\360=?\236\t=\270<\241<\036\367\256\275>1t>[e\240=~\007w<\255\204\026>q\017W\272>\230\t\276-\014\324\272\344\2437>7\3757>k>\004>\325\350\367\275\372\357/=jL\007\276\226\301\213\275?\233\261=gc\203\275Z\357\216\275\307%!\276\030\241\270\275=\235\270\275h\006\'=\325N{\276\205\031w\276}g\223=\025\232\204\275\351B2\276\374\223\255\275u7S=JR\232\274\326\351\203=A\225I=\202\244z>\001Z\030\275\313\345\272=\345\244\024\276\226\205I\274\013\024\352<Wm\355\273;\326\323=\217[\263=\177\242\366\275b\305v\274\031\013\300>\034\336\\\274\320\2432\275e\010\211=\352\367\021\276\360A\356\275&t\002=\256:\231\2754\016I<\261~\373\274\312\237\271=\035\2574>\340\322\207>\356\301\271\275\203\352\266<\360\313\344\275\233\"\241>YJ\004\272B\226\270=j\240\332<\370<\327=\021v\302>\373c\031\275\215F\246\274\354\226\317\275\250\030\220<\215\306\233=Wna=\340!\022\275\321\323\030>A\275l=\326\004\261\275\000\350\346<\322\215B=\034\240j=\364\251#>\232\356\033\276x\270\221\275\233[J\275l\257!>\004\263\240\275\327\346\017>\3173\247<\003\226\263;\034\237\362<\265\213v\275\300\220N\275$\314\247\274o\014\361\274\337\271\344=\230\t_=\250\371\245\275\305\035W>\233\016\004=sAI=%T\t\276\253\311\354\275{#\r>\274\333\230<\225\232\276=*\256\216\275\356\201\017=\333\376\'=g\245\213=\206~>>\342\247\233=\370\247\200=\375:\273\275\"[8\275C\247\210\275)\227o>\323\316\363\275\344\000\220=F\365\177\276\3134\242=\227\313|=}r\255\273\177\320S>\313\252\262>T\350\n>\311w\265;\2647=\275\377\260I>\241\006g:EP\202\27516\206>\274%\223\275T\212t>\330\3138\276\257\370q>Y\333Y=\233\355M\275\210\313\203\276|n\361\275\373T\213\273\ny\326=eB^>\330\205\016\274x\361\023\2752fa\275l\312)\276\330\210$>\335\372_\276\217\343\242=\226a\004>!{\261\275Y\346S\275\351>g=\211\326\274=F\370\301=\313\024u\276\234\275\010\276\346\346\027\274\024\200\302=8v\362\275rQ >c\0263\275\265>\225\276\310\035\212<\252N\364=*\013\r\274&W\262<\3114\204>\343\333\314\274j\241\020<0!\240\275:\361\345>\003\244\r=0g\333\274\307\207\260\274P~\300\274\255ND\276_\037\010>\213\2015\275)\243\363\275\306\321\275<6\375D\276aM\226<\372\"\";\\\336\027\275\240\n\013>\'\023\253\275\374x\213=\264AJ\275\263;Z\275\256\243\021\276\316i\343<^\3761\276nu\025\275PCK>j\2241\274\312\"\327\275\305\316b>\221\212\037\276\'\257\303=\333$\313\274E\306c\275\271\250o=\320\356\\=\366\t\243<<?v> \371\027\276\307\245q\276\230\325\025>\00559\276\374\306\231\275\2563_>\003\224\363\272\3009\037\276\333\254\033\276\344\n\020\276\243oI<&\315\027\276\362g\353=\320\031.\276\265>\305\274x\325\201\275A\365\210\275?\\V\276cJ\007>\243\031\357\275*M\006\276\253\313*\2758\214v=U\241\302=9\306\347\275\027S\301\274\334\270\324\275m\025\254<\310Tg\275h\034*<\300\216\371\275\250I\t\276s\354\031\275z#\276>\255;\023\2760r\256\274\311:\273<[=\307=\247\326>>\252\375k>\017\354\323=D\027m\275\216\276\221\274\367\330y\276S\223\352=\377\243\267<\202g\203<xB|=\000\207\264=\222\272\360;\357\371w=2Z\026>\245s`>S\000\021<\275\004\305=\272bO\275{`o=\371f\267\275\r\3114\276\377\272\201>\340\034D>\004\324\360=l\244\253=I\271\321;$\373\244=\\\335\306=\306\210l;%\362\036=\375\034\227=)\267\223=\353\311\250<\316$l=\373te<f\tB=\003\231d\275A\206\357\274j\311\002;\'\266\227=X (>\210:\221\276\013\326\276\275\026\031N\276 D\227=\257\221$\274[m\377\275\241\376\334<bi\257<;\204\210\2754A\007\276\352\356S\275u\340\254=\302\025\035>\355\246s\275\254\257\213\276[\211Z\276\003li\276\010\t\374\275\371\351%>{Z\r\275\336\214\032\275\261ci>\312\245R=\330\270;\275.\373\007>\2500\256\274\341\325E\276\273\332$>\"\177\306\275\241\332\222\274\354\017\217\276\305\254%\276\377u?>5\300Q>i\033r=\271S\324\274\002{\035\275\000\003\255\275\265z\202=\254 \314<V\264\371\275\246!{>\330\261\262\275Q\235\030\276fb\020>\356O\323=\242\235\321\275\266\023\206\275\2019\031\275SM\244\276E\007\310\275\341\237\025\275>\343\330;\224\271\242>`\340\231=\000\344\262;84y>\233\303\004\275\224\347\334\275\252\265X=\341\215\022=8\207W>\n=-\276\337\3447>/\033\317=\031f\247<\256H\000\276B\326\034\276^\235\300==\010+\2749`\017\276`&<>X\365i=\357\265\211\275|kN>P\233\262\274\265\317\013\276\317N-\276I\365\363<\220\231\014>A\307\311<\r\305\240<\205tx;\336`d=G\204\322<I]L=\351\356\033\276^\305.\274\345t\270=z\302)\276\240\326\371\274 \252*\276\314?\253=\234\343\242\276k\233C=,j@\275\024\227\216=\337\003$=\300\r\013>\341t\021\276\263\2206\276\222\317\021=W\346\221\276J\262\304=\207\034\342=\205\n\r<%&r=#\315:>{\210\247;l\364A\276O?\002=\017\357\335=N\007}\276\252y\371\275N \024\276\224\364~>\237\317\266\274DSn\274\007\346\205=2\246\306\275\230\274h\275=\3539\275\300\005\223\273nR\215=W\006\002\275\343r\205=Fi\331\275\345\204\024>\204?4\276\214G\013>(\315\312=\025\250+\276\036\264\003>2\351\357=\315\230\351\274N\006\035\275\264\363\271\274g\303Q\275b*\240=\335\215\310<U]\222\276\361<$=\275\027\n\276\\\000\002\276\306\302\004\275\344\305\241>\306\032\026\276\360\030\260=G~5\276\037[\235\275\241=\324=\304G\317\275\376\262\332\275\267\215f=p\276\316=\355.d\276\323\247\304=\273\303\200<gkt\275@\313\010<\233\004T=7#7>2\262\200=\327G\023=\213!\324\275#[\035\275 b\023\276\373\007#>Ca\\\275\007b5\276Rm\224\276\353\323L>\364\347\325\275\274\372K:7\344Q>\336%\323\275\302K\030\275-\276\335=[\357\r\276\332\377\265=7\333\333\275\311\231l<\334\364r>Vr\310\2746`\276\275\330m5\276\245$y\275#\256\227=\034/\260\275?\256j>\314\263{\270\033 \335\275>*\315\275\235(\262\274\022\nJ\275\223\375\016\276\035X:>[\222\254<W\242\023\276\201\301\252\276t\340z\275\310=\256<0\340\362=\302\346\003=\3135\026\276\272\343\301\273\223A(\276\232\305\356=\212J?;\371\2714\275Tr0\276\270\216\250=\342;\017\275\267\031\033\276{4\014><-\201><\242\367=\032\255\262=\315\316\'\276\201\347F<\206\030k\276\275P\001<\337\267\212\275\366>3\275\322qq=\353\277.\274\337#>\275cn\261\275`\367\216\274\365\304\321\275\016\267\241;\204\305\312\275\367\302G>R\005\362=\211\226\250=Wq\253\275Zt\033\276\365\327\213>\036\355\021>\257C\277;8MG\276\363Eb=R#\227=W\3568\275\024\325\363\273\000*\017>\334<\341=6Z\312<\365u7=lj%=N\242\n> gB=\017_\315\275\201I\324\275\270\375\032>2}\235\276\245t\007>4\217\227<Wh\326\275\210\242\"\276\270g\255\274\201\360\224=\260\013-\276\027X\032=\216\274y=\222\240e\275\017\0236>t\215\323=\027M\317\274\262/\226\275\346\024~>C-,\276I\034\214>\211\246i>N\345\014>\201\006;\276\260\357\233\274 \306H>]<\020\275 Z%=\022R\3418\334\320$\275E\216\230=W\353\354\271\332~\346=;\322y\274;\260\225>\r\000\205>D\321:\275|\234\247\2759f\t\276\255\363\'\2761\324\203\275\227\202\274\275DF\203=\016P\355\275]h\347\275\276\037\026>\202\006V\275\235\374k\276\000%\347=\313\027\365=T3\264;\025\331\333\275\"\351\342\275\023\375=<\004\335?>\037\241\327=\013}\306=\2329F\276\366,\344=]\220W>\030\244\362\275\204\tC\276\334\343\252\274%1o>\301\240\001\272E%\037\276\\#/={\202\213=\333\r{=\330q\t\276\307\034\275\275\\\223]\275)TV\276\202v\002=\371U\370\275\250\342\t>\321\245W\275^\224\332\275p\204)\276\033\317\311=\266\354\340=\325\033\376\274\231\375\227>\217Y\017\276\004\276\003\275\375\327/\276:m:\275\312h\232>\303\374\254\2730\027\311\274\252\274Q=\365<a\276\006\270\227\275\232\314\216\275?|\360=\305\227\006>_\367N\273\227\366l\275\340~\303=\314\036U>\026,$>\352\355\003>\274\311u=\344\313\031=\253\304\215\275\313\260\205=\177\200\016>\340\374\246=\022\251\203=}j\252\275\030}\0169\330\254\032\275\307\367\261\275th\263=\366\372\337=\216\304\215\276\326\255)\276\014\234\212\275\007\234\340\275\211\275L\275\241a\216>\325\301\231>\2375L\275\207\237\026\276p\253\264\2747\023B>\325f\254\275~\244\272=\t<\235=\234\005e\275Po\254\275`\367$\276\336\346m<<m\030>\305\222\'\276hi\202\275\250\307\230=(\347_\275\371\241\206=P\241]>\226\177\371=\007\036H\275\364V\217> [Y=\204\360H\275\367\351\356\2751\356k\276\222s\000\275\214J\306<q;P\276\360F\236<\360M\262<P.D\276\237}\216<\342\001\245\274\264\020\034>\213\362\016>X\3428\275YVo\275.\235\376\274c\rn\274g#\227=\275\243h>\272|\025>t\344\357<f\252\304\275\363\332\314\275\010\225R\275\247\223!\275\241\335 \275OY\205>\250\243\223=Io>>U\307\025>/\207%\276\026\020\200\275@h\022\2755\024G\276\nmD\275\317\267\027\276\024.\313=\214g\246\275\315\2736\276\305\373&>\311Z\220=\014I\t>\365P-=\274\262G=P\023t<\030\277\026>\271;i\276\000>\375>\260\267k\271\376t\221=[/\313\274\273*\010;\276\203\271<\327\202\302\275\254\324!\2742\306\016\276:r\355=\035xz\274\302J\256\274\251\340\246\275\273u,=\214\240\341\275}\372\360=\241\317\334\275\340\365@:\004\272(\275\226\000k=d \204\275s\210\234\275=?\017\275\206\270\010\276\0304X>l\340\007>[\0004=\031\025S=\031\235\337\275\212\010\017\276\351\342K>\214\323\344=\017\365\206\275\037\315\213\275d\362\356\275\032a\344\275VF\210\276g\360u\274\362\264\311=\253e\342\274\310\244\374<tW3=C\225\316=k\334\006\274i\367\354;\236Q\214=r\320\202\275\352S\254>\211[\030>H\247y\276\340\204\207>\354\326E=\346\257\263\275\352\321\024\276=p\201>y\304\024<\361\371\225\275(\021\034\275\021\001\253\274\r\242\273=\275,\270\275jzi>|\376i>`\352R\275p\006Z\276\226<&\274p\003\000>gN,\276`\r\345\275p\237\014>\252\376\216=-Y%=\373\034(>\363o\270\274\3611\242="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
