node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 8462276
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "A\371\025<\345\327\347=\261I\315<]\227\027\276\370*2\276\004f\260>\035\021C>]\237\346\275\302\023\214=\033)\264\2755\265\033=\210;\306\274e\334\322<Yzl=H\303X>\034\223\026<\375\367\354=\324\034\335\273R$\371\275N\220^<_\002b\275\203i\037\276_e\024>\003Aq=\242\366\223<\257\313O\275\334)Y\276 \315\022\275F\203\265<|\005\001=\221j\r\276\3113M\276S\036\027>\016,O\275g\332\177\274q\301\363=\025Z\200>S\277\'\276\346\223\026>\233t\363\275\236\344\240\275|\270O=c0{;3\037O=\234Pp>Q\022\031=@r\216\276\216\277\340=\371\310O>\224MC\275\3652_\276GK\020<\205\001U\276`a\242\274\307\'\233\274\206\013\230\275\367\023\326\275\234\036\003\276\237\247\240=<\211\010\276\352\003\233\275\377\'\007\276#~$\275\345g6=\241\326L;C 9>\037\036\275;\224\365a\275\254\306\036>\033\311\345\274w2\274=S9\243=d\371&\276\323\203\317=\3045=<\'\013\'>\223\220\373<\365g\331=h:\222=4\233\272\275\021\2570>\313\013M=\027\031\020\276\270\304\352\275\372Ap\276\013\351\201\275s\025\364=Nke>`zW<\346\202\207>\327\217w\276\013\2059\276:\177S\275\251\214\201=+\220\301>uN\240\273\323\223J\276\014\214\262=hL\r=\034\035\216\275)\330\371=B\224\017>j\002O\275l%;\275\2225\366;\027\274\253\275s:\245=\246&\'=\304\334\334=\033\343\276=IA\033\276\177\317\024>\273\216\r<\026U\025\275\254bE>y:&\276R\252\224=\n\020M=&10>9g?>uQ=\273\264\330\332\275\245\216\227=\250\305\310\275W\265\242\275\316\301v>%<`\276\320E\326\274\322V,>%h\262\274\304\374\261<\305-\301<\224\266\333<\351\316&\275\307\363\026>i\240r\274\365\352l=_\021\n>\231\333\375=\036={>\0103$=\375\2129\275\233\340\357\275\217\260\007=\367\002c\275\333\366\231=_\010\341<Q,\211=jV\026\276\241\235\021\276\376\205\014=\024\0009=Z\010Y\275\013\216\003\276\360i\021\275\024\374\327:\010\373%=mSR>|\017\337\276\002=\216>\263b(=\240\355!>\024~n\276[a\230>6\203\325=R\334\234=q\331\232\273\004\246 \275\013R\016\275-\340\017=\362\177Y\275a\033\230\275I\314\013<\213&\017>\305Ay\275\237\323\025\276\000\210\361=\365\320\360\275\006\026\314\275L\271\016\276\033\014\006>\376g\306\274\345H\363\275\236\036)>b\352S>\377\037\242>Ww\233=\214M\336\274\002]L>\213\373\366\2755O:\276\2761\211=\036\317\203>\266\244\312\274p\205p\276\245\374J\275\204\245\306=S\303,\276\374\274a\275\232\2108\276a\216\265=y3\202=x\267{=1\226=>@\t\226=7\224\006\273z\371\342\275n\332<>\036r6\2765\373\335\275\'\022\031\275\214\022\313<\252\2621=\023\357\335\275\251M\301=\223/\204=D\321\027\276dXZ==\337#\276\321a\010\276\375\001\r>-9\010\276\',\212=\001\320\275\275U7\343\275u\321\215;\265\007t\276\366\021\330\275\250x\n>3\355>>iP\327=\304\031\324\275|\302\020>\364\213\177<n\3302\276=\370\261<\337J\013\275\373&\034<\205Z/\275\005\352\206<#\"9;\225\356$\276Fb\023>\345\223\315<%*\256;\340\206m=&\255\001=\343-\230=u:\374\275fW\264=\222\271\307<\313\352\265\274p}(>\r<C=\201v\261\272\326\201!;\310\265\240\276\004\327a\276B4\025=\302\302\217\275\017U\024\274\2353.\276\007\024v<\025(\306\275A7_=E.\305=\025\242\232>\307>N\275\374\313\006\276@\0210=\310\223K<pKf\275\254\252\221>\306\260y\275N\021\332\275D\205\242=\222\345\330\275\203\215\\=\355\277\207<\277\266\'>)\361\212=\3668\205:\377^\243\276\212\352)\276\253\362M>\271w:\2760!\026\276\037\272[>\177\361\203<\231\233\033\275\332.\211\275b\017\202=\313s:>\331p\001<\231\251:\273\211\341q\2755\235\223\276^\265\024=\276\205\201\275\224A\372=\032\322\241<\253\335\031\274\210\257\207=\260)n\276\217\3551\275\357\221\032>\324\230\370\275\274\231\036>M\343\003:^%\336\272\010\255\035>\2137\367=\362\261\n>\0076\236\275P\270\366\274\365P\020>@\303\356\274\304\t\010>)\251\272\275\215\277<\2744\372X>\246\301\331\274_\375\235\2757:!<\032\"\270=/n\302\275\207\302\325=Z\376\222\276|\341\336<gx\371<q\2419=2H\004\275E\236q\275\215B\217=r\227=>\277d\027\276\252\023\263\275\245\366\025>\252\214\203>\315Zb:$\020[>\225\177^\2740\017}=Fy\000>H\327\236\275\206\375\033=\220[\213\2751?\350<Y\030A\275$:\273\274\356SV\274l\n\006\276\251\241\306\275L\244Q=\351)\240\276\327\275\247=\346c!\276\027&\305>\320A\300;\021\020k\276\247\336\356\275\351d\253\275\351hL\275!\226T\276E\035\271\274\216\251l\275\317\3039\275\246J\357\275)/\n>\354$\370=S\365\267\276\233\330%\276\203\216\237\275\315X1\276\365%B>\022s\325<_p\374\275#\034\236;=K\305\275x\200X=\215\3279>v\242G\276KC =\007\0239;0\332d=<\177\\\276\263\216]\276#\263\333=\370w\227\2754d\024>\020\033\215\275&\253M=\260ze<\361o\233=/j\243\275\021\030\336=\3534\374\2758\215\355=\301.\204\273\3057\224\276\201\233\233\273q\217.\276#\342{\276\334\376a\274\271\234\002\275\302B3=\020\027J\275T\334\n>A\n|\276\201\253=\275\034\277\002>\035\253\317=Q;f=:O\207\2756\247\177=sG\370:a\253\001>^9!>c\262\321\275\020\365\313\275e\256\266\275\013\001\036\275\366\221\246\275K\327e\276eh\224\273r\245\034>chj\276\355\253\006\276E\253\364\275v\273K\276\331\014\313=U!\330\274_\rx\276\005\316\333\275\371\324\266\274X\360\004\276\325\024\236=u\244\006\276v\341g\275F\314\365\275X\273\313\275?\034\364=\274\340o\275\315\014\236;b\031\307\275\324\rr\274D;H\276\347D~\276\300E%=\230\265\232\276\316\223\345\275\336\321N\275~\244\025\276@\273\313=\376{\340\275\201r\005=w25\276\211\302\016\276Ms\253=W\206\301=\360\301\">\311\030\331<w\3259\276rU\224\276\024\212K\275\342\361\277<>s\234\275\366\302\226\275\245\177H\275v\300\326\2753\321d=b\201\313=&\231\357=\213,5>\001\336@\275\003WS\276\002\231\245;\232\214\017\274/\2526=\211\336\001>,\014\316\275\212\247K\275\212\243\232<\320\230\252=\267\025\276\275>\252\316=\030[[\276\322\264\223\275l\265\034=0\340\344\272J\226\234\274\310\3728<U\341\025\276E\025\267>b\200M\276i\367\230\276\315\326\n\276X\316\002>\226\2321\275\346\330\256;\025?\234=p\206\201=\322\"g>\304\252\242<\251\247\334\274C_\214\275\355\343\355\274\311\002;\276G\225\001>H\267\247<\320T\031>\0327\013\276+?\230=\201.\247\2769\212\330\275\024B\207:3\332N>\0015\220<\025\312\020\276N\\\265\275\020T.=Ck\200=\253\376\276<\024]\322\274\001\036G<U\336\014<\362\224v\273\244\010\233=\203f\246\273)\236\014>\336\252F=j\240b=VQ\307<\031\324F\276|\327\320<ga\"\275\376\025\374=\345M\277>J\3547=\240l\266=q\360\366=\2210\201>U\370\201\276u\275\314\275\344\327\236\274\314-\'=\263\024\005\276N\237\265\275Q$-=\354\0160>:7\332\275\310`<\2753\244B\276\345\350\305\274\267\337\374=nw\337\2756\224\'>T\270e\276k\3731\274Uty\275\215s\255\275\213\201\362\275z7\t\275/\024>>d~\027>\025\305\006\276\327\"\245>\243\2243\275\032\212*\276\335\334K=~h\236=Ob\241=.\026\t\275\354\251b=$\365y\275\211Ds<7f3\276\037\243\312=\016\245^=\262\r\t>\222\007\301\275\222\345,>\226\273\036>\001\217\355<\215.\\=\017\255X>\374\242\236=;U\362=\213\033$>\036Y\037>\215^\243=\2073\231\275b\251\255\275\030\355R\276U\001o=\346\340N\276b:\347\275\021\t\276=\004\213E=6.\265=\375\037\016\274\005=\036>F\263\034>\336\334(\276[D\347=\320\256\207>\'\372:>ni\027=\240E\350=I/\020\276\316\\\300\275\302\023\203>\225\206\253\275Y\2551\275\237R\034>\232\363R>\216\316\007<\312\'\t=\027\340\253=\020T\213=\236#\224\275Y \213=\305\371E=\351\"t\274\300\366\242\274\256\341H>T\004g>\367(\206\276\354\376e\275uL\317\2757\307\r>\215;\326=\256\271@>S9\216\272g^,\276\352\335\023\276\032\311\265\275\347\255\256;\332Rz\275\354\037\211\276\023!\347\273\247*i\276\370\n\021\275\264\363\257\273f\327\004\275s\3350=3L\014>xR\251<\313\332\300\274E\036\230\274\022\307\001\275r\337\364\273\354\307G=f\334\215\275\326\325\345=\032\353\210=\324\265n>y+\351\273\364&N>\370\t>>m\363\264=\335X\030\276mgP\275|@\005\276\037v\014>\266X\310:Z\327d=[\346\250=\"\326\200\276f\341\251\273\326E,>.c\271\275\034nE>uv\020\276u\3505>B\023\354\275\001L\r\275\024\340L=s\'\247=spy=\365\357\200=&\213\036\274(\377\021>\272\235\r>xP\003=\254f\220\274;a\262\275\344\221f=\305GH>\277Y\007\275n\3505\275h\016\202=\341-=\276\316i\243\275D\325\356\275R\342\367\275\352\354\334\275\223A\326=)\020V\274\260\310\330\275j \002\275\037\234\306=7o,\276\235$\010<\331<\231\275In/=\242\364\252\274\317\367x\276r\361\r\273R{D>1X\246\276\352\356U\273\300\216\304=\326\212\350\276\r\207\227<H\032\220\273\241\323\311\275\364\202\366\274\2675\027>\305K\234=\225K\347<\357\027\222>?\214\317<\212\3215=\326u6\275R\324\262=\377\3221>3\241\234;\221\225\312=`M#>\r\216\264=B\302\r\276\024~6<[\244\314<7\231\022\275+~\032\276\014`\362=F}\200\276~np>(\261P>\0336*>%1\252<\364\031\210\275~\342\267\275}\323\271=\343\371\217>\324\331\276\275\2720\327=;1\336=\013\343]<\351e:\276\264\331\243<\350\227\202\274\312\304\357\275N,6\275. \177<J\333\005>\232FY>O\202\035>\211\371\234\274=\375#>+\013\255\275\005W\030\275;\227\346\274\273\211c\275\355\255\016>\333\201\352=N\334r\275\333\3101\276\322\267\366\275.\256\237\275\363!\335=\010\252\002\276\r.\252=\310\027\022\276\316\332\313\275d\352\014\275\304T(>`\235\032\276\240m\217>\035\020\362\275\010\267\220\275*\275\207\275\263\220/\276\230\320s=\002\032`>S\245\n>\033\000\305\274\205\230]\276\220\377\246=\232eq\275f\203\006:\363\'\301=\212\317\300=\025@\331\275\220H\240>\347\357\"\276w\253\203\276#?\013\275#O\n\274\267\032\271=\372Ze\275\216=\214\276\221;\r>&U\016\276\217\'};\263co\276?$\342\275\007y\231\275\251u\006>\227\345\220>\343;\313=lA\320\275E}\001\276\210g\300=\257 \311\275\374~\000>vN4\275I\254\374\274\233=\327=\0248\007\276v\314R>\010r\033>S\340\033\276\321|\034=\303\225\333=\014r\362<\346U\223<\030\365\002\276\217+\230=\022\356\370\274\233\357\010>\364\274#\2753\345F\275\305\230\252<\247\211\276<=\314\005>\321\n<\275\220\2272\276\r@\237=\344\274=\276\346\303\204\274O!!>\213\226\347\275\005\301\255\275\336D\372\275T\375/\276k\311^\275\354\361\276=\0241\302<\\\357l\276\030/\202\274I{\305\275/\377\'\275!\317\300\275M\211\232=K\223\357\275m\257\225\275\330\014\364\275#j\267<\t\254\275=\376d\001>/;<\276\263\222\230=4\001<>8\276\240=\001\335\033>\353\364\366=\212\027)>\311fQ\276\360\010I=\004\006\274\275\301O\236=X\304r>N8\217=+\202\030\275\2439q>\034\227/\273\214qL\275K\352\233\276 \024\352<$\344g>-#\324=I\\t=\355\314\333=7\334\342=O\364\353\275\307\3061\276d\002\230<\370\367\354;\231L@\276\314\235\t\276\332tM>\016\000\316;D\305\024\275T\037\215\274\005\0248\2766\343\237\275\316\221E\275X\313M>\032t\266=\301B\332\275\350\347i=3R\002\274\351\350`\274\260\210+\275Q\264\025=\257\215T<02\377=\262\ni\276:x\230\275y\232\317\276V;\212>\223Ef>\365\273<>Ko\362\275D\010\322=!9\027<sF\345\275\250Q\257=Y\315\003>q\330\341\275\367\231\311\274\346\300\001\276\003\236\242=rZ\021=x\205\007>\'\234\316\275\303P\363\275c7\256\275\3044\211\274s\244\005\276\007W\240=U\025T>\327\325->\350!\356\275\275{\207<\217K\\\276\002\321\272\274\355Y\345=\327\243\006\276y\177e=\003\300\227\274O\365)\276\027t\363\275\252ES>LM=>K\372Y\274\005\016V=\3146\316<\364\317E\273\230\226\017>\025\344\351=\303\353Q\275+\220C\276\252\242\\=a\320Q>\306\226C=\026k\035=\033/\022=\336 >\275\365v\026\276+}s\276\342Q\242<\356\340p\275\026Z%>/\216Y>L\021\233=\277\343\367;\024]n\276\203\270\273\275\366\'\326\275\017\203]=\213\361V<j\300\230\276\233l\360\275\221\322P\273\221\267\330=!Y\023\276\303m\253<4\\\361\275\304\200\354\275\353\265\301\274\325\212\375\274\027\353F=\260c\025\276|c3>\227\327a<\350\025\253<\026.\374=\302.L=q8\013=z\322\253\275\345\205C>a\002\232\276\307\n\310\274&\306o\275\244`}\275\252J\246<3\241U=\307\353\036>76\236==\364G<\213\023\237>0\3214\276]G\225\273\354\326\265\275\304\357q=M\370\037\276\307\253\355\275\336Zl\2768O\320\272q\032\026\276\333\331\304=Zj\365=\243\267\311<\020\203H=\026%D\274\213\224\365\275\350\215s>\213\310\303\274}\250s\275\351\3750\276)\355\225=\036Wu\276\355q\037\276\266\257B\275\014\t<=\010e_>\2720n\276r\321\273=\252\244b=\204q!=\177tZ\275\374\275\332\275\217\3706>:7\360<\236/\315;{\200T>\337\333\354=Sr(:m\032W\275\214lD>\362?\001>@\245c\274 }><\316\'\227<\331\'6\276\260c\037>\013\224>>-W:>\345\304~\275\335&\\=\215y\363;\206\263->^\227\200=|\025\225\2759{\027\275\214\244l\275\327\305\377<\tk\365=\227\315\031\276\321\353\022\276y\000\037\276h\217\305=:3\330>]\247\263\275\267\274\356\275\324j\215\275W>\211\274\352\222\331=\227<L<y\341O\275Sa\344\275w#\013>\313\362\001\274\351/D\276I\341(\276\371\247\022\276V\003\013=1\212\275;Q\254w>Q\220-\276\243\3460=V\225Z=i\t\006\276H\215\226=\321\337\013>\341\375\014\2758,\016\275\010\007q=\223(\310\274\201\260\212\275\305\225;=P\351p\276UjL>\373\242\036\276\266\355\335=\203Tl>#>\007\276\003\014\021\274\323@\r\276\233\r\017>]\275\036>\2535)>Y\003\013\276\311\210\275;B\275k=\230\370k\276\256\001\212\276\027f\313\274\334\260\205<+V(\276_r\335=e&\367=\362]%\276\356\317E>`w>\273><\030\2763\334\230\275\004E\315\275\002PL\275\205\025C\276^\\\3019\307{\242=,z$;\027\311\364\274\233\"\260=\322io:\255\350\321\275\t\316.\276\376\303\206>\330\0077\274\243\362\212=`d\266\275M\330I\276F\n)=I\310\004>\035\226\036>v\204^\275\022\260\226\274\010\3101>.\013\232=\272\'8\275\215\367\014<\357l%>\016:\026\2761\271\013>\345\374\332\275\3679\335\274]\351\350<\000\271\302\276\304\013\231=<\263\225\273\27352\276\243\253\274=\2051\213=^\026\006\275w\022c<\371\327\377\274E\303\212\275\340\020\341=N\352#=\026\t\373=)\200\331\275\244\325#\276\014\332\210=\377x\264\275\227]\347=G\370\336\275\205R\213=\241\312\355<|\367\'>\344\323\331=3\274?>\351\220\322>~\307\241=\010\342u>V\216\272=\263)\324\274!\275\037\276\311\315\210\275\0071c\276\257\251\327<eF{\275\2069\024\2761\204\t>\341\372\364\274h\246}\275\201*\\>\031^\345\274\037\355\001\276E\220\020\276\346\314\221=>Q\005>\031\232\361=xh\246=\373\345\202\275IG\365<~!>="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
      s: "output_ta"
    }
  }
}
node {
  name: "net/zeros_like_1"
