node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 459140
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\350\371\327=z\320\276\275%\336p=\232\231+>\247\254\265<W\027\246<}\233\350\275>\036\212\276Cp\241=\343GC\276g4\220=\330\314\201\276\362\367 \276\331\320J<\357q\243=\355\001\206<\017\351\215=med\276\206\271\213\275\032d\203=up\031>\371\263\315\274\030\t?\2740}\240\275\3037*=\363\253t>\027\261?<<\313k\275\2667\272\275v\020\352=u=\225=&\371D\275T\353\005\276g\311\326\2758\236.\276\304[K\275\353D~\276\002aX\275\253i\337\275\227JA>\310L\366=M\311\t\276U\366n\276\t,\263\275\323\224\003\276,\304\t=6\250\022;8\314\234>\377\036\n\276\360T\001\276ig\241;Rn\220=\364P]=\234\0363\275W\032)>]7\230=\331K:\276\233\023u\2758!\026>\340\206\030>\372$\035=\364+\001=uvx>Y\232\024>\264\267z\275\203\370>\275\332\336\027=\\6!<\001.\000>\215\265w>\221\360\317\274\356Tc>\245Rl\276a\032\305>\203\361\247\273Q\037\221=8\230\377\272\376\217\034=\240\025\375=\333{\225\275&\033r\272K\271\377=C\336\212\275Y\377E\275\310\301\026>\211\315?<.n\223\275\313\257\317=\245H\030=\371J\203\274\242=s>\300\302G\275\260[S>\031\273\313\275\215\030\007\274\026\264q>\267\207\217\275\336{M>\000\317N\275$\373\001<\347\316#\275\003\331\332<\254t\207\274P\206S=D\333:\276\356,8\275W*\266\275\351b\312=\223\337\342=\273*\235\275\367\3113\2768G\016\275<ZN\276nz+\276`-6>\357\222\025\276\225\254\"\275\271D\334\275\245|E\276.\202\344<\245c9>\243\014\313=\274\226\202\275\257\006\257=\277d\004=2\036\024>\324\020C>\3139\007<H\007\036\276f\254\252\274\'}~\275\363\311\244\275\251\216\023\276\370\025\345\275TL\342=\324M\3276\245\353\224\276\234\270\266\275\362\203N>\264!u<\216C\241=\333\035\302=/\356\305\274\323\313z\276\312v\263=v<<\275\314e\316\276\366\230\304\2736<\305\274-\377\037\276\266\225L\276\233\200\373=\034d\304=\202\017\013>\344\235\273=H\250F=^\251B=\302F\n=H\001h\273q\'&>\360\242\214=\211+\033=\202\027\363<\353\'\032\276Z\311\241=\033\312\301\275+\037N\276`_\'\275B\035k\2719\"\001\276\316\201\010\276\260\306\375\275\357\262\031>_\026O\276\325\022\255\275\350\177\235<%\334\216=>\234\023\276\363\351Y>\331\373\0359|^\212\276);\357\274}\035U\275\242\254#<\310\230\261=\355H\027\276h_\031>\305\331I=\310\345v\275@\2517>p\331\003\275=\302\235=\303\362\234=q\2141\276\276K&=\253\241\267\275\377\347\341=\377\017\333=!\254\306\275ai/>8K\320\275\350\236\342=\022;\235\275\300|\025\276.\341\001>D8\260<\017\005\343\275\004\035\256\274\022\022\231\275\275\\J<`\313V=\317\351\306\2763\243&\276\211-\235\275\3412j>\237\256O\275\254\307\007>\252Rm=\326\377M\276\212\177\006>\"\224]>\006^\330:\275\257\342\273B\335\261;\317B==\330\310L\2764\017\207\273*\272c>\365*\323<\022\356s>\0033\253\275\262\006E<\2026#\276\007\210\n\275\002!\220\275\202\251\246\2757\211\276\275\315\237\033=\027\371;>\223;.>\323\027f>\264!Q>\307g\013\274\006\221}=[U\201<\251\245\372=\013\367\257=\322\224\003\274\312j\331=u\343\332\273\013)\245\276F\351.\275NoS>>\344\311\275Bu\366\275\346\346\234=!ai>\230\364\323=\253\036?\275\347\232\347\275\235\332\205<\333\250\212\274d\336\022\276ix\n>\273?2=G\270\354\274\257\330A<\216\377B\276KD\301=C\254\301\2754J\212\274\031\205>=n\245\203\275\002*\002\276c\232#\276\327Kk<uT\207\274\353]d\276\373\366\250\275[s\322=-\370\245\275m\363\331=Lm&\275\342\314\216=\240\276\305=\242\274\267=!\363\253\276\031\363\302=qa\365<\3521\263=\345\010e\275l\006A\276\306=\242\2752\256\031>7A\224\275\301\035\210\276o\3544\276\'\372k\276\277#\200\274\341)\026=\275\333\">:do=A\361\261=\201\013\257;I\3368\276\371}\000<\351\2203>\367-*>V\367\260=~6a\276N\r\301\275\371\364\013\275!f\006>\314\346{\275=R\242=\355\275\032>a\202q>\372\312\264\275r\344G=\344\376\215<\027[P=9\223\365=\222\355\'\276`W\203\275\2322\356<\372\362\246\275\360\2714=\360(\202\275\313\3365=1R\321=\202b\327=\321n\200\276\260\200\200=4\366\007>\204\274|>\260\272\035\276\266\246\025\276\266z\262>A\243\216=\005\265\003\276\331d\307=\315\004\001>c}R=\001\023\023\276\345v\352\275\335\n\303>\234c\211\275\204\273\377\275\246\003\340\275\234{\223\275\327\2075=\217\"i=,\263\242\274H\226+\275\372\232`\275\177g\315=\357e\360\274\334\307s=\351\326O=\2378\341<\235A\353=Oz\223=*\271q>\356B\226<\221\330\203>\361\t\251\275\212m\036>\260\324&\275\032\225\244=t\207:\276\274Z\312\274\253&\255<E\277\362\275\361\266\332\275\371\304\"\275Oh\027\276+>\365\275(\220\306<\n\270\203\276\271\022\253;\303\224\376\275\036\\\316;\225a\350<\275 C=)\304\277<\227\277\305\275\352\177\376\275\373\230\245=\325@n=\343\324\343<X\005\010\275\227S\223<|\000\220>80\021\2761\027I>\263\317K=\032!0\276\220\330L\2760\242\261\275\262\305>=|\352\026\275\323\222\001>\0254H=\303\263\216=\022\2434<\212n\244=\201\206!>\315\027W\275\237\362A\274\354\233\343\275\330\360\n<\221\365\212>K\214~\276\215\363\223>\343AF=y\323\341<@\211G>\036\303\330\275{.;>\313\362\211=\273\307\257\275\344h\260\275\320\nb=ZB\337\275\220\336\035>d2\235=%\010*>\266\032\276=5\257\016>h\030\010\275\360:8\276\270\001c\273%\271y\275J\302\255\275\344\264\214=\365\266\014\276\3000/\276\345\005\026\276\356\271\016=\227\016\017\276\220L\020=\325\221\355<l\202\022>\352l\236=\321l\305=\332\263\370\274\267\212\023>\246(\336\275\336\361\023\276\215\243\t\2750I\201;\252\217\273=\250v0>\020\na<yS\231=\347O\345\275\214\311->\037\220\255;\3163\245=\232\366\332\2741\247\\\275\270[7\275\376n\353\275Sc\366=\220\307\224\276\350\326G\275\206d(<\240\222@>\273d\236\2764\301r=\330`\274<\3560\353\2752\363c\276\207\204\243\275P\2268\276\270p\334=\032\364\225\276EV\204<,\251n8\302\241\246\276\317\252\221=\361\302\252=j\322j:\3600(\276\346e\302=\346$\234\276v6\356=\n5\337\2750\\$\276\352\342?\274\205\227\236\274T\233\013\276\376\211\234\274\000\214\273=\247\360w\2766\232x=h\335\254=\026\004\204\275\212\323/\276\004\3613\276ZM\340\274\25350>\346\224\237<\035\313\227<\014]7\274?Pd>|\243!>=R;\276x\017\027=4\031\343=\366j\242\276\005\t\242\275\220v\210\272\352\357\314=\262\207\253=\276K\305>\224j\027:C\2137=\273\363\240=\214\021\273\275\005\2150<\004y\363=S\200%=\307l\372<\251\342\314:`L\031\276\375\353e=\215A\322;A+X\276qF0\276h\221\312\275sf\352\275\365lb=\006\024\364\275~\361\320\275G4\277\274\323E<\274\267\211\212=\263o\220\275\017j\'>yy\025\276\225\004\'\274z)\007<\"%B\272\024\336k\276gA\362\275\343W[>\304\363V\276$\274>>j\215\244\275\254C\204\275\306i\001=\234H\345\275\246\030\240=cl\314=\316\305d=P\341g\275\257QH=\320NZ>\276q\314\275\253O,\276P\202\331\275wQ\265=z=\232>F\264\277>\210qf=}\'\262=\201QI\275ch\321\275@\203\003\275\300\225`\275\321\031\">\006\202$\276\2448\007>\211\234\201\274\226,t=\365V\207\2752\230\271=I\'\036<\230@\343=\236\205S>V!c<\177\024t\275a6c\275h\314\022>X\244\301=\333t\362=w\243\363;\320\257\370=\0102\215\275\224\001\213=\033-\007\275g\341:\275}V\364=\t\253\030\2768\375[\276\251E\006>\365\026\020>`\353G>\001\251\023\275[\375\231<\027\343\000>\023\217!\274\032\313\202\275\263`$>\367`o\2754\232\313=\376q\217\275\020\225X>\304\037\311\274\n\336W=\035\222\000\276\371\337\263<\n\027:=\021;\357\275\301\220\204=\374N\254\276f[\026>Kz\214>\335\203R>\217\220Y\275\000\207\266=\321\377#\275\337g\342\274j\217\231\274S\354q\275\004?<>/s\307;/\033\001>\005=3\2767\224\013>\327\344\260\275\203\006\037\275\025\030\002=\200\343\004>\263\r\371=S\371$\276sD\272\275/\270\231=\251\373\362\275\304\273\315\275\221\016\002>\361\232\200\276\272I\303\275!O:>\377O\257<Dx\305\275\317O\023>#\3458\276m{\230>Q\037_<\372#3>(\037U>\024\352\315\274r\311\336=\216H\037<\023\342\352\274o\307\325=\302\236\235\275EG\006;\376\354\270<\351\366\237\275*\335m\276D]^\274QI\000=\223\256\333=\374\001S\275\315c\204<K4\006>Jto=\254v=\274\202\361g\276\247I\004\274\360\371+\276\033\262\031>\372l\027\276\002-\370<\241\350G\272\rL\240\273\322oQ\276\200w\324<!\220\200\276\253)\347\275h%\352=f\254O\275&^:>\272s<\274\310(\307=\206\256\220>\302Z\261<\305\376\026>\006\263\207=9\244\201<V\"\372=.zH>\2708\211>U\025\341=\\\377M>\207\347^\276\005_d>\265\361S\276\0304+>r\240\334=Y\230\210\275\323\306\026<\246\212p<\t\037\r\274\312\366\300=,\2533\275N\233==\356Q\224=^|\334\275gN\003\276\n\326\262\274\304\351M>\\m\256=\326i\327=|\220(>\235\332L\274]\235X<\371(\231=\351\206\217>\270\363\303<\237\210\245=\362\033K\276z\375\210\276\003\270\n>]*\214\276\032H+=1\374\005=r\206\036=\212\322\300\275\341[F>I\303\252\275\034\244\200=\372(\025>\272\220\013\275\021%q<\374^)>\326\035\331\275L\323\320=J\r\301\275\352\3734\275\255\316\023\276\251b\324<P]\022\276\020\326\217=Fi\270=\226\355)\276fD\214<$>\005\275\003\302\231\274\323\236\214=\317\371B\276\35547>R\210a\2751\357\320\274D\251\243\274\222\002\270\275\316a\003>\353\246\251\275\314H\000\276\315\244\226>\301\000\247=\223\243\243=\201\220;\276\316\334\003>\355\224\326=#\371h=\254\034\225\275\027\021\021>f\211m\275\274M\025=7b\315=\362r>=/\207}>A\024\020\276\322@5\275\202\354]\276k\340\000\276\007\306q>\353Y>>1\344\">z\377%\276\241\313\001=\242\313\315\276yzW\275\316~\r\276\004TN\274\342:s\274\315\273\245\274\275|\272=}\213m\275K\330\202\275\301\347#=\345\262s\276\n\256\034\275\207\362H\276\324\302\021\276\252\"\201=)\304\246=[WS\275K)\026=\321\274\356=\026\032\027\275\033\037\322<\332\300\247\274\262F&\276Y\014\316=3\321/\274\264\337\206>k2\331=\240(9\275\242\370\025<\222\303]\275^\217\t\275\226\2301>\200$\232={\334\034\276\351\274I<E\006S=\202\017\321\275\024n\324\275\352\233Z\276\260\326\261=vmb<5\314\031\276\275\362N\276\2773t>\276\210\014>@\204\020\276\275\363\253=!\0030\273\036\025\006\276\336\253\004\276\247r\362=u\266\266\275\320\224\322=\014\224\034\275\356)\363\275\343\320\274\275\263\263\346\273\006\022\224>\177\301\037>KK\010\275\262\374\313<J\3301\275\234,v>\244\320[<\034\021\214\275\252\217*=y\200>=Du\275\275\303e\r\275\222\177\200=#!\255\275.\036r<\242>\335=\211\006\247=\333\316\323\274\263`\004>\246:\364=\236*\007\274-m;=\321l\317\275\307\267?\275t\225d>Ry\341=lY\263=\035\237\233=:\340\002>uP\213\274\316\013\266\276\361\022\320\275vu\343=\274\213!>\234N\277\275\023A/\276\276\323\r=\376\236b>\232\355\021=\301\273\223\275\232d\377<\267O\027\276\037Lw=M@t\275B\231\037<?O\334\275\301\277I\276&{\240\275\320\242\207\276\332\261\212\276AQ\\<H\335\323=K\203O\276\031\364D>\033\324*>\207\244\272\275\273\024\276\273\2452\336\275\340o\214\2758\023\253\276DU\304=a\376\205\275\021\363\213=\245$O\275\245-\215>n\031 \276\340fu\275\275\370\236\275;\245p\274\255:8\274\271\354\363\275\314x\217><\323u\275\222}1\275\223\321\245\274\364L#\276\251%\031\276\264-\216=\242\217\277\275\026\013S\276\2538\253\276\353\306\216\275\336\0263\274\214]\210\275\263\000\273\2752\246\201\275yZ\210\274\324\212\231<%\346\007\272\357s\351\274[\307\t\276\336rO\275B\213\312=\344m\030\2768/\333=j\315\240\275\361\2153>\2627L>\026{\032\276@<\324==\326\270<9\214\210=\220\020\253<\t(;>\033z\237\275\010A\335=\274\320\236=\374\227\305=\227\200\255=\340\245\t\276\022\333\004>ihG\275\'=\365\275\304\210\240=@\"4>\224\276\213\275\342\340\205\276\225\331\334;\277f\347={H\220>i\277\360\275<\347{\276,\346\345=)+N=m\313\301\275\214\315\217\275yNO>\242\"2>\264\264\251>J\357d=o\323E;B\244\225\275A!\014\276u)\260=\3063\201;\311\345\265\274\262\334\372\274y?\223=\261\367$\274\347F#\275\341\323\344<Y\204U\274`\3712>[dH=l\250\021\276\240J\215=Z\371n\275\242\346\230=\"\230\017\275a\350\007\274\316]\217\276\203\022>\276({`<\314?\241\275\373\233\377\275\274\031\364=R\232\356=\265\023_\275\337O\'\276!\252_>8h\027\276\213rA=\233\231Q\276\357\3030=\\Z\220=\210$0\275\212\203\234=\323\004+<\014\214F=\220\211\203\276\nM\020\276\007\r\253\275\242\276\344\275\202\330\014>\002\201\006>\235v\014\276\227@\036>\354.\204\275\323\343\n>\254\205\037\275w\342\253\275\257\034\017\276\314?\212=\3350;\275b\304\304\272f6\200>\351\357\323\274\317\302U\276\340rw\275Dm\205\276\327\324Z<\310Hg>`d\221>\005Q\205=\"\',\276 \277w<\373\340\030\276\207\035\225=C:\234=\336\014^\275\372\016\032>=k%\275\335\007)=w\332\247\275\211\200\325<J\"P\274,_\206\276\310\323^>\341\034q=\241\306\345<\000\241\313\275\374F1\275\031\031\010>\034G\366\275T\205\206\275\371\205\020>\355\255\241\275\032D\247\275\2735\032\276_s\304=6\211\217\275tR\005<\312h1>\017\246<\276l~\205=\200$\216\275\371E\315=\242\030\224<\013\266T\276\271\0202\276W\206*\275\215\247\004>\2043\014>\007\004\226\276\243B\202\2753\020\247\274\256;\317\275\235x\375<Y\037\232=[0\206\276\366\344%>A\340\270\2759\277\231=\303\255\337=Jz\026>\232\305\n\276\333\345\223=\341\313\215\275\212#\006>\274\014\025\275\353w\036\276\032\235\215\276qC\000>\363k\303>n\223n=\2659\244=\036b6\276\304\342\035\275UF\370\275<\345\337</\030\314=\344\034t>\201\032\212=\\\224;\276\261\000\261\275\016\014\331=\225:\270\275yJb\2757\016\017>%\000g\276\245\025\330;\376\247\333\275\026M.\276\361\242\034>\021\254Z=\371q#\275\225\343\024\276c\234\010\276P\337\217\275\304T5\273\2461\006>\333^u\274\213\246#<!\025\017\276\214l\025\276\034\t\003\276\345\355N\275,3\216\274\335\235D=\235g\240\275\246\006F>|\301&\276\325v_;\262^w<g) \275\032\221\335=\343\347\202;\270\223\204\275a\240>\276\177\265\224\275\350\354Z=\215\030\363\274-\"\345=\321\320#>!\3246\275pw\267\275\370Q)=0p\311<\221\346\312<\234\347=\276\225\247s>\233 y\274%\360\204\275\002\321\252\276\247\216\331\274\007\217\032>\263\244\235=\210\374Z>\234\204\221=J\312\334=t\t\037\276\263r\023>\254\0308>\226\261\236\2746xf=\215\354\341\275\223\224\270\275\263\311\276=7\357\371=\224\302\005>\361\212\002<\2135^\276S\027\356=\203\3010=\301\365\226=\320T\257<\342Q\216\275\346}$\276\272\027\332;k3\202=\324\013\300=k\261\240=_\337\357=\"\231\227=nR\226\275\325\016\375\274\360]\326=lt\365\276=`\371\273\317\347z=\263\243\305=]\032|\276\007\355\311\274\\Y\243;\364\324\233\275wI\231\274\373\324\201\273\372R4<"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
