node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 6750089
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "c\276a\275F A\276!\227T\276\356\006\274\276\3050\356<\222Pd\276\177\317\003=J\\\236:4p\343<4\360\241<\332\352\244\275\235n\243\275No\353=7DG>\336\334\035\276\265\251\263=\274\t\244\2742\254&=\013\340\262\275\035\014\264=\262\275\245\275Xz\234\275\273s)\273ZU\035=\231\014\343\274\2441\376\274\365\203^\275yB\304=\222$\346=\037\311\003>R\017\250>\226(v\275,]e\276\264W\213\275D\340\272=\',\266=\312W\252<\025\177:\274?\360\270=\r*\365<\023\305(\276\315\214\217>\252\337\217\276^h\347=\377\023\023>\245\316.\275\262\326e>UH\234=C\206\n=^\371P=\321[\253=PF-=\034\347\006=R\264\020\276\257\236\342=\356\203E\276(\223]=\306\324|<K\334\241\275\244\264\222\274]M\333=y\251\353=?X\221=w\260A=\">\202\276\302\022\304=\017\203G>\347x\317=\351\000\035\2768\342R=\323\273\337\274s\007\034\276\234\236&\276Hp\256<}\t:\276\313\002%>\370\200r\276\260\237u\276\350W\'=\241IW>e\024\226>\202\001=\275\roH>\264\262\227=Jd\242\275P3%\275\\\332\267=\375\336\n>\342\233O\274\352E\203\275\266\344\247>\362\266\005=o8\354:\031\216\252=\347\211u\276\240\307\023\275\016L\245\275\237\306\233\274_\351\273\274\0067\314\274\014|\212\275\255/\343\275\226\215\250\274\341\\\331\275\t\027\003>+\022\363\275L\347\221=\035\001\365\275\037<4>\024\036\363\275j\316\277\274\346\327\266\273\177\305t;,cF\275O\262$\275\351j5>\225\206\030>\263\255\274=\215\371V\274\340\261\256=9c\355=\235\253\330<S\230\n\276{\266\030\276\267g\023>n\253\266=>+x\276^\020\363;\302L*\275\357\006\005\276\r\322\211\276\331\203Q>\270xS\275\262\010K\276\346\327l\273\345\250\333\275\005B\201\276E\264\207\275k`t\275j\256x=x\205n\275I\035\257=\2215\030>\026M\017\276\332~\031>\204\316\201:\271\207H=\224\240\310;\256\361Z\274\253\275\360=\211\314\216>\212\020\217=\324KY\274S\2201>C\343x\275o\373>=%T\022\276\013\326\204;\212\202\355\275\376\021\236\275\207>K>J\263\260=\000\'\251<y\231?=#8/\276E(\021\275b3\211<Q\236\003=g\244\001\276\307q\'\276\"b\254\275=\252\032>\364\303\010\276\325\311\203>|\2467>&\2266=\026\201\001\275\004\375\206\276+l6\275\203K\033\275\0169x>t\033\014>+\315\331\275\3616O>\010\240{\273,\'\021=\2648Q>\022\212L\276\023\017\221\275\341I\013=8\330\273\273\0213\205\275a\262\000>\342\'\363\274\251\n9\275\370q\031>\rQ9<X\236\007>\341>_=\035H(>\231\036_\276\3674=>cu\t=\212\302P=\2333\016>8\031.\276I\373W\274\010\364\002\276\026\230q:\302\324\313=%\344\321\275\261\033_\275\215J;\276\214p\210\273z\335\371=\033\245\343:\000\235g\275\025\3376>D\023\261;g<\275;\020\2673=\243O\010>\331\243\262\274Nl\013>\212\252d>k,t>\224\276\364\273H\007w\276\365\316\332=\215#5\275`\014\020<\370%Y\275\354\235\307\276\275\327}\273\\\347\021=\332\022\363=\251P\255=\314\324\364\275\004\322\202=U\257\n>\263\0236\274\315Y\212=c\315\231<%\277\232=(TS\272\350\200\242\276Y\224#=q\314i=MJ\347=G\331\031=\201cb<Q\331V>`*\255=\037\1779\274h\217\013\276\303\330\317=\372\271 \276Rn\331\275%d?\274\354S\203=\235\341\273\275\'\373\226\275\357\031!\275+\002S=\035\037\023>\026.k\276\334\243\t\276\216s\247>\315\243(>\354K\240>\262.\272\273\370\003\344<6O\004=\362c\320\274W\022\371=\\H&\276\300\242_\274rN\035\276Z\334\226=3$\n>\336Ma>\377\237S\276\354\362\252=\362\226\277\275\320\000\207\275A\320\005\276\262(\310\275\322\227\001\276Qv\232\276[+\365=HF~=\220\035\257<!\242t\275\247\003\026\276F\272\313\275\t\211\215=5\374\002<\236\260\207=Dz\230=\234\210d=\343\000\363<\215\'\242=\302zo>[\235\027>nAJ\276\315\376\264\274n\250\263\2759\004,>\037\230\220=\340:$\275[\251<=\316z\364<\020\006v>\010\223f>*M\301\2742\020\220<\316G\207\272\327:\237\274\331\021\013\276,x\016>cT\331\275\221H\010>\024ay\276\302\031\342\271x\010\232\275<L\354<\270Q\342=4##\276N`\372=\360\301\234=\2204N=\0358\007\275\225Jq\275\003\225\264<\275?\277\274\214L\037>]\027\244\274\265#j\275A\333\264\276C\023\340=L\240\017\276[\334C>\274\363v>D\305\033\275\327x*\275\216\220\026\276^\277\346;\022\336\206>\363\232\323\275\253\266\204\276tE\014>\326\353\201=pE\255\275\210\212\000\276$#\322<\311p\033>\033\373\375\274\007#\227\273l\212\225\274|n\310<\307\004\343<\355\366\026>\030\370\367=u\265\317\275\200V3>}l9\2761\244A\276Wi(==\031\322=\307\276H=\216\215#>\267J)\276\315s\010=@\345,>\333\316\001>\236\201\002\276`\235Q\276\265\020\253\275G\270\237\270R\322\224=\033\020\314<}\2738\275k\317\235=\231\223\323\274\210[\351:\211\340\251\275\227\203\037\276<\3255=F\020\253\275I>S>\304l\005\276\224\022\262=\302O\201=\003D >2>\035<\341\331\036\276\251,#\276%\324\003\275\243\3474=\275\324c=\323\003r\276jNH>\216\231\007>\313\035$=b\240\270=>I\204>\331\273\334=4\025X=VK\233=X<\220\275@52\276\357\303\252\275g8;>\250\037\215>T\346Z\276a\363\020=\370\246\301=\2450\214\273{\336\206\274\320\017l>s\013\243=]\026b>\326\302\031\276\226\320\t\274\307[\343\275\231\302\314\275\035\"r=\3521\333\274sba\276\177\205\201=&4\">\304e\035>\0022\247\275Q\306\252\274l\366\311\274>:\271\273\256\354P\275%\342m\275\232\347x>\035Y\266\275\333\262#\276\241\267l=\2271\273=\234\243\221\276\345\023\356<c\312\353=\255\340\201\276\317\264\314\275\315\320\036\275j=\037:g7\275=\2058\037>h\'E\276\3263W\276K\306\253\274\353M\255<b4\006>x\343\315\273\314\342\341\274\300\371\214\275\033@\370\275\241\214i\273V\2316\274\'i/>\335\266\034\276\256\317<<Pj\007\276\253\246\021>\347\257\314\275\030\267F\276\014L\013\276\002W\244;\273\327\r>\206\310\205\275A\300\274=\262q\324\274\363m\212=J\213\231>:J\200>\007\205\247=7\352\'=\024@\024>&\330\327\275\203\363\372<\370\230\016>w\302\027\276\233\034\276<\201V%\276\203\007\230\276\215\010\373\275\2014\247<\301\316a\2759E\360\275o\376\026=,\334\016\276\277.;\276\323\355~<\261\371\005<\223\362\204=\020\210\306\275G\262\024<h<I\274n\321G\275L\002\032>Jg^>h-\215\276\013\314\375=#\245\017\276\377\304\024\276\216\265C\274\2130\251<\354v\323\272VT-\276t\352\251\275$\244(>\267\244\303\275\246\371\344\274\377:\000\276\004\315\347\275(z_\275\023S\'\275\321\236\017\275\251\377\347=\301B\223\276\343\354\257\275\202?\027\276s\371\036>\275\240a>\242\373\014>\305\372\033>\245tO>\277x\361\275\372\204b<gJ$>E\304\217=\211f\264=\030\377\021\275\005*\032>V\372H\276+\254\010\275\333\333U=\241W\364\275\210\030\026\276\234Q\360\275\234F\027<!\021\343=\207\254c\276\317\234\">\n\200 \2762\271\262\275\223\207\206\275\255\273\312\274\026\t6\273\027\t\323\275\222\230Z=\244\353\010>\326\376\366\275\301\024Q\275\270!\320=&+M>\356\247\342\275\240j\225\276\3300\222\276\231\246\036=\230  \275A\200\034=\021y<=#\346\016\274\014JP\276]E\327\274\231\001\025\275\304\210\230\276F\307P\275\276\002\030=\325,\243>\034\253\'>cC\226\275\034\363\224=#\342\340\273\330\233\327<w\354c<\270\373\035\276\374\244|>\207\365(>\0331o=\026*\247\275\251!\026\273\006 (\276hi\274=\277G\030<\212\006%\274\016-\t=&\330+>Y\256\034\273\0336q<H\200\256=\244\224\032\275\010\272\">c\352\n>\323\001\035>\316\340\242\275\230U\255\275\275\213\007\276\024\377\346=\026Y\331\275\022\315\254\275\315\332\331\276)yv=\355\217S<NZ\217>\017R\211\275\305\233\222\275\307\001\340\275\001^\026\276r\253\017=\027\016\310=m\244\300=\356\031s\276l\005\322=\r\206D\275\315\333\001\276\361\020\200>&3\t\276\245D2\275\357\027P\274!\207D\276\334\242\034>p\375;<_t1>\302c\025>\037\023Y\275\335\204\220<u\202\232<\037\273\330\275\253\177\344\275+\327\032\274\310\212~=\362\261\332=\027\002P<\n\236C\276\203\243S\276\031h.=S\356\261={\205D\2762.\313\274\026\202\272\275\374k\370;\261\336;\276\021\376\037>\303\362!=\305\366\241\275\220\026\022<C\003*\275T\347\177<)\202-=\225UL\2768\272M>\244\337\363;pe\306\272\211\215\226\275\337\347\223\276\001<\354=\204\313\367=\204,M\276\236\303\313\275\302\330\232;\377\023\250=\262\301X\276\020+\201=a\337G>\000\327\374\275\313AG\275\362\333b=\373\260L=\325+\013=\266(\326=0-)\274\227\267\"\275e/\360\275\271\215\311\275}f\001\275\252\022\353<\263\221\013\276\333\214%\276?5\240>:{h\276\216!\205\275\341\327\333\275 \332\225=\302\177o\276\343C\216\275\350o\341\274G\006n>\340\315\306=\227\355\007\275/!\024\275:\377\314;\024*\335=\014\357\205\275\372\372\217=\201ED>%\021h\275\362\252\033\275\316\375U>\265\262\305<-\"\203\276\354\0049>\353\270\t=5O\240=1\017\253\275SU\260\275;\003\020\274\303\253\027=T-\210=\256o\025>\"\356A;\350\364\301=T)\331=\243a\213\274\234\256\204>Bz \274/!\215\275\304&\251\2767|9=\314>\357\275!\311k\274\231\204}\275\001*\315\275\332\000\300\275\2437Y\276\327+\023>N2*\275B\274\017>\372\230\202\275\365\013\002>\323\366\343\275\326\264\230\276\020l\335<Irr\276\306\035\021\276Fg\031>\204E\365<\360\314\223\276\370\267\364\274\346p\241\274W\317K=\311\360#>\267\273\003\273\256\244#\275i\036\304\275\354\020$=?\376\023>\341\033\000=iD\242=\002\300\004=%LC\276\347r0>\270L-\276\370A/;\301\027\307\271\321\211\301=\2323M=\2021\234<@\226a\275\257\216\227=\372\017\242=\033\001\253=\022Y9<\254%\27591\3610\275\241z\243\276\201N\243\275\2650E\276\343V\217\276V\031\317\275\332o|\275\005>\320=\016\261g=.\346C<\371\261P=yC\271\2743\315N=9\307\200=-@\262\275\333q\241\274\376\0276\276\006x\275=\344\241\022\276eh\210\274\r\2666>XZY\275\014\"#\276\343d\016\276\3772\261\275\3212\240\275\373\307\004\276\325\023\253=\272\256\212=Q\027\251=\333\222h=\206\275E<,\375u\276\332|\227\275?\373\233\276\211\\\243\275L\262\237<!\350\227\275\026(\016\276\t#c=\026Z\332;\304.E\275\226\3729\276\027~=<\030\214\255=\214\027\013>\264\231\010>\342\237.\275\256\331\221\276\315(A\276V>\356\273\330R\307\275\237\230\r\276\200H_\275`\224\002\276\020?\211=r\201\002<GyA>\265\374\360\275~\"\004\276\002\365\376\275\256\nG\276K\025\302=u\232L\276+\264\377<W\3770\276A+g=\221h\316=Q\261\370\275\3442\275=L\207\256\276k\263\354<<\232\r=\351L\010\276\225B\016=\377\212\224=\361[\226=\267\352\034\275$\315C\275\364\207\275<\37350>\336\035a\276\r\250Z\276\376\357\025>f\206K=\0353\351\274\265B\356\275kK\014>\233\221\362\275\376\274\013\276q\000\\>\231^a>\367\3770\276\005\016\371\274\264y\364\275\235`\226= G\343<\325\337\337\275\261\303\023\276\350\366\023\276\\Q:>\'w\022>\030!>=\363\r\214\274\351;\347\271\037\020\032\276\006KY;\272\250\350=\325\232m>E\027d\276X\315\216\273\370\251\230\274\016&)\276u\230\203=\314\322\302<\037R\364\275\030\001\340=\352\001\343\275\027ez;\010\034f\276\234\232(>\032kr=)\224\267\276E\303\265\275\325\337\242\275~\271F\275\312\262H\276%4\244\275\036[\210=\006\243,\275\027\202\272=\210[\214=\346=\311\276\022\237\276<\351\216\n\276\324\3112\276}#\354\275\365\342\264=\333\277\326=\253 r\275\373a&\275\260\017\010\276\216\355\010>\275\336\200>Z\024\300=4p\n\276D\312\240\275\205D\033\275\275f\">\234G*\2752\254\211\275\037o\216\274\206\201\021\275thg>^v\005\276\353\236\316\273\344\317\221\275G|\232\275=\363\005\275\000?\306\275\n\371\324<\272g\345\275\356\277\007\274y(\031>\023)\253;>\010\271=l\021F\275\"\257\330=gP\254>\362\023\261=\257\203\005\276V\264\307<j\233\224\275\337\3465>\201\332\220\276zM\221\275R\205\264=\330lc=\360C\r=z\331\226=\205\033]\276q,)<6\035\362\275r\022\340<\324\341`<&<\276<o}\037>G\"\200>\326\2678=QF\016=e\013\327\275\222\024\257\274\323\346M\276\302,b>\034\344\320=Y\213^\272\335\263Q=\006\262\250\275H\235\013=[\000U\275\336\024\324\275V\327\032\276t\312\010=\022\330\350\275\316k\244>\242S\202\275\331\0375=\022\006\260<L\335s\275/\341\347=!\262\t=\316\221\322=\261\223\267<\242\r>=\230\301\005\2766\363\016>:\032P\273Ut\260=T\306\376\273R\2533>\021[\227\275\325\036*\274\251yh>e\001M\275X\265\344\275\016\016p>\320\026r\275\344\2760\276\2779D=\371p\005=\273I0\276\376\226\330\275n\036\226\274\317\205\323<\353B\001<R\252\277=\2779f=,\266\026>\273`\206\275\207Z\005\276\257\331\372=\271\022\274\276\246Kb\275P\024\300\275\366\037\254\275\004\014\r>,h\201=\226\213\316\276\227\212\244=\321\211\026=\352\n\010=\246{$\274\'\377~\275\330\244\360:\373\345%>G\271B>\241\363\005=\237b\023\276+\026{\275@\006\253=-E2>d\177\233<\220,z>\t\t\307\274\3030\265\275/\223_\276d~*\273\022\342\357\274\355\264\214\276\264L\270\2736u\252\275\222\266O\273\016\321~<\000\\\020\275\325\224R\276%~\334=\305\214\200>\030!\301=/oR<\010<j\275\240\020{\275]E\221\274\215\276*\276C\351\r\276\377\241^\275\261\271\233\275l\023\317\2759?\210=K\270\267=\2116@>u\243\004>\231\272V\275\260\221X\275\244\343\026<Y[7>\365\346)>N\2554=\264O\210>\014\371_>\334\307\204\273\240\232s=\362\254\303=\251\307\033\276\240\001u\273\340A\003\276=\303\373\275\177\224\255>_\332\306=+b\336\2753\330\343\275;I\205\275VD\311\271\207\037\020\275`\371\013>\211\344\315\275\004p\244\275\032\343>\276\317\302B\276[\235)\276l\325\026\275_sp\275\300b\364\275\356+\340=\3574\n>\t\335\303=0\335\204\275:\200p>$\225-;/\327\213<\332\222\212><z\021>2\363\255=\027\024\031=>i\251<\376\376A\276\004\014\026\275\307Y\240\274\215\362Y=b\354\353\275l\270T\276\371,\250<*_\277\275\2527\326<\n\345\362\274{\2538\275\264s\035\276xg*>\252\257\356\273,2p\276\315\230;\275\220\337\321\275\035\250\236>\ng\027=cY\222\275\212h\331\274\363\205F\275r,1>QB)\276\216\254\225=G~`>\202:\033>\335)/\275a+\346=\221\356+=2\2217\276\022\333G\276lb{\274;\013\261<;*\221\274\372\010\215\276\346\262\355=\261l\332=P`\025=\334\t\260=\343\243\n\275U\016+\276,\235I>\377\300\356\275\273E`\274Y\372\217\273\357\2721>\263\022Z<f\316\254;N\272\025>$\361\230=\215\035e\276#\333,\276\237j\325\275n\215\356\274\261!t>\356\301\376\275\r\263w>8\234\312=\206\274\002\276$\307\361=\323j\004\275#\372\364=+T\022\276\264\302\007\276\t\342\232\274p\302K>bQ\027\275\254q@\276\340v\325=\263s%>\305,\n>\341\240\366\275\362\334,=\023l\334\275\007t\205>\332`L\275 \222\226=0\361=>\n\326\327\275\014\314\370=lD\252\275\320\303\334\275\204\036/\275[\310\371\275)*%\275\261h\273\275\340\r\222=\030\225\243\274\210<=\276\r\317\371=\032\013\211=ryn\275\275a\312\275\306{\213>\367W\036\276R\337\374\275"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
