node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 8660937
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\220\303L\276\320,.\276\227\210\025\276VhY>\361\315\307\275\347\002\005>\266\302\211\276\354\206\002;g\3351\275\025SY;\304\210\t\276\365\307@=\006Nc\273\253\320\271\275\375\212\203=\007\266\264\276\240L\200<\201\324\222=?\0326>\2719\224<\367\tE\276\270\306\330\274\361[@=\225\213\213\275*\210d>5H\224=\000)\272\275\2436Y=\2272\301\275z\322\241\275E\245\255=\374-\332\275\322\334\r\276dT\r>\355\276Q\275f\233\240\275g\206\014>u\313\226\274\276\007\331\275\np\010=PG\223\275\267t\032>\025\230\217\275;\306\340\273a+p\275E\336*\276\021\255\002>\034\301\214:\003vP>\215\"\330=\366w\242\275\323>\017>\210W\177\276\370\r\036\275\325U\307\275\263$,\275*\014Q>\031f\204<Pup=\365\343\204>?\275\003\275\236\337\220\275^\250b=9\"_=\300Z\033>\306\262\006\276\030>\004\275$$\004>\017e\247>\272w\245=I\344\366=6\353d>y\026i\276\366,\r\276\004\031\r\276\036\343\036\276Z\177\300=\001\257^\276\027\325|\275\374\345\207<\225s\375\275u\254}<\324\"^\275X\211\271\275\343\271\364=\017\034,\276ze\264=-\2716\276N\2701\275\024\360\231=\032\020\002=\373\242;>E\216\354=wy\344\275#\010\311\275\024\310!>\342X\345\275\330\r\260<2t\224\275\025\262;\2768\001\010\276`H\273\275\253\203j>\255g\373=E\240\202\275\017O\026>F|\r>\020\\\273\274\005\256\253=\325\372?>\350\222v>\327;\023\275y\034\324\275\274d+<\024\033J<\332\025\030=:4%<p@C\276\006<\031>\260\355j=Y\322\216\276q)A;\022\216 >\267\341\254>\202\376\205<\235\364C\275\244F\330=.jA>$q\220\276\314/\316\275\'\226E\2757i\250\275\335#\007\276\261\331\311\275\273\334\320\275\265\325\206=l\006f=\254P*>h\360\371\273b\020\335\274U\251\314=\2729\201>\225\024\317=\314\217\r< \353\005\2764\367p>\223\263\t=>\353y\276\361\234\033=\235c=\276\214\325\272=P9\324\274\275T\010>^E\315\275\224eI=`2j=\201$\"\276\035JY\275K\263E\276 t\300<\310<\037\275\017\201\267=)3\030>o\t\216<u\377\003\276\221\342\254=\255u\350=\240p\317=w\256X\275\\\311\345<\251k\000\276\233\340-\276I>x=/\023\253\274\303\355-\276\341\317(>\346\216\260\274\003\257\336=\373\340\337<\257C\350<\273\217\224>\2226\206\275z\006D>\250\360\201\275\373g\\=\352\007\036>\356\232\326\275\037(\302\274\305Zt=L\255\231<\2214\270\275\257\356?\276\336K:\276\304\345\036\275\240\322\245<\\|\024\276-sL\275\025i\264>\372\021\t\275\001\304\342<M~\030>\353\356&>pK\364=i\014N\275\"\014I;\242[\251\276\360\017\250=\026\263X\275\2744$\276?M5\276\367/z=>\271\344;\023\030\021>z\360\024\275-\272\211=\351\036)>\232\320J\275\235\222\312\274\2162B<\201\354\027>\272\326(>\371\341\213\275\000\351+\275R\255|=\373\305\343\275\336\243D\276\303\356\211=\020*\020\276U\302L>*$J\2756v\345\273\346;h>.\251\260=K\to=U9\314;\374\330\326<\355\000\374\275\301q\216<\272\026K>9\t\235\275\367\220\276=\376\375;>\351C\217\275\376\355U=\004\207.\273,\020o\276Oq\022>\211Z\303\275\017\031\257\275`\201\007>\233\353\310=!\314\327\275\325\334$>\254C\324\275V!\302\276\000\017[\275F\030\363<UE\214>\376L\217\274\r\004\222=\006=f\275ge\321\275,$X>\031g\272\273\001\034I>%X\000=7\nu\276\237[\304;\310\270\246=:>\344\274u\325[\276F\020P=W\333\367\273\250\030\035\276\221\225\204\276\264{M>v\2702>z[\270\274\'m\256=\014\371r\273\234\004@=\251D\314\275\022\376\001=\247R\203\273\017\251a=\2052\220=)S\377<\234\336G>\031\370\010>\001\320l\273H(>\276\275_\033=\260F\000\276a:\006\274\256\242\276\275\2429\237\275o\251\230<Z7\352\275\007\336s=\215~\362\275\267\004\256=,\326(\275\026\250\322\275\240\315<\276\337\205\020\275s\303\351<\024\250\372\274\247P\231;\226\2716=5H\253\274\225\226\310\275,\324\003<~\235N\275!\3022=p\316j\276\343\335\265=D\031\200>\324\344\200\275\202\002\334\274\373\030i=\330\377\226\275R`I=\376\240\231\275{\2008=_\234\032>f\347\004=m\346\016>\3649\262\276\223\363\211\275\355\325\217=-\210\033=lqn<?\361d\276[\365\247\276\277\315\001>\270E\327\275\360O\r>\343K5\276\256\317\325=\334\314\257=\321\023#>\266#\344;Ro\275\275-\003\016\276\237bu\276\020\313-\275;\265\351\274\262Pb=Oi@<\220\207\366\275\236\326E>\243\230\233<\177\300\034=\325&\020\276\250\245\237\276*\3441\275w\246\007>\027GE>\336r\264\275\207\243\314;\033\242J\276f\363\311;\201\260\252\275\211$\244=me\017\276\342\254h=s6\002:\350\216c\276\212\370\346\274\365\207\217\274\313e\210=c$B\273\360\312\257=\333>\006\276_\361\206>\316\315\207>^M\013>\377-\027<Y_\334\275\024\n\227\274E\263\252\275\002\365\226<_?3>\2059q\275\307\315[>\362\355I\275o\005q=I\224\226=\327\033\256\274\303!\250=*\324)>\325\315\262=\276\252\242\276z\351\004\276\304\240\210>\t\303\202>x\350\216\276\272Z\267=mS\330=/\301\277\272*\271\226\275\313[\212\275\262\302\214\275\311\222\254\273H\332\344\275!)\033>?$\000\276/\316\244=\302\2743>\201\274N;\200\236\307\275k\313\350<\235I\367;c\005\007>d\275*=\353\221*\273\005Le\275c\363I\275\216oQ>4GG\275\002\231\314<\335\020\027>\355\255r;\202\205\324\275\326\263\275=\206\302\232<\255W\022=\361\331\273=m\376\255\275\324\007t\275\"+\273\275\302.4\275=3\215>\226H\330\275\031%->\333\007\237\275\350T\352=b+\227\275\311\353\223>0&\016\276\"\341\347=\343\312\273\274\2337?>\0108\204<#wG\275/{\'\274F\347\305\275\032\272l\275\3466\240\273\264\360\265\275tD[\276\025\225\"=\037G\273\275\270\233P\275\327\266\'>\262\325\023\276\355|\352;\373\271\210\276\212\204\300\275]W\002=\227\264\217=\354\3266\276\245\373a=l\236\350\275;\332d\276\234\361/\275\260\232\345=-M\204<\376\202\013<\323\311\273<\275\306d>_\237\272\275\243X#\276\240r\037>>^\360=9\344\025>\301\0338\276:\361\262\276I@a\274\320\200\307=\313\301\024\274n`\242=>p\314=\216][\276\202\233M\2759\362\344=\231\322$\276\311\212H>\305\246\325\274bA\201\275\237\334r\274NC\326\275\273\343X\274/\371/>\312v+>#q?\275\203\330D\276O\006\207=\226\277\031\276F4#=\265\316\201\275\004\231\232>\367\367\225\275\203\257\221\274%U\302=\002\3426>\002\203\205\275\310\327\224<\225\221\314;w\005\232=\'\232\353\275D\236\252>\202P\277\275}\343\340\275kZE\276\306{ \276\215\005,\275\346| \276\3228C=\247]\330;\312$)\276M\357$=E\0005=D\266\273\275\324p >\331\361\010>\352\220\265\275\244\230$<\254l\241\274\350\214|\275\022\237\235\275b:H=\347\201n<\017+\350\275\272I8\276\n\r\315\275\300\0312\276\271\376(\276v>\227>\305\265)>\035\253\207\275\203p-=X>/=\227\370\n=H\323\377<G*\204=vy.\275\337\247\177=\263PN\275\377\214\270\275\377?!<L5\323;\004g\003\276\215o-\276A\316\311<\320\215n\275,U\243<GF\020>\267\231A=\375w\022\276\312m\212\275\266\207!\276\253\225\305\275\314\361\002\276\301\255\234\276\260\036\022\275\024\221\253=\340Z|=\202\221_\274\024\375i<\345Z)<9\024\004>n\223N\276\027F\">\325pO\276\374\004\004\276{w\324\275\211z\263\2750\263\331>\276&x\276-j\014>%\2441\276c\010\207\274:A,\276.\302|\271V\314\211\275\324\tX>G\226<>\t\035W>{\257\243<\315\316\026<j\351P\276<\273=>\215y)\275kU>\274\341\321Y\274\3056\354=4Z\242=\271\243\246=h\201\274\275\367\362\370=\005|\'\276$\3348\276T\343\247\274\\\014\345=\332~W>V5\350=\207!\207=\343W\245\276\304\240\276\273\t-\250={\020\241\275;D*\274\312\265n\275\377\375\366\275\277+\337;\314\277\255\275\254nl\275ID\345\274\3024P>R{\031\275n3C\274\340\244\213\275D\343\235\273\251 \221\275b\247\212=\033\201x>\3274\206=NR2<\240\356\212\275\336\215\031\275\304\244\000\275(\005\177\276\3278\306<M\334\360=\232\344\355=(\306\220;\374\364\024\276\315$\374\275W0\362\275\016\266\226<Za\245=\256\210>=\n\326%=\370\025\225>\210G\264=\252l\255=\250\265\217\275\022jV>\304\275\207>J\340\037>yJ\271=\203\266\030\276\262\324\021\276\342\354\264\2749D\214\274\330\353\220\276#(0\273uS\313\275\266`Q\276\260\262\236=L\215\273\274\315A\244<R\215\204\275[\201+>\'\227N\275\252^\226\275\340\216\353\275|a|\275\370.\204\276hN\316\273L}\253<\352\222\212\275MM\270\275\214D<\276\351oj=\215\016\223=GA\303<8\345\371=\356=#\276\203\327\024=\235$\374=\227\357\265\274\235\020\237\274/\r\032=;<\335\273W\337\277\275\212\217\024>\"\374\354\275I\356\321=>\245\227=\342\302\333;\350\212R\276\211\370\036<\252\243\200\275L\344\337<2oh=\203r\'>9\264K\276)Y!=\360C\035\276\007\010\366=\222\216\003\276\355n\003\276\257\326\351<\255\2314<\031!O>rW\323\276H\\\311\275\262\335\013\276\313\275z\274\007\353\232\276R.\352\273\371\202\275=*\301\n\276f\300\304\275\3679\272=\320\376(\276\255\243\010>pL\224\276\203\243\260=E\'o=1\267y\275\260\037\377=\021\n\205\276\203\312\335=\322\201J\276\345}\337\274\324\027\232<\223\205\245\275\224t\017\274\244\336#>3\345:\276\3470V\276PX\020\276w\005\351\274b\211_=\007*n<\254\225\202=k\001$<5&\274<\255\263N\275\2352\362\275\006g,=\216\003{\276\306\347\004=\315\277\276\275\177\205\\\275\241\330\217\275iB9>\236\222\003=\253\370\345\275\346\014V=\353:\316\275\017\312\256=F\r\311=-h=\2757\311\371\275)\357\312=\3070\t=\335\212/\274>R\322=TzV=V\027\335=N\224\241\274Z\376)\276f\230\216\276\270Zl=\026#\341\274\223\347Z\276^\241\024\276\351r\006\276\033uJ\276*\351\232\276\267\215\007>\370\343(\275\255\363q\276\314*\226\276|\377\362;\277\264<\275\306[\211\276\262\355\217\275\337 \235\275b\326\203=\306\237\335<\233\032M\275\222\316[\276\324\302\223\275\030\001N\275\213PP>L\233\000\276\351{J>\001\326\261=<\321T>[\017\367\275-\n\016>\200b|\274\'Z\236=\252l\017\276\337o\350\275C\335\316\274@B\246\274\324\272K\276\276<d\275>\226:\276\327\002u\276\213X8\276x\346\027\276\267\376D\275\264\0270\276\003\251\354\275y\213\312\275wnK\275\037k\021\276\243\274h<\300A\246=\370\324\305\275\006\315\250\275\303\350\242\275%k\271\275\210\357V\275;\354\260\272tyd\276\246\325o\276\032vF>\246\n\360\275\010\272\001>\2619\267=\013YS\276Y\024L=\351\200\202=\022\371]>\357[Y<\374\010\210=\370\205\213<\207\352\247=\265\305\247\275\225^\307\275\223G\003>\000\311\311\275\230\333q=\023\263\326\274*\005\273\274\272#\307=J\030\220>*x\375=L\320\025>\333<&\276\327\334\246\275\270D\220=9GB=x\3510>\204\005\t\2761\2218=\377\203\035\275\377&;>\001tP:y0\n>U\332\023>\310\253!=\222vT<\345\204\332\275x\000V\275W\303Z\2761N\226\274\000l\212<U\'\215<\2172z\276nP\225=I\313\364<d\233\321;\017\"P=;[/=\226h\242>\367\036\245=n\004\255\275=\214&>x\275\341\275L}\242=\205!\330=\344\201\260\275\241m}>\302c\017\2750\346)\274\332p\212\275\327e\223>\375\334\232\275\035s\006=\201\035\315=\255\360\"\276\373\250\177\274\005\nJ>\327\nA>y\007\222=\210\355\213\2749.\364\274\221%q=\321\227\240\276HdI=.\274\t>\367\347a>\344\314#>O|\331=\214\363}=\310\227\r\275F\202F>\223#V\276\314\307q\275m\237\233=x\310\032>U\016a\275\321\230z\275\010\022\207=N\340m<\365\347g\275:y\223;\210\313\233>\374zu=n)\021=;\214\217=VP\202<*v\332\275\233\347I<\272\221S\274,x\006<\373\223\230=\361a\251\276\227L\234\274\222\362\314\273\233\212)\275\314\224A=\214.\030>drZ\275;p\030\276\224\020M=b\244\201\275A\356\261\275#\315\002>C\376\335=\202\273Z\275\343&$\276\354\200\264>N\364\304=/\277\006=\004\247\246==\r\232=\357\311Y>q\"R\275n\371\027=.\240&>\203\034h=\304\310\252\275P\355Y>D\250\211=\323p\n>\371<u<\007cU\276\210C3>N\010N\276\340\036\365=\330\237:=G\023\313=\250\207\262\275+g\345<\032\347\251;\335\3572\276\307y0\276\005\203\366=\365\240q=\316\013\021>\006\277\341\274\366\217\234=\2475\035>\202\276\306\275\320\024\200\274\306^\203\275\256\014\003>\223\037M\275\013r\353<\235,\314\275\003@\364=@\n\007>xT\000<8,*=\240\203\352\274\370X\222\275\305\2118<F\347\316=C\344\342\272:\304\304\275\237\365\017>N\000\205\275.\001\200>\210\242Z=\356\215I>\355S\003\276\331\017\000<3\222\243\276\275b\267=\200\035\312=2\261L\2765\371\023\275?\251h\276\2760\016>D\345\227>\234\2752> \225=\276_\325}<cB\224>\347GH=\352V\034=\25722\276>\236B=Nx\304=\240\365f\276\264Q\355\274!\341\273=\357\223\242=\002\324B=\201!\025\276\027\000m\275,A\354\275\212\376\263=\221\357\206\276\354\300\212\274=u\">m\005C\274\335\277m\276\246\236\330\274\361){=L\326\021<\251\217\004>2m\177\275\231X\230=\235\311\311=T=\032\276\026\346*>\010r\212\273\301\330\362\2759\241\364\274)X$\275\003\023L\274\024\013t>]EB\275\204\255h\276B)@\276P\005,<\266\t!>n\235c=v\017\240\275V \340\275\"\2351\274T\337\212=\331\250\234\275\'\335\221=6b4<\306\255\'>=\007\366\275ExI\276\212L<\275T\002\204\276\201\313R\275\321\013c>\263\347D\276-v1\276\272\022\034>\336\312\003\275]\227[=2\307\276<O\227\370=\'\266\204\276j7h\2753\212\266=\240\331\210\276\334H\205\275U_^\275\357\314\002>\206\314y<\215Z\002\276\250P\336\275S\032o\276\016g\177\276\246h\216\275\304\020(\276\312C8>\031\024\330=\234\211\027\276\0004\243\275\027\020\377\274\023F\033\276\301\357a\276[\312\270\275\014\224`\275\376\340!\275\216\2456\276\235\372\373\274\221\214\226\275\3062\236\274\3061W=D\217\211\275\350\347\253>]\003H>\2257\276\274\021\344\003>\3500\013\274\004v\215\273\371n\025\276\202kT=\271\205\342\274\021\022\030=FK[\275\274\250\255=\342\356\200=\354\271\347\274\320T\032\274\032\320_>\225@\324\274 `\320=f]\261>\376\301\226<\226\3766={\370\256\274M\017\311=\322\310\221\275\343\341o=\205\033\200>\204\016\374\275\221\263\370<U@X=z\022\341<\211\001o=\216@M=\2737=\276\343\247\306=\030w\256=g\3724=\302\245\006>D(\353\273a\035\206\276\3056\350=\212\035[=\315\324^\273\022|\"=/\024Z;\243_\t>\343i\315\275 \372\300\275\374j\265\276\'\"\356<Tqr\276\351\025\200>\221\277\370\275\031\320E\275\204\255\033=~\205\217==\247F\2761\351\020>\257]H>\277\253\300\275Rv\021\276\246\201\274=\005\252H\276\252\031\312\275\006A\320=\206mg\275\3536\236=wM}=jb\315\275^^\355\275\331J|\274P\234\013=\30578=\245\305Y\275a\n\316\275\206\300\265=\214\362\255\275N\202\342<\010\027K\276\363.9\276Dc\203\276\363Nb>\r/T=\324O2=\274?\335=\353\323Q>\366\332\354=\240\377)\276{R\303<\302a \276\362\235f=K\022z\275-\360\n\274%p\t\276B\327%>\001\360\227<\322]\370;\211B\216=\372E\324=u\233\t>\373\273:>"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
  attr {
    key: "tensor_array_name"
    value {
