node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866910994052887
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 3059753
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\326\226\225=\347y2\275xP\231\275\252&\025\276\221\267\351=\353r\360\273\201\373^\274\212=\020=\231\375\365\274P\240\317=\306\204\210\275qKg\276\340\266w\275\"\025|\275>_4=\223\234l>\tF\325=L/\036>\241,`\276\351\213\r=\223#\333;\305\310I\276\355\331l\273\255\206\300\275v<0\276\240\'\201\275\373\n\003>\237&\343\273\255\247%>\254\345\257>\3727\212\275Ig\304\275n\320\241\276MJ\250=\272\304\326\275.\263\346\275p\027*>\316\013\010\276(\341\026>\000\3568>\305\210H\276\272#\270=\370S\352\275t\241\216=\324\267\257=\373\312\244\274u\027k=f\275\207>\232\177\263\275=W\t\274\315N\313\274\302\263\376\275#\212\204\275\330<\242=4@\307=0x\200\274\016\314\354=\354I\323\275\326\367\t\275\303\350F>\341&B\276\266\231\267\275\023!\224\276\315\330\023\276\327\376\214\275\220\"!>$\333\\>-u\274\275\314r\010\276\265\275\303<`\017\230=K\316\024\275\370\344\377\275ui\003\273\024\371d\275k\374P\276\004/?>\303\377`=\034\377\022\275\013\312\210=L\226\221=W\247\030\274\275\244\217=\252Y]\274g\225=<?\255\207\275\371\224\203\276\344\227\314<\\q\206\275\'\340\205\2760\271K\276\201\021\350<\'m\306\275\t\217\353=7\367$\276\223\202\224==I+\275*tp\276\330\t?\275\2208\323=.\005d>\'R;\276\255\322\201\274\272\320\246=\200R\214\274p\237L\276G\007\271;\370\336\345=\200\r?\275\305\022\016\274AO\302<\274\355\013=\362\232I\275\242\212\021\276\"\'\004>\332w\032\276\007\005\370\275\340\355\316\275O\335o>\334\3644>\317\331\214>\320\362\016\275\0176\224=8\\\240=\345\224\002\276\301\366u\275\344\265\215\275<Yu\274}\2079\275h\2717>\252\245!\276\343\326H>N\374\272<5l_>\035\t\027>\221\274W\276\243\005t>\017\270\261\275\267+V\276\033\017\014\276W\346f\276\251\031\223=\251\350\226\275V\037\342=\274\204\304=a0\371\274k\373\221=c\242\207\272\031\343[\276ER\255=\374\341\341\27300\312\2759]\353<\017O}=\210\256\'\276\234\004?\275\372\311\r=F\225\005\274\2115\212>\207Qt\275p}\263\274\326\322\213\276\252w\243\275\230\302\001\275\372l\325=\347\226\'\276\201[%\276\320i\262=\307\215\201=\256\362\026\276\205\234\"\276\331\n\204=s\237\304\273P\267\363\275f\026\006>{\361W;\256\034\234\275zTT=\034\365B\276\223\023.:\035\271\247=\337\022\026;W\030\326\274\021p\\\276\025\231\023>;\300O\276\035\251\330\274E\367\017\276\0320\004\275\311u\234=\333\276\030>\031\305\013>\001v\213\275\212\347\245\274\260\006\231\274{Q\034\276\036\274\341;\265\233\005=$r\345=\250\363\274\276\210\014\370=u\372\021<y7\227=\352?\271\275\001\377\214=\005\300r\274\304+\373\2753\274\364=A\342\347\275A\254\321=\260xO=\272\"Z=U\225\214;\303\027_>\310=\277;\330\215\205\275\t\240R=\000\241k=>\257\317\275\014,?\275\333\240\213\275\260\247\231=*\371\270\276,W2>\353_\270\275\336O\r>\177v\215\274\312;\375\275\205\344\305\276#??\275\317\230\200\275\311\232\323=\270\351\205\276A\311\335\274\301\362\304\275\325J\237=\230\205\002=\310\320\312=\302\317\232<y\270\222<\306\342\265\275P\237\223\275\032\267\374;\203\346l>\t\222\225<\363\"/\275\220EB\276\340\316\342=,\370\020>\314\353(\276\243P\267\273\316\215o>\333WV>8u\246\275)_\212\275x]\222\274\252N\251\275\322\201\022=\204\315\352\275x\n\356\275\271\230\010;\362\355\007=\\\013\213;<f\034>\033\366\256\276\341\033\346=\305\301\315\275\264\005\016\276\341\371\227<\247\273\372<C\025\344=\351\275g\275\220\212\260=\013;\353<[\007\205\270\366\031\">\343\353\001\2765\242\023\275\220.\207<nN\343=d\250A\276tv\017<\307\306d\275\322[\212=\236:U\276\323\216\245\276\324\376\346\274\325\303\242=\370\261\232\275B\205\364\274;\036v\275\252\306;\275\220~\316\275\0351\036>\tz\006\274\354\201N=}\010N\276\213\345\270=\021\020\\>\363d\225>\260\344\220>\000\360\010\276\263\376\220;\234\003\305=\220\250\243<\207\001\254\275<\263z<\000\320\256=\234\004\375;s\341\"=\'\373)>Yl\206>j\327O\275x\377E\275\334\242M\274\354\240E\275$\337\033=\026\352\303\275\220\245\267;%\300\353=*Y,<\001\003\003\276\224\227\225>\266?k\275Bc\000\276Oov\276b\356\\\275\246~\n\276\233\014a\275\240\233\004\276\245\224O=0\210\205=\264\025\246\273\273\277\221<\236\363\260=\307\003\264\276\213\367\362\275\216\244\330\275-3\242;\211\251\004\276\003\200\210;T\022\231>\327@!>\312#\"\2766.#>@ d<\357\264\035\276;\200\263=#\230\006\276\204\037\034>\373\312\021=\337c6>1\"\250=\256\253\246=b\345\211<@U\000\276\246\370\002\275\213\021\035\276]\364\007\275A\010\035>\314\322\344\275\310^\360\274\212\t\366\275\t\345\227\275J\017\227=\3328\271\275u\337t>\336\370\304=\316\360\005>\224-\n=aY\337\274\243\337(\276*1\177\275\0178X>o\3739\276e`+=trx\276\202\223\256=\363\242\022\275\2406Z\276!u\203:\006\r\327\275Kd7\275\224m\013>\362\342\325\2754\020\341\274YU\300\275\207W<\275v\327d\276\005b\007<\323c4\274\3677\376<\250\016\233\273\314\355\017>\304\216\034>\003\324=>\250J\365\275\263Y\t\276W\305\305<\222\267\304\273_l\364\275\2208i=\373\017Z\275\214\330\247\275\270\225\\>\350\273\307\274.\245[\274\356\0356\276\226\234V=\267\022f> \r\232\275\025\214\350<\177:\327=i\341\336=\224\225\257>\303\231\207\274mz\032\276\305\005m=Da\233\276i\320\204\275\371\313$>\373Xi=\332\200\257\275a,5\275\302\304\263=\301\301d=\r\224\001>\323\021\030\276\332\002\343\275y\342\036\276\262\343c\276\325>\362=\264\023@>\024\353\205;P\232\007\276\2322Q\274^\230\317=\373\2272=\315\312a\273\255\274\200\275\3366_=\320l*>\215\374\312\275\'-\000>\217]\223=/g\265\2745%\005\276\260bc=\346K\010\275\3606\032;\337\n\200>\347:\271\275|\177K\275\002\017\234\275\000\220\325;T\331\243=\0217#>4\327\024\275mv@=\n\331D<{*Y>]\272\240>\031\222\210<7\367\017><`\220\274e\026\n\276\013\327\233\275\2453\r>_/\216\275h\3340>\220\016\253\275\202\240\260\274\276B\203>\302P\353=\032\240\026>\3633r\275\251\310\301>\215\0020>\343y\324=y\347\311\275\356\202\240=3\271(\275\312\221\231=\035\375\311=}[\330=\245J\342<\262!\261=\226D[<\026s\031\275\013\304,\276\247\302\241\275Ce&=4\375\"\276?\250\025>\tN\215\27420\276=0\013\014>\023\255\014>\024\374\017=P\352j\276\247V8=V\335\306\2730~\233\276q\010\257\275]\275!\276\232\304\024>\037\032\362\275Y/\276\275,\205\200>#~(\276\271\023\225<\261N\001\2750W\214=\241\202^=$~\301\275\361E\261<\035\351\001=\356\323V\275K\212B\276\317^\000\276\301\226\236\276_\3766\275\206\177\251<\300E\205=b\253E>\337\221(\275\243\275\366\275\221#\314\274\014\221\201\275\245F\242\275i\254\314=\236\020\005>\357\354\203>\255&\226\276\235\223%\276\310\244{\274\230\034\255=W\325v\276\251\032\\\274\037\250\032\274&2;\276\301\241i<\323\372\226\274\236\244\305\275\311_U\275\375\346\233<\214\005\364<x)O<\rb*>\004\217\224>%\223%\273&\032B\276l\253q> >7>(\350)\274L_\203\275*\226\221\276i\372a\276&b\375<L\327\313\275\244\222\3639\032\305\277\275\332\322;=\365\227\035\275P\001\'>914;\177\000\240\275\321`\255<\366\rn\275\244\346U=q\254\203=;B;>\316\324+>m\202)\276\330\006\224= \027\204\275\276\"\006>\3301Z\275\263\205\035\274E\3378\276F\016\312\275\365\002{=\251\n\007>\005>W>c\234\023>\023\217R\276W\210\377\274W\003y>c\235\243\274\236\244P\276=\007\321\274\311\227~=I+7=\203\374\207\275T\034\245\275*\377\302=\215\240+>MA\365\2754\\\275=HV`> \222\202>{\310\277\275\217\244\346\275R/\217\275\005\033\033\275!r\214=\253\334\362=-\325_<?\036\031>M\337\351\274\236T\265=b\371\236\275\324\0210\276zs/\275,\215>\275\202A\020<\246\366d>\311L\274=\3067\243=R\263[\275Er]\274\'\336\326=)\201k\271\001L\014>\263\212\022>\276\344\202=\025\210\n=c\233\033\275u\274W\275\244zq>R\341\274\276\2307\267;\224\005\303>V\025\311=\301\203x=1\372r=\212\224\342<\222\361\210=\253\350!\276\374a\000>\200N\374\2753\314\022>\020\030g>\254&\221\273\246$\n>\227V\363\275 \017\363\274\240\374\342=1f\312=\341pq\274\376N\347\275{\356!<Er\343\275\022qp>\036D\020\276rt&=01\000\275\223\260f=\240\2751>p\223\341\275?v*\276a\221\r\276\0005.\274\361=+\274o\240\314\275l3\241\275\000N\222\275\311sS=Tb\214\276f.0\275\024|^=\250Q\241\273\262\315\340=\302\277\031>\324Q\212<\374\205\245\275\266\257\254\275x-h>\235TU=e\\\227>\233\343\311\275\252\255\227=Q8\357=\211(\035\275X\377&\276\364\033\316<$QQ>\371\2052\276\334[\344\275\341\3015=\307\t@<Z\244\204\276:Ev<R\250\267=\360X!>\202\326\241=zW*>\\&\t\275<o\253\276\n\032\t\276*{\333<\234q\206<\303\326Q\275\264\320E>\244\014B<\343\244\245\275h\370\260\275*\\N>\0354n\275\036\353\002\275\245a\255\275\324\306K>u\336\004\276\363j\330\2741\027\204<\355C(<\237G7<5\nV\275G3\022\276\241\302}\276\313\034L=\351\202T\276\213;\203=\375\234\375=\026\215M\276#\327k>U1\2679\270s\236=9a(\276<\271U\276\010\276\032=g\366w\276\376\021\226\275\347\001.>N\235\206=\331\222\220\273\243\303\306\275a\263\032\276+\307q>\014\023t\276\205b:\276\177\300v\274\365(\253\275\376\216\2709\367\301`\276\371\334\247\2755\002\377\274%h\033\276\304Q\370\275\017Y\361=x\375<\274\253~d>E:<<\037\031\207=\3165\275=\267\210:\276n\032\315=2+\312\274\304\245.=!U\306=\317 \r>W\330_\275\205\324\366\274\005\312\302\275\024\215h\276\236\2376<.*\376\274g\t\014\275\315\255 \276\366\276`\275\035\350\021\276\274\334m\276\302\377\010<\340+\255<\300\207\241\274\222\377@\276\321\023\026>^\025\226\275\375\'\035=\361\374o\275\014\231\216\275,\341w\276\020\nt=\305\250\265\275H\r\210>\277\352\n\275X\262$\275gz\255\274c\225(>\326:`>q\374h\275\016\225G=C\206\016\276\210\023\254\275b\321<\27538\013\276m&\247<\206\320\220=O\030\r>\206\237-\276\243\022\007=\201\336\205=\377\254\023<\\\354\313=\262\355\037\276\330\021!\273~\315p>Q\351\023\276\"\357\203<g\327\253=\tQ8>\264(\225\275\035\033\214\274\037\003M\275-\222\321\273`5\265\274\312!#\276\263\035\037>-\036\334\275\2272\034\276\367F6>\010q\316\275\257\305\013=\341\232\260=\266\177,>\317\307\001><\365H>\352K\003>\265G!>g4\304\275\342-k\275\316\253\014\276\024?\226=V\224\230\275\356\225\223=&\364\314\276\352\2660\274\360.\265=\205\0004>\352\224\322<\244V\201>\n\266f\275ZH+\276r~\205=L\346p\276F\021(\276\037\334c\274\035f0\276\316(Y>\304A@\276\026$_=\337x\245\275\307\235\260<\253P <\314#\305\275hx\003>\302Y\024\275\266:\271<\004N\261\275\341\t.= \271\026>\205\223\247;:\276\221<\007y\037\276\275 \013\275P\247\217\275\332\236\\=\273:m\276\350-\214\275{\344\320=\347m\345\274\032r<>\277\250\361\275\203\245\271<gW\002>2\310\220\275\333I\262=E\370\371=\261i\221\275\366\033I\275\261f\372=g\017I\276\366\335\000\276\361{\024>\363IE\2731F\356<\300\334\300=\017\306Q=\352N->(\0352>7\354\301\275\350>\334=\314\014W>7$\226\276T\t\034;\264\341i>\300A\261\275\313\177B>\003\322\007>\253\202\335=\205\254]>K\025@\276\017%1\276\343R\260=\235h=>\343n\224=\004I\251\273\206XC>\375\354L\2769\274\244\274\345\214G=\316<S\274vT&=\255S\300=u\260>>M\307\311\275\017\230\035\276b\306u;\355\014\026\276\321v)<w\001\013>\326\236j\276z\362F\276\215\307\'\276\267LK>\306J\210>}A?=\350b\377=6J\213=\215w\220:\272\0206=\205\367\277=z\377\324=\261\271/\276\234~\023\275.4\266\274X\235\263\275<\242\n<:d!\276\260y|=\0267\202=\204%\266\275\257\261\305=\217\276->\332\343\337\275c\367G>\t>\005\276\313\243.>\200\034\001\276Gj\257=\300\032.\275\307\3735\275\020\007\251=\314\251\377=\252E\020>\326P.\275m\014\201\276\177\240\023>r\0047\275\024\271\326<\014\001\364\2737\221d\275\014\243C=\262\345\\\276g\301\t>z\271\234\276{j\355\274RQ\023\276\037\377\216\2745\037(\276\013\031\257>\2127\322<\321\022^<\370\226\305=\014x\032>\307\222\321=\022u\355=N\306\324<9\263\241\275D\370\026<eR\357\275R\357\250=\004G?>\220.\353<\224`\234\275[K\315\274\'\242@\276%\310K>\016\177\254=\232^F>\034a\327=\341w!>\340w\216=\031\315\2529\025\206\316\275\2601\253=\365\227\300=\265D\222\275\233\273\245\275\3440&\276\204\3469=\016\000\"\276\031\330/>\255!\206=e\313U\2767\210\316\275e\006\010=\246\024c\275\351\227C>\\\367%\275\303A\270\274a\010\377\275\237\303u>or\">2\256^<\310P\246\275/;\376\274rc\"\276\032F3\276hZ\243<\361h9={7#\276d\037\235=<\374\242<!\326\340\275\240O\261\274\234NF\275\250z\267<\333\327D>:_ >\246\335\243\274\033R\207=y\357\245>\255\224\307\274~:s\276$\024\200>(t\233<k}\362\274K\3227\273\310TB\275+q\241\276\246\362\021\2769\2411\274j\301\222<J\231Y\275{.\033\275\361\301b\276\213\266\220>n\255\024=*ew\275P\207&\276\342}l\2756\314E\2760Q\024>><\203\275/\022\014=\2777\'\276Q\234*=|\244t\276i\373\277=\326)&> \270\036\275MH>=\341w\343<K\016\257=\307q\n>!\001\314\275\tE\'>O\253\376\275\314\240\013\275\221\351\\\275\211\300\366\275\350\014\221=\215\212\225\275L\267(\276n4\020\274_\014a\275\204@\224=k\203\022\275\334\224C\276!\227\367\275}w\006=\001\000\242=\315U\221=n\300#>0G\224=?\024\367=\350F\031=\231\376\312=\210\177\347<S\356B= \264{>J\306W<\215\265r\275\250\206\374\275\225\nw\2769\216\371=/\346|=\307\302\344<\275\302\225=\215\310\241\276\277J+\276\374a,<\275\0361=\272\330\313=\202\324\311\275\001\275Q>\327\331\326\275\027\t1\276\316U\326<Ug\025\276\334A\013>\275B\267=\255w\304\275\037\301\021<\252\204\026\274\205Z\316=\020\362s\275\207A\351\275\206xN>\200\355.\276\023y\314\275\317f\004\276\220\245\362=>\344 \276\307\306\246=ZVy>\207\r\341<\334}\025\276H\201\334=\275\356->\211\226\237\275Q\002\260>~\025><\250\304?=\365\307\030>/j\364=\367\037\215\275\'\277B\275\206T\270<3>\357\274\014\371\000>\253p\243=\217c\353\275\006\220@>9M\302\274\267\367\301<\376.\342\275\317n\224\274\3524\360\275\316\271t=8\226\303\275\265\226\243=Y\315=\276\366@\036>\303\351\343\275\336\243k\275\341\025D\275\343\357Q>\322\306w\275\270\331\224\275P\272\032\275Y\347\352\275f:h>6\311\223\275\252\370\014>\303h7>\230\036t>\271J\264\275r\210\010=0n\034<,\273\013=mC;\276\035\005\311\275\213Bz\273\373\306\230\276k\023\271<$\277\350=\324}l\2763\236<>\323\267+=n\000J<\255\r \275\377{,\276\304-\337=<+\246\276\nUH\276\305\270\n=\320\347\267=\t\000O><\344\234\275\203V\216=\005\025\016\274M\2747\276.\224;=\031\254\351=\020\034\"\276\3376\324\275U\020\237<cz\002="
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.20000000298023224
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
